TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:26:59 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/config_mode_cmd.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("set_potentiometer_right")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_set_potentiometer_right")

     310 00000052       $C$L12:    
     311                      .dwpsn  file "../Source/App/config_mode_cmd.c",line 56,column 2,is_stmt,isa 0
     312 00000052 9A00          MOVB      AL,#0                 ; [CPU_] |56| 
     313 00000053       $C$L13:    
     314                      .dwpsn  file "../Source/App/config_mode_cmd.c",line 57,column 1,is_stmt,isa 0
     315 00000053 FE82          SUBB      SP,#2                 ; [CPU_U] 
     316                      .dwcfi  cfa_offset, -2
     317              $C$DW$31        .dwtag  DW_TAG_TI_branch
     318                      .dwattr $C$DW$31, DW_AT_low_pc(0x00)
     319                      .dwattr $C$DW$31, DW_AT_TI_return
     320 00000054 0006          LRETR     ; [CPU_] 
     321                      ; return occurs ; [] 
     322                      .dwattr $C$DW$19, DW_AT_TI_end_file("../Source/App/config_mode_cmd.c")
     323                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x39)
     324                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     325                      .dwendentry
     326                      .dwendtag $C$DW$19
     327              
     328              ;**************************************************************
     329              ;* UNDEFINED EXTERNAL REFERENCES                              *
     330              ;**************************************************************
     331                      .global _set_potentiometer_right
     332                      .global _set_potentiometer_left
     333                      .global _set_axis_point
     334                      .global _set_active_model_config
     335                      .global _set_time_angle_middle_usec
     336                      .global _set_time_angle_min_usec
     337                      .global _decrement_servo
     338                      .global _increment_servo
     339                      .global _set_steering_point
     340                      .global _AdcaResultRegs
     341                      .global _EPwm3Regs
     342              
     343              ;***************************************************************
     344              ;* TYPE INFORMATION                                            *
     345              ;***************************************************************
     346              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE    8

     347              $C$DW$T$164     .dwtag  DW_TAG_enumeration_type
     348                      .dwattr $C$DW$T$164, DW_AT_byte_size(0x01)
     349              $C$DW$32        .dwtag  DW_TAG_enumerator, DW_AT_name("COMBINED"), DW_AT_const_value(0x00)
     350              $C$DW$33        .dwtag  DW_TAG_enumerator, DW_AT_name("ARTICULATED_STEERING"), DW_AT_const_value(0x01)
     351              $C$DW$34        .dwtag  DW_TAG_enumerator, DW_AT_name("TURNTABLE_STEERING"), DW_AT_const_value(0x02)
     352              $C$DW$35        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_LEFT"), DW_AT_const_value(0x03)
     353              $C$DW$36        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_RIGHT"), DW_AT_const_value(0x04)
     354              $C$DW$37        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_LEFT"), DW_AT_const_value(0x05)
     355              $C$DW$38        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_MIDDLE"), DW_AT_const_value(0x06)
     356              $C$DW$39        .dwtag  DW_TAG_enumerator, DW_AT_name("INCREMENT_SERVO"), DW_AT_const_value(0x07)
     357              $C$DW$40        .dwtag  DW_TAG_enumerator, DW_AT_name("DECREMENT_SERVO"), DW_AT_const_value(0x08)
     358              $C$DW$41        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_0"), DW_AT_const_value(0x09)
     359              $C$DW$42        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_1"), DW_AT_const_value(0x0a)
     360              $C$DW$43        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_2"), DW_AT_const_value(0x0b)
     361              $C$DW$44        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_3"), DW_AT_const_value(0x0c)
     362              $C$DW$45        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_4"), DW_AT_const_value(0x0d)
     363              $C$DW$46        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_5"), DW_AT_const_value(0x0e)
     364              $C$DW$47        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_6"), DW_AT_const_value(0x0f)
     365              $C$DW$48        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_0"), DW_AT_const_value(0x10)
     366              $C$DW$49        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_1"), DW_AT_const_value(0x11)
     367              $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_2"), DW_AT_const_value(0x12)
     368                      .dwendtag $C$DW$T$164
     369              
     370              $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("config_mode_cmd_t")
     371                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
     372                      .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
     373              
     374              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     375                      .dwattr $C$DW$T$20, DW_AT_name("ADCPPB1RESULT_BITS")
     376                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     377              $C$DW$51        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     379                      .dwattr $C$DW$51, DW_AT_name("PPBRESULT")
     380                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PPBRESULT")
     381                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     382                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     384              $C$DW$52        .dwtag  DW_TAG_member
     385                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     386                      .dwattr $C$DW$52, DW_AT_name("SIGN")
     387                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SIGN")
     388                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     389                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     390                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     391                      .dwendtag $C$DW$T$20
     392              
     393              
     394              $C$DW$T$22      .dwtag  DW_TAG_union_type
     395                      .dwattr $C$DW$T$22, DW_AT_name("ADCPPB1RESULT_REG")
     396                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     397              $C$DW$53        .dwtag  DW_TAG_member
     398                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     399                      .dwattr $C$DW$53, DW_AT_name("all")
     400                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_all")
     401                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE    9

     402                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     403              $C$DW$54        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     405                      .dwattr $C$DW$54, DW_AT_name("bit")
     406                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_bit")
     407                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     408                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     409                      .dwendtag $C$DW$T$22
     410              
     411              
     412              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     413                      .dwattr $C$DW$T$23, DW_AT_name("ADCPPB2RESULT_BITS")
     414                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     415              $C$DW$55        .dwtag  DW_TAG_member
     416                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     417                      .dwattr $C$DW$55, DW_AT_name("PPBRESULT")
     418                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PPBRESULT")
     419                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     420                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     421                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     422              $C$DW$56        .dwtag  DW_TAG_member
     423                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$56, DW_AT_name("SIGN")
     425                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_SIGN")
     426                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     427                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     428                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     429                      .dwendtag $C$DW$T$23
     430              
     431              
     432              $C$DW$T$24      .dwtag  DW_TAG_union_type
     433                      .dwattr $C$DW$T$24, DW_AT_name("ADCPPB2RESULT_REG")
     434                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     435              $C$DW$57        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     437                      .dwattr $C$DW$57, DW_AT_name("all")
     438                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_all")
     439                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     440                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     441              $C$DW$58        .dwtag  DW_TAG_member
     442                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
     443                      .dwattr $C$DW$58, DW_AT_name("bit")
     444                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_bit")
     445                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     446                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     447                      .dwendtag $C$DW$T$24
     448              
     449              
     450              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     451                      .dwattr $C$DW$T$25, DW_AT_name("ADCPPB3RESULT_BITS")
     452                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     453              $C$DW$59        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$59, DW_AT_name("PPBRESULT")
     456                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PPBRESULT")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   10

     457                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     458                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     460              $C$DW$60        .dwtag  DW_TAG_member
     461                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     462                      .dwattr $C$DW$60, DW_AT_name("SIGN")
     463                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_SIGN")
     464                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     465                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     466                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     467                      .dwendtag $C$DW$T$25
     468              
     469              
     470              $C$DW$T$26      .dwtag  DW_TAG_union_type
     471                      .dwattr $C$DW$T$26, DW_AT_name("ADCPPB3RESULT_REG")
     472                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     473              $C$DW$61        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     475                      .dwattr $C$DW$61, DW_AT_name("all")
     476                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     477                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     479              $C$DW$62        .dwtag  DW_TAG_member
     480                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$25)
     481                      .dwattr $C$DW$62, DW_AT_name("bit")
     482                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     483                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     485                      .dwendtag $C$DW$T$26
     486              
     487              
     488              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     489                      .dwattr $C$DW$T$27, DW_AT_name("ADCPPB4RESULT_BITS")
     490                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     491              $C$DW$63        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     493                      .dwattr $C$DW$63, DW_AT_name("PPBRESULT")
     494                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PPBRESULT")
     495                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     496                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     498              $C$DW$64        .dwtag  DW_TAG_member
     499                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     500                      .dwattr $C$DW$64, DW_AT_name("SIGN")
     501                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_SIGN")
     502                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     503                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     504                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     505                      .dwendtag $C$DW$T$27
     506              
     507              
     508              $C$DW$T$28      .dwtag  DW_TAG_union_type
     509                      .dwattr $C$DW$T$28, DW_AT_name("ADCPPB4RESULT_REG")
     510                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     511              $C$DW$65        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   11

     512                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     513                      .dwattr $C$DW$65, DW_AT_name("all")
     514                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
     515                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     516                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     517              $C$DW$66        .dwtag  DW_TAG_member
     518                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$27)
     519                      .dwattr $C$DW$66, DW_AT_name("bit")
     520                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
     521                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     523                      .dwendtag $C$DW$T$28
     524              
     525              
     526              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     527                      .dwattr $C$DW$T$29, DW_AT_name("ADC_RESULT_REGS")
     528                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
     529              $C$DW$67        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     531                      .dwattr $C$DW$67, DW_AT_name("ADCRESULT0")
     532                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_ADCRESULT0")
     533                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     534                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     535              $C$DW$68        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     537                      .dwattr $C$DW$68, DW_AT_name("ADCRESULT1")
     538                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_ADCRESULT1")
     539                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     540                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     541              $C$DW$69        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$69, DW_AT_name("ADCRESULT2")
     544                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_ADCRESULT2")
     545                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     546                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     547              $C$DW$70        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$70, DW_AT_name("ADCRESULT3")
     550                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_ADCRESULT3")
     551                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     552                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     553              $C$DW$71        .dwtag  DW_TAG_member
     554                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     555                      .dwattr $C$DW$71, DW_AT_name("ADCRESULT4")
     556                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ADCRESULT4")
     557                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     558                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     559              $C$DW$72        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     561                      .dwattr $C$DW$72, DW_AT_name("ADCRESULT5")
     562                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_ADCRESULT5")
     563                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     564                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     565              $C$DW$73        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   12

     567                      .dwattr $C$DW$73, DW_AT_name("ADCRESULT6")
     568                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ADCRESULT6")
     569                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     570                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     571              $C$DW$74        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     573                      .dwattr $C$DW$74, DW_AT_name("ADCRESULT7")
     574                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ADCRESULT7")
     575                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     576                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$75        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$75, DW_AT_name("ADCRESULT8")
     580                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_ADCRESULT8")
     581                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     582                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     583              $C$DW$76        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$76, DW_AT_name("ADCRESULT9")
     586                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_ADCRESULT9")
     587                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
     588                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     589              $C$DW$77        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$77, DW_AT_name("ADCRESULT10")
     592                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_ADCRESULT10")
     593                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     594                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     595              $C$DW$78        .dwtag  DW_TAG_member
     596                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     597                      .dwattr $C$DW$78, DW_AT_name("ADCRESULT11")
     598                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_ADCRESULT11")
     599                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
     600                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     601              $C$DW$79        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$79, DW_AT_name("ADCRESULT12")
     604                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ADCRESULT12")
     605                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     606                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     607              $C$DW$80        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$80, DW_AT_name("ADCRESULT13")
     610                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ADCRESULT13")
     611                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
     612                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     613              $C$DW$81        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$81, DW_AT_name("ADCRESULT14")
     616                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_ADCRESULT14")
     617                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     618                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$82        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$82, DW_AT_name("ADCRESULT15")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   13

     622                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ADCRESULT15")
     623                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
     624                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     625              $C$DW$83        .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
     627                      .dwattr $C$DW$83, DW_AT_name("ADCPPB1RESULT")
     628                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ADCPPB1RESULT")
     629                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     630                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$84        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
     633                      .dwattr $C$DW$84, DW_AT_name("ADCPPB2RESULT")
     634                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ADCPPB2RESULT")
     635                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     636                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$85        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$26)
     639                      .dwattr $C$DW$85, DW_AT_name("ADCPPB3RESULT")
     640                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ADCPPB3RESULT")
     641                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     642                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     643              $C$DW$86        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$28)
     645                      .dwattr $C$DW$86, DW_AT_name("ADCPPB4RESULT")
     646                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ADCPPB4RESULT")
     647                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     648                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     649                      .dwendtag $C$DW$T$29
     650              
     651              $C$DW$87        .dwtag  DW_TAG_TI_far_type
     652                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
     653              $C$DW$T$166     .dwtag  DW_TAG_volatile_type
     654                      .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$87)
     655              
     656              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     657                      .dwattr $C$DW$T$30, DW_AT_name("AQCSFRC_BITS")
     658                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     659              $C$DW$88        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     661                      .dwattr $C$DW$88, DW_AT_name("CSFA")
     662                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CSFA")
     663                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     664                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     666              $C$DW$89        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$89, DW_AT_name("CSFB")
     669                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_CSFB")
     670                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     671                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$90        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     675                      .dwattr $C$DW$90, DW_AT_name("rsvd1")
     676                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   14

     677                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     678                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     680                      .dwendtag $C$DW$T$30
     681              
     682              
     683              $C$DW$T$31      .dwtag  DW_TAG_union_type
     684                      .dwattr $C$DW$T$31, DW_AT_name("AQCSFRC_REG")
     685                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     686              $C$DW$91        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$91, DW_AT_name("all")
     689                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
     690                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$92        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$30)
     694                      .dwattr $C$DW$92, DW_AT_name("bit")
     695                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
     696                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     698                      .dwendtag $C$DW$T$31
     699              
     700              
     701              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     702                      .dwattr $C$DW$T$32, DW_AT_name("AQCTLA2_BITS")
     703                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     704              $C$DW$93        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$93, DW_AT_name("T1U")
     707                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_T1U")
     708                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     709                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     711              $C$DW$94        .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     713                      .dwattr $C$DW$94, DW_AT_name("T1D")
     714                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_T1D")
     715                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     716                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     718              $C$DW$95        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$95, DW_AT_name("T2U")
     721                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_T2U")
     722                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     723                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     725              $C$DW$96        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$96, DW_AT_name("T2D")
     728                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_T2D")
     729                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     730                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   15

     732              $C$DW$97        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
     735                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
     736                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     737                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     739                      .dwendtag $C$DW$T$32
     740              
     741              
     742              $C$DW$T$33      .dwtag  DW_TAG_union_type
     743                      .dwattr $C$DW$T$33, DW_AT_name("AQCTLA2_REG")
     744                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     745              $C$DW$98        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$98, DW_AT_name("all")
     748                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
     749                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$99        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$32)
     753                      .dwattr $C$DW$99, DW_AT_name("bit")
     754                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
     755                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     757                      .dwendtag $C$DW$T$33
     758              
     759              
     760              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     761                      .dwattr $C$DW$T$34, DW_AT_name("AQCTLA_BITS")
     762                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     763              $C$DW$100       .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$100, DW_AT_name("ZRO")
     766                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_ZRO")
     767                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     768                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$101       .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$101, DW_AT_name("PRD")
     773                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PRD")
     774                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     775                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     777              $C$DW$102       .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$102, DW_AT_name("CAU")
     780                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_CAU")
     781                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     782                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     784              $C$DW$103       .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$103, DW_AT_name("CAD")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   16

     787                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CAD")
     788                      .dwattr $C$DW$103, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     789                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     791              $C$DW$104       .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     793                      .dwattr $C$DW$104, DW_AT_name("CBU")
     794                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CBU")
     795                      .dwattr $C$DW$104, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     796                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     798              $C$DW$105       .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$105, DW_AT_name("CBD")
     801                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CBD")
     802                      .dwattr $C$DW$105, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     803                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$106       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
     808                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
     809                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     810                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     812                      .dwendtag $C$DW$T$34
     813              
     814              
     815              $C$DW$T$35      .dwtag  DW_TAG_union_type
     816                      .dwattr $C$DW$T$35, DW_AT_name("AQCTLA_REG")
     817                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     818              $C$DW$107       .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$107, DW_AT_name("all")
     821                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
     822                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$108       .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$34)
     826                      .dwattr $C$DW$108, DW_AT_name("bit")
     827                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
     828                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     830                      .dwendtag $C$DW$T$35
     831              
     832              
     833              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     834                      .dwattr $C$DW$T$36, DW_AT_name("AQCTLB2_BITS")
     835                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     836              $C$DW$109       .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     838                      .dwattr $C$DW$109, DW_AT_name("T1U")
     839                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_T1U")
     840                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     841                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   17

     842                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     843              $C$DW$110       .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$110, DW_AT_name("T1D")
     846                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_T1D")
     847                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     848                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     850              $C$DW$111       .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     852                      .dwattr $C$DW$111, DW_AT_name("T2U")
     853                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_T2U")
     854                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     855                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     857              $C$DW$112       .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$112, DW_AT_name("T2D")
     860                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_T2D")
     861                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     862                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$113       .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
     867                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
     868                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     869                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     871                      .dwendtag $C$DW$T$36
     872              
     873              
     874              $C$DW$T$37      .dwtag  DW_TAG_union_type
     875                      .dwattr $C$DW$T$37, DW_AT_name("AQCTLB2_REG")
     876                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     877              $C$DW$114       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$114, DW_AT_name("all")
     880                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
     881                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$115       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
     885                      .dwattr $C$DW$115, DW_AT_name("bit")
     886                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
     887                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     889                      .dwendtag $C$DW$T$37
     890              
     891              
     892              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     893                      .dwattr $C$DW$T$38, DW_AT_name("AQCTLB_BITS")
     894                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     895              $C$DW$116       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   18

     897                      .dwattr $C$DW$116, DW_AT_name("ZRO")
     898                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_ZRO")
     899                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     900                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$117       .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$117, DW_AT_name("PRD")
     905                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PRD")
     906                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     907                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     909              $C$DW$118       .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$118, DW_AT_name("CAU")
     912                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CAU")
     913                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     914                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$119       .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$119, DW_AT_name("CAD")
     919                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CAD")
     920                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     921                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$120       .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$120, DW_AT_name("CBU")
     926                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CBU")
     927                      .dwattr $C$DW$120, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     928                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$121       .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$121, DW_AT_name("CBD")
     933                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CBD")
     934                      .dwattr $C$DW$121, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     935                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$122       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
     940                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
     941                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     942                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     944                      .dwendtag $C$DW$T$38
     945              
     946              
     947              $C$DW$T$39      .dwtag  DW_TAG_union_type
     948                      .dwattr $C$DW$T$39, DW_AT_name("AQCTLB_REG")
     949                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     950              $C$DW$123       .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   19

     952                      .dwattr $C$DW$123, DW_AT_name("all")
     953                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
     954                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$124       .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$38)
     958                      .dwattr $C$DW$124, DW_AT_name("bit")
     959                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
     960                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     962                      .dwendtag $C$DW$T$39
     963              
     964              
     965              $C$DW$T$40      .dwtag  DW_TAG_structure_type
     966                      .dwattr $C$DW$T$40, DW_AT_name("AQCTL_BITS")
     967                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     968              $C$DW$125       .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$125, DW_AT_name("LDAQAMODE")
     971                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_LDAQAMODE")
     972                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     973                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$126       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$126, DW_AT_name("LDAQBMODE")
     978                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_LDAQBMODE")
     979                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     980                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$127       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$127, DW_AT_name("SHDWAQAMODE")
     985                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_SHDWAQAMODE")
     986                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$128       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
     992                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
     993                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     994                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$129       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$129, DW_AT_name("SHDWAQBMODE")
     999                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    1000                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$130       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    1006                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   20

    1007                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1008                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$131       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$131, DW_AT_name("LDAQASYNC")
    1013                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_LDAQASYNC")
    1014                      .dwattr $C$DW$131, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1015                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$132       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$132, DW_AT_name("LDAQBSYNC")
    1020                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_LDAQBSYNC")
    1021                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$133       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$133, DW_AT_name("rsvd3")
    1027                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd3")
    1028                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1029                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1031                      .dwendtag $C$DW$T$40
    1032              
    1033              
    1034              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1035                      .dwattr $C$DW$T$41, DW_AT_name("AQCTL_REG")
    1036                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1037              $C$DW$134       .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$134, DW_AT_name("all")
    1040                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    1041                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$135       .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$40)
    1045                      .dwattr $C$DW$135, DW_AT_name("bit")
    1046                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    1047                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1049                      .dwendtag $C$DW$T$41
    1050              
    1051              
    1052              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1053                      .dwattr $C$DW$T$42, DW_AT_name("AQSFRC_BITS")
    1054                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1055              $C$DW$136       .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$136, DW_AT_name("ACTSFA")
    1058                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ACTSFA")
    1059                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1060                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   21

    1062              $C$DW$137       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$137, DW_AT_name("OTSFA")
    1065                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OTSFA")
    1066                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1067                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$138       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$138, DW_AT_name("ACTSFB")
    1072                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ACTSFB")
    1073                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x02)
    1074                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1076              $C$DW$139       .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$139, DW_AT_name("OTSFB")
    1079                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_OTSFB")
    1080                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$140       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$140, DW_AT_name("RLDCSF")
    1086                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_RLDCSF")
    1087                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1088                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$141       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1093                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1094                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1095                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1097                      .dwendtag $C$DW$T$42
    1098              
    1099              
    1100              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1101                      .dwattr $C$DW$T$43, DW_AT_name("AQSFRC_REG")
    1102                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1103              $C$DW$142       .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$142, DW_AT_name("all")
    1106                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1107                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1108                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$143       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$42)
    1111                      .dwattr $C$DW$143, DW_AT_name("bit")
    1112                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1113                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1114                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1115                      .dwendtag $C$DW$T$43
    1116              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   22

    1117              
    1118              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1119                      .dwattr $C$DW$T$44, DW_AT_name("AQTSRCSEL_BITS")
    1120                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1121              $C$DW$144       .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1123                      .dwattr $C$DW$144, DW_AT_name("T1SEL")
    1124                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_T1SEL")
    1125                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1126                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$145       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$145, DW_AT_name("T2SEL")
    1131                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_T2SEL")
    1132                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1133                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$146       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    1138                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    1139                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1140                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1142                      .dwendtag $C$DW$T$44
    1143              
    1144              
    1145              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1146                      .dwattr $C$DW$T$45, DW_AT_name("AQTSRCSEL_REG")
    1147                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1148              $C$DW$147       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$147, DW_AT_name("all")
    1151                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    1152                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1154              $C$DW$148       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$44)
    1156                      .dwattr $C$DW$148, DW_AT_name("bit")
    1157                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    1158                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1160                      .dwendtag $C$DW$T$45
    1161              
    1162              
    1163              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1164                      .dwattr $C$DW$T$46, DW_AT_name("CMPA_BITS")
    1165                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1166              $C$DW$149       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$149, DW_AT_name("CMPAHR")
    1169                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_CMPAHR")
    1170                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1171                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   23

    1172                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$150       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$150, DW_AT_name("CMPA")
    1176                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_CMPA")
    1177                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1178                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1179                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1180                      .dwendtag $C$DW$T$46
    1181              
    1182              
    1183              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1184                      .dwattr $C$DW$T$47, DW_AT_name("CMPA_REG")
    1185                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1186              $C$DW$151       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    1188                      .dwattr $C$DW$151, DW_AT_name("all")
    1189                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    1190                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1192              $C$DW$152       .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$46)
    1194                      .dwattr $C$DW$152, DW_AT_name("bit")
    1195                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    1196                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1198                      .dwendtag $C$DW$T$47
    1199              
    1200              
    1201              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1202                      .dwattr $C$DW$T$48, DW_AT_name("CMPB_BITS")
    1203                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1204              $C$DW$153       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$153, DW_AT_name("CMPBHR")
    1207                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_CMPBHR")
    1208                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1209                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$154       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$154, DW_AT_name("CMPB")
    1214                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_CMPB")
    1215                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1216                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1217                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1218                      .dwendtag $C$DW$T$48
    1219              
    1220              
    1221              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1222                      .dwattr $C$DW$T$49, DW_AT_name("CMPB_REG")
    1223                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1224              $C$DW$155       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1226                      .dwattr $C$DW$155, DW_AT_name("all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   24

    1227                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    1228                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$156       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$48)
    1232                      .dwattr $C$DW$156, DW_AT_name("bit")
    1233                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    1234                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1236                      .dwendtag $C$DW$T$49
    1237              
    1238              
    1239              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1240                      .dwattr $C$DW$T$50, DW_AT_name("CMPCTL2_BITS")
    1241                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1242              $C$DW$157       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$157, DW_AT_name("LOADCMODE")
    1245                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_LOADCMODE")
    1246                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1247                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$158       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$158, DW_AT_name("LOADDMODE")
    1252                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LOADDMODE")
    1253                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1254                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$159       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$159, DW_AT_name("SHDWCMODE")
    1259                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_SHDWCMODE")
    1260                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1261                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$160       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    1266                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    1267                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1268                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$161       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$161, DW_AT_name("SHDWDMODE")
    1273                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_SHDWDMODE")
    1274                      .dwattr $C$DW$161, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$162       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$162, DW_AT_name("rsvd2")
    1280                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd2")
    1281                      .dwattr $C$DW$162, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x03)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   25

    1282                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$163       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$163, DW_AT_name("LOADCSYNC")
    1287                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_LOADCSYNC")
    1288                      .dwattr $C$DW$163, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1289                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$164       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$164, DW_AT_name("LOADDSYNC")
    1294                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_LOADDSYNC")
    1295                      .dwattr $C$DW$164, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1296                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$165       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$165, DW_AT_name("rsvd3")
    1301                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd3")
    1302                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1303                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1305                      .dwendtag $C$DW$T$50
    1306              
    1307              
    1308              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1309                      .dwattr $C$DW$T$51, DW_AT_name("CMPCTL2_REG")
    1310                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1311              $C$DW$166       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$166, DW_AT_name("all")
    1314                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    1315                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$167       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$50)
    1319                      .dwattr $C$DW$167, DW_AT_name("bit")
    1320                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    1321                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1322                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1323                      .dwendtag $C$DW$T$51
    1324              
    1325              
    1326              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1327                      .dwattr $C$DW$T$52, DW_AT_name("CMPCTL_BITS")
    1328                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1329              $C$DW$168       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$168, DW_AT_name("LOADAMODE")
    1332                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_LOADAMODE")
    1333                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1334                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$169       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   26

    1337                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$169, DW_AT_name("LOADBMODE")
    1339                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_LOADBMODE")
    1340                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1341                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$170       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$170, DW_AT_name("SHDWAMODE")
    1346                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SHDWAMODE")
    1347                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1348                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$171       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    1353                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    1354                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1355                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$172       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$172, DW_AT_name("SHDWBMODE")
    1360                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SHDWBMODE")
    1361                      .dwattr $C$DW$172, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1362                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$173       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$173, DW_AT_name("rsvd2")
    1367                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd2")
    1368                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1369                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$174       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$174, DW_AT_name("SHDWAFULL")
    1374                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SHDWAFULL")
    1375                      .dwattr $C$DW$174, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1376                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$175       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$175, DW_AT_name("SHDWBFULL")
    1381                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_SHDWBFULL")
    1382                      .dwattr $C$DW$175, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$176       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$176, DW_AT_name("LOADASYNC")
    1388                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_LOADASYNC")
    1389                      .dwattr $C$DW$176, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1390                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   27

    1392              $C$DW$177       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$177, DW_AT_name("LOADBSYNC")
    1395                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_LOADBSYNC")
    1396                      .dwattr $C$DW$177, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1397                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$178       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$178, DW_AT_name("rsvd3")
    1402                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd3")
    1403                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1404                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1406                      .dwendtag $C$DW$T$52
    1407              
    1408              
    1409              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1410                      .dwattr $C$DW$T$53, DW_AT_name("CMPCTL_REG")
    1411                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1412              $C$DW$179       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$179, DW_AT_name("all")
    1415                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    1416                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$180       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$52)
    1420                      .dwattr $C$DW$180, DW_AT_name("bit")
    1421                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    1422                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1424                      .dwendtag $C$DW$T$53
    1425              
    1426              
    1427              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1428                      .dwattr $C$DW$T$54, DW_AT_name("DBCTL2_BITS")
    1429                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    1430              $C$DW$181       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$181, DW_AT_name("LOADDBCTLMODE")
    1433                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LOADDBCTLMODE")
    1434                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1435                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1437              $C$DW$182       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$182, DW_AT_name("SHDWDBCTLMODE")
    1440                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SHDWDBCTLMODE")
    1441                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1442                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$183       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   28

    1447                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    1448                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1449                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1451                      .dwendtag $C$DW$T$54
    1452              
    1453              
    1454              $C$DW$T$55      .dwtag  DW_TAG_union_type
    1455                      .dwattr $C$DW$T$55, DW_AT_name("DBCTL2_REG")
    1456                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    1457              $C$DW$184       .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$184, DW_AT_name("all")
    1460                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    1461                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1463              $C$DW$185       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$54)
    1465                      .dwattr $C$DW$185, DW_AT_name("bit")
    1466                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    1467                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1469                      .dwendtag $C$DW$T$55
    1470              
    1471              
    1472              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    1473                      .dwattr $C$DW$T$56, DW_AT_name("DBCTL_BITS")
    1474                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    1475              $C$DW$186       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$186, DW_AT_name("OUT_MODE")
    1478                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_OUT_MODE")
    1479                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1480                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$187       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$187, DW_AT_name("POLSEL")
    1485                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_POLSEL")
    1486                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1487                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1489              $C$DW$188       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$188, DW_AT_name("IN_MODE")
    1492                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_IN_MODE")
    1493                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1494                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$189       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$189, DW_AT_name("LOADREDMODE")
    1499                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_LOADREDMODE")
    1500                      .dwattr $C$DW$189, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1501                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   29

    1502                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$190       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$190, DW_AT_name("LOADFEDMODE")
    1506                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_LOADFEDMODE")
    1507                      .dwattr $C$DW$190, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1508                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$191       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$191, DW_AT_name("SHDWDBREDMODE")
    1513                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SHDWDBREDMODE")
    1514                      .dwattr $C$DW$191, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$192       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$192, DW_AT_name("SHDWDBFEDMODE")
    1520                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_SHDWDBFEDMODE")
    1521                      .dwattr $C$DW$192, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$193       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$193, DW_AT_name("OUTSWAP")
    1527                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_OUTSWAP")
    1528                      .dwattr $C$DW$193, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1529                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$194       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$194, DW_AT_name("DEDB_MODE")
    1534                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DEDB_MODE")
    1535                      .dwattr $C$DW$194, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$195       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$195, DW_AT_name("HALFCYCLE")
    1541                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_HALFCYCLE")
    1542                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1545                      .dwendtag $C$DW$T$56
    1546              
    1547              
    1548              $C$DW$T$57      .dwtag  DW_TAG_union_type
    1549                      .dwattr $C$DW$T$57, DW_AT_name("DBCTL_REG")
    1550                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    1551              $C$DW$196       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1553                      .dwattr $C$DW$196, DW_AT_name("all")
    1554                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    1555                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config_mode_cmd.asm                                                  PAGE   30

    1557              $C$DW$197       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$56)
    1559                      .dwattr $C$DW$197, DW_AT_name("bit")
    1560                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    1561                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1563                      .dwendtag $C$DW$T$57
    1564              
    1565              
    1566              $C$DW$T$58      .dwtag  DW_TAG_structure_type
