TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:36:44 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../motors/config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("AdcSetMode")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_AdcSetMode")
      16                      .dwattr $C$DW$1, DW_AT_declaration

    1551 00000213 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |392| 
    1552 00000214 18C4          AND       *+XAR4[0],#0xffef     ; [CPU_] |392| 
         00000215 FFEF 
    1553                      .dwpsn  file "../motors/config.c",line 393,column 2,is_stmt,isa 0
    1554 00000216 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |393| 
    1555 00000217 18C4          AND       *+XAR4[0],#0xffbf     ; [CPU_] |393| 
         00000218 FFBF 
    1556                      .dwpsn  file "../motors/config.c",line 395,column 2,is_stmt,isa 0
    1557 00000219 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |395| 
    1558 0000021a 18CC          AND       *+XAR4[1],#0xfffe     ; [CPU_] |395| 
         0000021b FFFE 
    1559                      .dwpsn  file "../motors/config.c",line 396,column 2,is_stmt,isa 0
    1560 0000021c 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |396| 
    1561 0000021d 1ACC          OR        *+XAR4[1],#0x0002     ; [CPU_] |396| 
         0000021e 0002 
    1562                      .dwpsn  file "../motors/config.c",line 397,column 2,is_stmt,isa 0
    1563 0000021f 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |397| 
    1564 00000220 1ACC          OR        *+XAR4[1],#0x0004     ; [CPU_] |397| 
         00000221 0004 
    1565                      .dwpsn  file "../motors/config.c",line 398,column 2,is_stmt,isa 0
    1566 00000222 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |398| 
    1567 00000223 18CC          AND       *+XAR4[1],#0xfff7     ; [CPU_] |398| 
         00000224 FFF7 
    1568                      .dwpsn  file "../motors/config.c",line 399,column 2,is_stmt,isa 0
    1569 00000225 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |399| 
    1570 00000226 18CC          AND       *+XAR4[1],#0xffef     ; [CPU_] |399| 
         00000227 FFEF 
    1571                      .dwpsn  file "../motors/config.c",line 401,column 2,is_stmt,isa 0
    1572 00000228 0204          MOVB      ACC,#4                ; [CPU_] |401| 
    1573 00000229 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |401| 
    1574 0000022a 8AA9          MOVL      XAR4,ACC              ; [CPU_] |401| 
    1575 0000022b CCC4          AND       AL,*+XAR4[0],#0xff80  ; [CPU_] |401| 
         0000022c FF80 
    1576 0000022d 5013          ORB       AL,#0x13              ; [CPU_] |401| 
    1577 0000022e 96C4          MOV       *+XAR4[0],AL          ; [CPU_] |401| 
    1578                      .dwpsn  file "../motors/config.c",line 403,column 2,is_stmt,isa 0
    1579 0000022f 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |403| 
    1580 00000230 1AC4          OR        *+XAR4[0],#0x0080     ; [CPU_] |403| 
         00000231 0080 
    1581                      .dwpsn  file "../motors/config.c",line 404,column 1,is_stmt,isa 0
    1582 00000232 FE82          SUBB      SP,#2                 ; [CPU_U] 
    1583                      .dwcfi  cfa_offset, -2
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   32

    1584              $C$DW$132       .dwtag  DW_TAG_TI_branch
    1585                      .dwattr $C$DW$132, DW_AT_low_pc(0x00)
    1586                      .dwattr $C$DW$132, DW_AT_TI_return
    1587 00000233 0006          LRETR     ; [CPU_] 
    1588                      ; return occurs ; [] 
    1589                      .dwattr $C$DW$129, DW_AT_TI_end_file("../motors/config.c")
    1590                      .dwattr $C$DW$129, DW_AT_TI_end_line(0x194)
    1591                      .dwattr $C$DW$129, DW_AT_TI_end_column(0x01)
    1592                      .dwendentry
    1593                      .dwendtag $C$DW$129
    1594              
    1595              ;**************************************************************
    1596              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1597              ;**************************************************************
    1598                      .global _AdcSetMode
    1599                      .global _GPIO_SetupPinMux
    1600                      .global _InitFlash_Bank0
    1601                      .global _InitSysPll
    1602                      .global _DisableDog
    1603                      .global _F28x_usDelay
    1604                      .global _GPIO_WritePin
    1605                      .global _GPIO_SetupPinOptions
    1606                      .global _GPIO_EnableUnbondedIOPullups
    1607                      .global _InitPeripheralClocks
    1608                      .global _RamfuncsLoadSize
    1609                      .global _RamfuncsLoadStart
    1610                      .global _RamfuncsRunStart
    1611                      .global _AnalogSubsysRegs
    1612                      .global _AdcbRegs
    1613                      .global _AdcaRegs
    1614                      .global _CpuSysRegs
    1615                      .global _memcpy
    1616              
    1617              ;***************************************************************
    1618              ;* TYPE INFORMATION                                            *
    1619              ;***************************************************************
    1620              
    1621              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1622                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
    1623                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1624              $C$DW$133       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$133, DW_AT_name("BURSTTRIGSEL")
    1627                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    1628                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    1629                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1630                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1631              $C$DW$134       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1633                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1634                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1635                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1636                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$135       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   33

    1639                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1640                      .dwattr $C$DW$135, DW_AT_name("BURSTSIZE")
    1641                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_BURSTSIZE")
    1642                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1643                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1644                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$136       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    1648                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    1649                      .dwattr $C$DW$136, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x03)
    1650                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1652              $C$DW$137       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1654                      .dwattr $C$DW$137, DW_AT_name("BURSTEN")
    1655                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_BURSTEN")
    1656                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1657                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1659                      .dwendtag $C$DW$T$20
    1660              
    1661              
    1662              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1663                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
    1664                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1665              $C$DW$138       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$138, DW_AT_name("all")
    1668                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1669                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$139       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1673                      .dwattr $C$DW$139, DW_AT_name("bit")
    1674                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1675                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1677                      .dwendtag $C$DW$T$21
    1678              
    1679              
    1680              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1681                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
    1682                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1683              $C$DW$140       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1685                      .dwattr $C$DW$140, DW_AT_name("FREECOUNT")
    1686                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_FREECOUNT")
    1687                      .dwattr $C$DW$140, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1688                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$141       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1693                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   34

    1694                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1695                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1697                      .dwendtag $C$DW$T$22
    1698              
    1699              
    1700              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1701                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
    1702                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1703              $C$DW$142       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$142, DW_AT_name("all")
    1706                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1707                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1709              $C$DW$143       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$22)
    1711                      .dwattr $C$DW$143, DW_AT_name("bit")
    1712                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1713                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1715                      .dwendtag $C$DW$T$23
    1716              
    1717              
    1718              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1719                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
    1720                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1721              $C$DW$144       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1724                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1725                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1726                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$145       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$145, DW_AT_name("INTPULSEPOS")
    1731                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_INTPULSEPOS")
    1732                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1733                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1734                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$146       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1737                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    1738                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    1739                      .dwattr $C$DW$146, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x04)
    1740                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1742              $C$DW$147       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$147, DW_AT_name("ADCPWDNZ")
    1745                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCPWDNZ")
    1746                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1747                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   35

    1749              $C$DW$148       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$148, DW_AT_name("ADCBSYCHN")
    1752                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCBSYCHN")
    1753                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1754                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$149       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$149, DW_AT_name("rsvd3")
    1759                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd3")
    1760                      .dwattr $C$DW$149, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1761                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$150       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$150, DW_AT_name("ADCBSY")
    1766                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCBSY")
    1767                      .dwattr $C$DW$150, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1768                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$151       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$151, DW_AT_name("rsvd4")
    1773                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd4")
    1774                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1775                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1777                      .dwendtag $C$DW$T$24
    1778              
    1779              
    1780              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1781                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
    1782                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1783              $C$DW$152       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$152, DW_AT_name("all")
    1786                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    1787                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$153       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$24)
    1791                      .dwattr $C$DW$153, DW_AT_name("bit")
    1792                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    1793                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1795                      .dwendtag $C$DW$T$25
    1796              
    1797              
    1798              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1799                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
    1800                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1801              $C$DW$154       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$154, DW_AT_name("PRESCALE")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   36

    1804                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PRESCALE")
    1805                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1806                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1808              $C$DW$155       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$155, DW_AT_name("rsvd1")
    1811                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd1")
    1812                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1813                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$156       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$156, DW_AT_name("RESOLUTION")
    1818                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RESOLUTION")
    1819                      .dwattr $C$DW$156, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$157       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$157, DW_AT_name("SIGNALMODE")
    1825                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SIGNALMODE")
    1826                      .dwattr $C$DW$157, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1827                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$158       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    1832                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    1833                      .dwattr $C$DW$158, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    1834                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$159       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$159, DW_AT_name("rsvd3")
    1839                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd3")
    1840                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    1841                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1843                      .dwendtag $C$DW$T$26
    1844              
    1845              
    1846              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1847                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
    1848                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1849              $C$DW$160       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$160, DW_AT_name("all")
    1852                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    1853                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$161       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$26)
    1857                      .dwattr $C$DW$161, DW_AT_name("bit")
    1858                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   37

    1859                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1861                      .dwendtag $C$DW$T$27
    1862              
    1863              
    1864              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1865                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
    1866                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1867              $C$DW$162       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$162, DW_AT_name("PPB1TRIPHI")
    1870                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1871                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1872                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1874              $C$DW$163       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$163, DW_AT_name("PPB1TRIPLO")
    1877                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1878                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1879                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$164       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1883                      .dwattr $C$DW$164, DW_AT_name("PPB1ZERO")
    1884                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PPB1ZERO")
    1885                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1886                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1888              $C$DW$165       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1890                      .dwattr $C$DW$165, DW_AT_name("rsvd1")
    1891                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd1")
    1892                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1893                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1895              $C$DW$166       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$166, DW_AT_name("PPB2TRIPHI")
    1898                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1899                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1900                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1902              $C$DW$167       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1904                      .dwattr $C$DW$167, DW_AT_name("PPB2TRIPLO")
    1905                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1906                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1907                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$168       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$168, DW_AT_name("PPB2ZERO")
    1912                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PPB2ZERO")
    1913                      .dwattr $C$DW$168, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   38

    1914                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1916              $C$DW$169       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1918                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    1919                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    1920                      .dwattr $C$DW$169, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1921                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$170       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$170, DW_AT_name("PPB3TRIPHI")
    1926                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1927                      .dwattr $C$DW$170, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1930              $C$DW$171       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$171, DW_AT_name("PPB3TRIPLO")
    1933                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1934                      .dwattr $C$DW$171, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1935                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1936                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1937              $C$DW$172       .dwtag  DW_TAG_member
    1938                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1939                      .dwattr $C$DW$172, DW_AT_name("PPB3ZERO")
    1940                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PPB3ZERO")
    1941                      .dwattr $C$DW$172, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1942                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1944              $C$DW$173       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1946                      .dwattr $C$DW$173, DW_AT_name("rsvd3")
    1947                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd3")
    1948                      .dwattr $C$DW$173, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1949                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$174       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1953                      .dwattr $C$DW$174, DW_AT_name("PPB4TRIPHI")
    1954                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1955                      .dwattr $C$DW$174, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1956                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1958              $C$DW$175       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$175, DW_AT_name("PPB4TRIPLO")
    1961                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1962                      .dwattr $C$DW$175, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1963                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$176       .dwtag  DW_TAG_member
    1966                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$176, DW_AT_name("PPB4ZERO")
    1968                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PPB4ZERO")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   39

    1969                      .dwattr $C$DW$176, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1970                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1972              $C$DW$177       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1974                      .dwattr $C$DW$177, DW_AT_name("rsvd4")
    1975                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd4")
    1976                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1977                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1979                      .dwendtag $C$DW$T$28
    1980              
    1981              
    1982              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1983                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
    1984                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1985              $C$DW$178       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$178, DW_AT_name("all")
    1988                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_all")
    1989                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1991              $C$DW$179       .dwtag  DW_TAG_member
    1992                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$28)
    1993                      .dwattr $C$DW$179, DW_AT_name("bit")
    1994                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_bit")
    1995                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1997                      .dwendtag $C$DW$T$29
    1998              
    1999              
    2000              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2001                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
    2002                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2003              $C$DW$180       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$180, DW_AT_name("PPB1TRIPHI")
    2006                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2007                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2008                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2009                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$181       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2012                      .dwattr $C$DW$181, DW_AT_name("PPB1TRIPLO")
    2013                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2014                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2015                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2016                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$182       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2019                      .dwattr $C$DW$182, DW_AT_name("PPB1ZERO")
    2020                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PPB1ZERO")
    2021                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2022                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   40

    2024              $C$DW$183       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2026                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2027                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2028                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2029                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$184       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2033                      .dwattr $C$DW$184, DW_AT_name("PPB2TRIPHI")
    2034                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2035                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2038              $C$DW$185       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2040                      .dwattr $C$DW$185, DW_AT_name("PPB2TRIPLO")
    2041                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2042                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2043                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2045              $C$DW$186       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$186, DW_AT_name("PPB2ZERO")
    2048                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PPB2ZERO")
    2049                      .dwattr $C$DW$186, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2050                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2051                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$187       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2054                      .dwattr $C$DW$187, DW_AT_name("rsvd2")
    2055                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd2")
    2056                      .dwattr $C$DW$187, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2057                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$188       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2061                      .dwattr $C$DW$188, DW_AT_name("PPB3TRIPHI")
    2062                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2063                      .dwattr $C$DW$188, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2064                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2066              $C$DW$189       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$189, DW_AT_name("PPB3TRIPLO")
    2069                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2070                      .dwattr $C$DW$189, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2071                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2073              $C$DW$190       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2075                      .dwattr $C$DW$190, DW_AT_name("PPB3ZERO")
    2076                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PPB3ZERO")
    2077                      .dwattr $C$DW$190, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2078                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   41

    2079                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2080              $C$DW$191       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2082                      .dwattr $C$DW$191, DW_AT_name("rsvd3")
    2083                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd3")
    2084                      .dwattr $C$DW$191, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2085                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2087              $C$DW$192       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$192, DW_AT_name("PPB4TRIPHI")
    2090                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2091                      .dwattr $C$DW$192, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2092                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$193       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2096                      .dwattr $C$DW$193, DW_AT_name("PPB4TRIPLO")
    2097                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2098                      .dwattr $C$DW$193, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$194       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$194, DW_AT_name("PPB4ZERO")
    2104                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_PPB4ZERO")
    2105                      .dwattr $C$DW$194, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2106                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$195       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$195, DW_AT_name("rsvd4")
    2111                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd4")
    2112                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2115                      .dwendtag $C$DW$T$30
    2116              
    2117              
    2118              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2119                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
    2120                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2121              $C$DW$196       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2123                      .dwattr $C$DW$196, DW_AT_name("all")
    2124                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    2125                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$197       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$30)
    2129                      .dwattr $C$DW$197, DW_AT_name("bit")
    2130                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    2131                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2133                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   42

    2134              
    2135              
    2136              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2137                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
    2138                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2139              $C$DW$198       .dwtag  DW_TAG_member
    2140                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2141                      .dwattr $C$DW$198, DW_AT_name("PPB1TRIPHI")
    2142                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2143                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2144                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2146              $C$DW$199       .dwtag  DW_TAG_member
    2147                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2148                      .dwattr $C$DW$199, DW_AT_name("PPB1TRIPLO")
    2149                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2150                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2151                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2152                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2153              $C$DW$200       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2155                      .dwattr $C$DW$200, DW_AT_name("PPB1ZERO")
    2156                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PPB1ZERO")
    2157                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2158                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$201       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2162                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2163                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2164                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2165                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2166                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2167              $C$DW$202       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2169                      .dwattr $C$DW$202, DW_AT_name("PPB2TRIPHI")
    2170                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2171                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2172                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$203       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2176                      .dwattr $C$DW$203, DW_AT_name("PPB2TRIPLO")
    2177                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2178                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2179                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2181              $C$DW$204       .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2183                      .dwattr $C$DW$204, DW_AT_name("PPB2ZERO")
    2184                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PPB2ZERO")
    2185                      .dwattr $C$DW$204, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2186                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$205       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   43

    2189                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$205, DW_AT_name("rsvd2")
    2191                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd2")
    2192                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2193                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2194                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2195              $C$DW$206       .dwtag  DW_TAG_member
    2196                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2197                      .dwattr $C$DW$206, DW_AT_name("PPB3TRIPHI")
    2198                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2199                      .dwattr $C$DW$206, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2200                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2201                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2202              $C$DW$207       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2204                      .dwattr $C$DW$207, DW_AT_name("PPB3TRIPLO")
    2205                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2206                      .dwattr $C$DW$207, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2207                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2209              $C$DW$208       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$208, DW_AT_name("PPB3ZERO")
    2212                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_PPB3ZERO")
    2213                      .dwattr $C$DW$208, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2214                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2216              $C$DW$209       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2218                      .dwattr $C$DW$209, DW_AT_name("rsvd3")
    2219                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd3")
    2220                      .dwattr $C$DW$209, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2221                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2222                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2223              $C$DW$210       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2225                      .dwattr $C$DW$210, DW_AT_name("PPB4TRIPHI")
    2226                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2227                      .dwattr $C$DW$210, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2228                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$211       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$211, DW_AT_name("PPB4TRIPLO")
    2233                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2234                      .dwattr $C$DW$211, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2235                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2237              $C$DW$212       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2239                      .dwattr $C$DW$212, DW_AT_name("PPB4ZERO")
    2240                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PPB4ZERO")
    2241                      .dwattr $C$DW$212, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2242                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   44

    2244              $C$DW$213       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2246                      .dwattr $C$DW$213, DW_AT_name("rsvd4")
    2247                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd4")
    2248                      .dwattr $C$DW$213, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2249                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2250                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2251                      .dwendtag $C$DW$T$32
    2252              
    2253              
    2254              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2255                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    2256                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2257              $C$DW$214       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$214, DW_AT_name("all")
    2260                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_all")
    2261                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$215       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$32)
    2265                      .dwattr $C$DW$215, DW_AT_name("bit")
    2266                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_bit")
    2267                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2269                      .dwendtag $C$DW$T$33
    2270              
    2271              
    2272              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2273                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    2274                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2275              $C$DW$216       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2277                      .dwattr $C$DW$216, DW_AT_name("PPB1TRIPHI")
    2278                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    2279                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2280                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2282              $C$DW$217       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2284                      .dwattr $C$DW$217, DW_AT_name("PPB1TRIPLO")
    2285                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    2286                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2287                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$218       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$218, DW_AT_name("PPB1ZERO")
    2292                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PPB1ZERO")
    2293                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2294                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2296              $C$DW$219       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2298                      .dwattr $C$DW$219, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   45

    2299                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd1")
    2300                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2301                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2302                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2303              $C$DW$220       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2305                      .dwattr $C$DW$220, DW_AT_name("PPB2TRIPHI")
    2306                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    2307                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2308                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2310              $C$DW$221       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2312                      .dwattr $C$DW$221, DW_AT_name("PPB2TRIPLO")
    2313                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    2314                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2315                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2317              $C$DW$222       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2319                      .dwattr $C$DW$222, DW_AT_name("PPB2ZERO")
    2320                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PPB2ZERO")
    2321                      .dwattr $C$DW$222, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2322                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2324              $C$DW$223       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$223, DW_AT_name("rsvd2")
    2327                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd2")
    2328                      .dwattr $C$DW$223, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2329                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2330                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2331              $C$DW$224       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2333                      .dwattr $C$DW$224, DW_AT_name("PPB3TRIPHI")
    2334                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    2335                      .dwattr $C$DW$224, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2336                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2337                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2338              $C$DW$225       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2340                      .dwattr $C$DW$225, DW_AT_name("PPB3TRIPLO")
    2341                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    2342                      .dwattr $C$DW$225, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2343                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2344                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2345              $C$DW$226       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2347                      .dwattr $C$DW$226, DW_AT_name("PPB3ZERO")
    2348                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_PPB3ZERO")
    2349                      .dwattr $C$DW$226, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2350                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2351                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2352              $C$DW$227       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   46

    2354                      .dwattr $C$DW$227, DW_AT_name("rsvd3")
    2355                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd3")
    2356                      .dwattr $C$DW$227, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2357                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2358                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2359              $C$DW$228       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2361                      .dwattr $C$DW$228, DW_AT_name("PPB4TRIPHI")
    2362                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    2363                      .dwattr $C$DW$228, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2364                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2365                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2366              $C$DW$229       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2368                      .dwattr $C$DW$229, DW_AT_name("PPB4TRIPLO")
    2369                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    2370                      .dwattr $C$DW$229, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2371                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2372                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2373              $C$DW$230       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2375                      .dwattr $C$DW$230, DW_AT_name("PPB4ZERO")
    2376                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_PPB4ZERO")
    2377                      .dwattr $C$DW$230, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2378                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2379                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2380              $C$DW$231       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2382                      .dwattr $C$DW$231, DW_AT_name("rsvd4")
    2383                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd4")
    2384                      .dwattr $C$DW$231, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2385                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2387                      .dwendtag $C$DW$T$34
    2388              
    2389              
    2390              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2391                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    2392                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2393              $C$DW$232       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2395                      .dwattr $C$DW$232, DW_AT_name("all")
    2396                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_all")
    2397                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2398                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2399              $C$DW$233       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$34)
    2401                      .dwattr $C$DW$233, DW_AT_name("bit")
    2402                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_bit")
    2403                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2405                      .dwendtag $C$DW$T$35
    2406              
    2407              
    2408              $C$DW$T$36      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   47

    2409                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    2410                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2411              $C$DW$234       .dwtag  DW_TAG_member
    2412                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2413                      .dwattr $C$DW$234, DW_AT_name("ADCINT1")
    2414                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_ADCINT1")
    2415                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2416                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$235       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2420                      .dwattr $C$DW$235, DW_AT_name("ADCINT2")
    2421                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_ADCINT2")
    2422                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2423                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2424                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2425              $C$DW$236       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2427                      .dwattr $C$DW$236, DW_AT_name("ADCINT3")
    2428                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_ADCINT3")
    2429                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2430                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2432              $C$DW$237       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2434                      .dwattr $C$DW$237, DW_AT_name("ADCINT4")
    2435                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ADCINT4")
    2436                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2437                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2438                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2439              $C$DW$238       .dwtag  DW_TAG_member
    2440                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2441                      .dwattr $C$DW$238, DW_AT_name("rsvd1")
    2442                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd1")
    2443                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2444                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2445                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2446                      .dwendtag $C$DW$T$36
    2447              
    2448              
    2449              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2450                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    2451                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2452              $C$DW$239       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2454                      .dwattr $C$DW$239, DW_AT_name("all")
    2455                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
    2456                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2458              $C$DW$240       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$36)
    2460                      .dwattr $C$DW$240, DW_AT_name("bit")
    2461                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
    2462                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2463                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   48

    2464                      .dwendtag $C$DW$T$37
    2465              
    2466              
    2467              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2468                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    2469                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2470              $C$DW$241       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2472                      .dwattr $C$DW$241, DW_AT_name("ADCINT1")
    2473                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_ADCINT1")
    2474                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2475                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2476                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$242       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2479                      .dwattr $C$DW$242, DW_AT_name("ADCINT2")
    2480                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_ADCINT2")
    2481                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2482                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$243       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$243, DW_AT_name("ADCINT3")
    2487                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_ADCINT3")
    2488                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2489                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2490                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2491              $C$DW$244       .dwtag  DW_TAG_member
    2492                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2493                      .dwattr $C$DW$244, DW_AT_name("ADCINT4")
    2494                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_ADCINT4")
    2495                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2496                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2497                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2498              $C$DW$245       .dwtag  DW_TAG_member
    2499                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2500                      .dwattr $C$DW$245, DW_AT_name("rsvd1")
    2501                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd1")
    2502                      .dwattr $C$DW$245, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2503                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2504                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2505                      .dwendtag $C$DW$T$38
    2506              
    2507              
    2508              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2509                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    2510                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2511              $C$DW$246       .dwtag  DW_TAG_member
    2512                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2513                      .dwattr $C$DW$246, DW_AT_name("all")
    2514                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_all")
    2515                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2516                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$247       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   49

    2519                      .dwattr $C$DW$247, DW_AT_name("bit")
    2520                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_bit")
    2521                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2522                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2523                      .dwendtag $C$DW$T$39
    2524              
    2525              
    2526              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2527                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    2528                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2529              $C$DW$248       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2531                      .dwattr $C$DW$248, DW_AT_name("ADCINT1")
    2532                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_ADCINT1")
    2533                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2534                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$249       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2538                      .dwattr $C$DW$249, DW_AT_name("ADCINT2")
    2539                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_ADCINT2")
    2540                      .dwattr $C$DW$249, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2541                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2542                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2543              $C$DW$250       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2545                      .dwattr $C$DW$250, DW_AT_name("ADCINT3")
    2546                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ADCINT3")
    2547                      .dwattr $C$DW$250, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2548                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2549                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$251       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2552                      .dwattr $C$DW$251, DW_AT_name("ADCINT4")
    2553                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_ADCINT4")
    2554                      .dwattr $C$DW$251, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2555                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2556                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2557              $C$DW$252       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$252, DW_AT_name("rsvd1")
    2560                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd1")
    2561                      .dwattr $C$DW$252, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2562                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2564                      .dwendtag $C$DW$T$40
    2565              
    2566              
    2567              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2568                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    2569                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2570              $C$DW$253       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2572                      .dwattr $C$DW$253, DW_AT_name("all")
    2573                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   50

    2574                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2576              $C$DW$254       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$40)
    2578                      .dwattr $C$DW$254, DW_AT_name("bit")
    2579                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_bit")
    2580                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2581                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2582                      .dwendtag $C$DW$T$41
    2583              
    2584              
    2585              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2586                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
    2587                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2588              $C$DW$255       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$255, DW_AT_name("ADCINT1")
    2591                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_ADCINT1")
    2592                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2593                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$256       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    2597                      .dwattr $C$DW$256, DW_AT_name("ADCINT2")
    2598                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_ADCINT2")
    2599                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2600                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2601                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$257       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2604                      .dwattr $C$DW$257, DW_AT_name("ADCINT3")
    2605                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_ADCINT3")
    2606                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2607                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2609              $C$DW$258       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$258, DW_AT_name("ADCINT4")
    2612                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_ADCINT4")
    2613                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2614                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$259       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2618                      .dwattr $C$DW$259, DW_AT_name("rsvd1")
    2619                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_rsvd1")
    2620                      .dwattr $C$DW$259, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2621                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2622                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2623                      .dwendtag $C$DW$T$42
    2624              
    2625              
    2626              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2627                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    2628                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   51

    2629              $C$DW$260       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2631                      .dwattr $C$DW$260, DW_AT_name("all")
    2632                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_all")
    2633                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2634                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2635              $C$DW$261       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$42)
    2637                      .dwattr $C$DW$261, DW_AT_name("bit")
    2638                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_bit")
    2639                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2640                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2641                      .dwendtag $C$DW$T$43
    2642              
    2643              
    2644              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2645                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    2646                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2647              $C$DW$262       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2649                      .dwattr $C$DW$262, DW_AT_name("INT1SEL")
    2650                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INT1SEL")
    2651                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2652                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2653                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2654              $C$DW$263       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2656                      .dwattr $C$DW$263, DW_AT_name("rsvd1")
    2657                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd1")
    2658                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2659                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2661              $C$DW$264       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2663                      .dwattr $C$DW$264, DW_AT_name("INT1E")
    2664                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INT1E")
    2665                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2666                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$265       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$265, DW_AT_name("INT1CONT")
    2671                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INT1CONT")
    2672                      .dwattr $C$DW$265, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2673                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2675              $C$DW$266       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2677                      .dwattr $C$DW$266, DW_AT_name("rsvd2")
    2678                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_rsvd2")
    2679                      .dwattr $C$DW$266, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2680                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$267       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   52

    2684                      .dwattr $C$DW$267, DW_AT_name("INT2SEL")
    2685                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INT2SEL")
    2686                      .dwattr $C$DW$267, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    2687                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2689              $C$DW$268       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$268, DW_AT_name("rsvd3")
    2692                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd3")
    2693                      .dwattr $C$DW$268, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2694                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$269       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2698                      .dwattr $C$DW$269, DW_AT_name("INT2E")
    2699                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INT2E")
    2700                      .dwattr $C$DW$269, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2701                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2702                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2703              $C$DW$270       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2705                      .dwattr $C$DW$270, DW_AT_name("INT2CONT")
    2706                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INT2CONT")
    2707                      .dwattr $C$DW$270, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2708                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2709                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$271       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2712                      .dwattr $C$DW$271, DW_AT_name("rsvd4")
    2713                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_rsvd4")
    2714                      .dwattr $C$DW$271, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2715                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2716                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2717                      .dwendtag $C$DW$T$44
    2718              
    2719              
    2720              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2721                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTSEL1N2_REG")
    2722                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2723              $C$DW$272       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$272, DW_AT_name("all")
    2726                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_all")
    2727                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2728                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2729              $C$DW$273       .dwtag  DW_TAG_member
    2730                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$44)
    2731                      .dwattr $C$DW$273, DW_AT_name("bit")
    2732                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_bit")
    2733                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2734                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2735                      .dwendtag $C$DW$T$45
    2736              
    2737              
    2738              $C$DW$T$46      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:46 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
config.asm                                                           PAGE   53

    2739                      .dwattr $C$DW$T$46, DW_AT_name("ADCINTSEL3N4_BITS")
    2740                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2741              $C$DW$274       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    2743                      .dwattr $C$DW$274, DW_AT_name("INT3SEL")
    2744                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_INT3SEL")
    2745                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2746                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2748              $C$DW$275       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2750                      .dwattr $C$DW$275, DW_AT_name("rsvd1")
    2751                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_rsvd1")
    2752                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2753                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2755              $C$DW$276       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$276, DW_AT_name("INT3E")
    2758                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INT3E")
    2759                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2760                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$277       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2764                      .dwattr $C$DW$277, DW_AT_name("INT3CONT")
    2765                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INT3CONT")
    2766                      .dwattr $C$DW$277, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2767                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2769              $C$DW$278       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$278, DW_AT_name("rsvd2")
    2772                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_rsvd2")
    2773                      .dwattr $C$DW$278, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2774                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$279       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2778                      .dwattr $C$DW$279, DW_AT_name("INT4SEL")
    2779                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INT4SEL")
    2780                      .dwattr $C$DW$279, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
