TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:36:30 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DiffDrive.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

DiffDrive.asm                                                        PAGE  156

    6931 00000037 7602          IRET      ; [CPU_] 
    6932                      ; return occurs ; [] 
    6933                      .dwattr $C$DW$308, DW_AT_TI_end_file("../DiffDrive.c")
    6934                      .dwattr $C$DW$308, DW_AT_TI_end_line(0x5b3)
    6935                      .dwattr $C$DW$308, DW_AT_TI_end_column(0x01)
    6936                      .dwendentry
    6937                      .dwendtag $C$DW$308
    6938              
    6939              ;**************************************************************
    6940              ;* UNDEFINED EXTERNAL REFERENCES                              *
    6941              ;**************************************************************
    6942                      .global _set_steering_config_from_flash
    6943                      .global _servo_ramp
    6944                      .global _pwm_servo_init
    6945                      .global _hal_led_init
    6946                      .global _hal_button_init
    6947                      .global _init_wifly
    6948                      .global _send_measurement_command
    6949                      .global _fsm_main_set_state
    6950                      .global _fsm_main_run
    6951                      .global _init_steering_control
    6952                      .global _InitMotor2EQepGpio
    6953                      .global _InitMotor1SpiGpio
    6954                      .global _InitMotor2EPwmGpio
    6955                      .global _InitMotor1_DRV_Gpio
    6956                      .global _InitMotor2_DRV_Gpio
    6957                      .global _InitMotor1EQepGpio
    6958                      .global _InitMotor2SpiGpio
    6959                      .global _GPIO_SetupPinMux
    6960                      .global _GPIO_SetupPinOptions
    6961                      .global _InitPieCtrl
    6962                      .global _F28x_usDelay
    6963                      .global _InitMotor1EPwmGpio
    6964                      .global _InitPieVectTable
    6965                      .global _GPIO_WritePin
    6966                      .global _InitDRV8301
    6967                      .global _InitDRV8301Regs
    6968                      .global _DLOG_4CH_F_init
    6969                      .global _DRV8301_diagnostics
    6970                      .global _control_steering
    6971                      .global _PWM_1ch_UpDwnCnt_CNF_noDB
    6972                      .global _InitSpiRegs_DRV830x
    6973                      .global _InitSysCtrl1
    6974                      .global _ConfigureADC
    6975                      .global _fsm_main_get_state
    6976                      .global _DRV8301_SPI_Write
    6977                      .global _fsm_main_init
    6978                      .global _batterySupplyLow
    6979                      .global _modf
    6980                      .global _SysCtlLowSpeedClockGet
    6981                      .global _CpuTimer1Regs
    6982                      .global _CpuTimer2Regs
    6983                      .global _CpuTimer0Regs
    6984                      .global _SpiaRegs
    6985                      .global _AdcaResultRegs
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  157

    6986                      .global _AdcbResultRegs
    6987                      .global _PieCtrlRegs
    6988                      .global _InputXbarRegs
    6989                      .global _EQep1Regs
    6990                      .global _EQep3Regs
    6991                      .global _GpioDataRegs
    6992                      .global _EPwmXbarRegs
    6993                      .global _AdcbRegs
    6994                      .global _AdcaRegs
    6995                      .global _CpuSysRegs
    6996                      .global _EPwm2Regs
    6997                      .global _EPwm9Regs
    6998                      .global _EPwm7Regs
    6999                      .global _EPwm6Regs
    7000                      .global _EPwm10Regs
    7001                      .global _EPwm8Regs
    7002                      .global _EPwm1Regs
    7003                      .global _PieVectTable
    7004              
    7005              ;***************************************************************
    7006              ;* TYPE INFORMATION                                            *
    7007              ;***************************************************************
    7008              
    7009              $C$DW$T$636     .dwtag  DW_TAG_enumeration_type
    7010                      .dwattr $C$DW$T$636, DW_AT_byte_size(0x01)
    7011              $C$DW$316       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_STOP"), DW_AT_const_value(0x00)
    7012              $C$DW$317       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_CONFIG"), DW_AT_const_value(0x01)
    7013              $C$DW$318       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_RUN"), DW_AT_const_value(0x02)
    7014              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_ERROR"), DW_AT_const_value(0x03)
    7015                      .dwendtag $C$DW$T$636
    7016              
    7017              $C$DW$T$637     .dwtag  DW_TAG_typedef, DW_AT_name("fsm_main_state_t")
    7018                      .dwattr $C$DW$T$637, DW_AT_type(*$C$DW$T$636)
    7019                      .dwattr $C$DW$T$637, DW_AT_language(DW_LANG_C)
    7020              
    7021              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7022                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    7023              $C$DW$320       .dwtag  DW_TAG_member
    7024                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    7025                      .dwattr $C$DW$320, DW_AT_name("As")
    7026                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_As")
    7027                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7028                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    7029              $C$DW$321       .dwtag  DW_TAG_member
    7030                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    7031                      .dwattr $C$DW$321, DW_AT_name("Bs")
    7032                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_Bs")
    7033                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7034                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    7035              $C$DW$322       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    7037                      .dwattr $C$DW$322, DW_AT_name("Cs")
    7038                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_Cs")
    7039                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7040                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  158

    7041              $C$DW$323       .dwtag  DW_TAG_member
    7042                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    7043                      .dwattr $C$DW$323, DW_AT_name("Alpha")
    7044                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_Alpha")
    7045                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7046                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    7047              $C$DW$324       .dwtag  DW_TAG_member
    7048                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    7049                      .dwattr $C$DW$324, DW_AT_name("Beta")
    7050                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_Beta")
    7051                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7052                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    7053                      .dwendtag $C$DW$T$20
    7054              
    7055              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
    7056                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
    7057                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    7058              
    7059              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    7060                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
    7061              $C$DW$325       .dwtag  DW_TAG_member
    7062                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    7063                      .dwattr $C$DW$325, DW_AT_name("Alpha")
    7064                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_Alpha")
    7065                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7066                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    7067              $C$DW$326       .dwtag  DW_TAG_member
    7068                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    7069                      .dwattr $C$DW$326, DW_AT_name("Beta")
    7070                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_Beta")
    7071                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7072                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    7073              $C$DW$327       .dwtag  DW_TAG_member
    7074                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    7075                      .dwattr $C$DW$327, DW_AT_name("Angle")
    7076                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_Angle")
    7077                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7078                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    7079              $C$DW$328       .dwtag  DW_TAG_member
    7080                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    7081                      .dwattr $C$DW$328, DW_AT_name("Ds")
    7082                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_Ds")
    7083                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7084                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    7085              $C$DW$329       .dwtag  DW_TAG_member
    7086                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    7087                      .dwattr $C$DW$329, DW_AT_name("Qs")
    7088                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_Qs")
    7089                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7090                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    7091              $C$DW$330       .dwtag  DW_TAG_member
    7092                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    7093                      .dwattr $C$DW$330, DW_AT_name("Sine")
    7094                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_Sine")
    7095                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  159

    7096                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    7097              $C$DW$331       .dwtag  DW_TAG_member
    7098                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    7099                      .dwattr $C$DW$331, DW_AT_name("Cosine")
    7100                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_Cosine")
    7101                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7102                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    7103                      .dwendtag $C$DW$T$21
    7104              
    7105              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
    7106                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
    7107                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    7108              
    7109              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7110                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    7111              $C$DW$332       .dwtag  DW_TAG_member
    7112                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    7113                      .dwattr $C$DW$332, DW_AT_name("Alpha")
    7114                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_Alpha")
    7115                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7116                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    7117              $C$DW$333       .dwtag  DW_TAG_member
    7118                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    7119                      .dwattr $C$DW$333, DW_AT_name("Beta")
    7120                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_Beta")
    7121                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7122                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    7123              $C$DW$334       .dwtag  DW_TAG_member
    7124                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    7125                      .dwattr $C$DW$334, DW_AT_name("Angle")
    7126                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_Angle")
    7127                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7128                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    7129              $C$DW$335       .dwtag  DW_TAG_member
    7130                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    7131                      .dwattr $C$DW$335, DW_AT_name("Ds")
    7132                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_Ds")
    7133                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7134                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    7135              $C$DW$336       .dwtag  DW_TAG_member
    7136                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    7137                      .dwattr $C$DW$336, DW_AT_name("Qs")
    7138                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_Qs")
    7139                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7140                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    7141              $C$DW$337       .dwtag  DW_TAG_member
    7142                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    7143                      .dwattr $C$DW$337, DW_AT_name("Sine")
    7144                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_Sine")
    7145                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7146                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    7147              $C$DW$338       .dwtag  DW_TAG_member
    7148                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    7149                      .dwattr $C$DW$338, DW_AT_name("Cosine")
    7150                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_Cosine")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  160

    7151                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7152                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    7153                      .dwendtag $C$DW$T$22
    7154              
    7155              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
    7156                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    7157                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    7158              
    7159              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7160                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    7161              $C$DW$339       .dwtag  DW_TAG_member
    7162                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    7163                      .dwattr $C$DW$339, DW_AT_name("Ref")
    7164                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_Ref")
    7165                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7166                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7167              $C$DW$340       .dwtag  DW_TAG_member
    7168                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    7169                      .dwattr $C$DW$340, DW_AT_name("Fbk")
    7170                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_Fbk")
    7171                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7172                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7173              $C$DW$341       .dwtag  DW_TAG_member
    7174                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    7175                      .dwattr $C$DW$341, DW_AT_name("Out")
    7176                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_Out")
    7177                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7178                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7179              $C$DW$342       .dwtag  DW_TAG_member
    7180                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    7181                      .dwattr $C$DW$342, DW_AT_name("Kp")
    7182                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_Kp")
    7183                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7184                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7185              $C$DW$343       .dwtag  DW_TAG_member
    7186                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    7187                      .dwattr $C$DW$343, DW_AT_name("Ki")
    7188                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_Ki")
    7189                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7190                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7191              $C$DW$344       .dwtag  DW_TAG_member
    7192                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    7193                      .dwattr $C$DW$344, DW_AT_name("Umax")
    7194                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_Umax")
    7195                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7196                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    7197              $C$DW$345       .dwtag  DW_TAG_member
    7198                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    7199                      .dwattr $C$DW$345, DW_AT_name("Umin")
    7200                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_Umin")
    7201                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7202                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7203              $C$DW$346       .dwtag  DW_TAG_member
    7204                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    7205                      .dwattr $C$DW$346, DW_AT_name("up")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  161

    7206                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_up")
    7207                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7208                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7209              $C$DW$347       .dwtag  DW_TAG_member
    7210                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    7211                      .dwattr $C$DW$347, DW_AT_name("ui")
    7212                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_ui")
    7213                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7214                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7215              $C$DW$348       .dwtag  DW_TAG_member
    7216                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    7217                      .dwattr $C$DW$348, DW_AT_name("v1")
    7218                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_v1")
    7219                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7220                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7221              $C$DW$349       .dwtag  DW_TAG_member
    7222                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    7223                      .dwattr $C$DW$349, DW_AT_name("i1")
    7224                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_i1")
    7225                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7226                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7227              $C$DW$350       .dwtag  DW_TAG_member
    7228                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    7229                      .dwattr $C$DW$350, DW_AT_name("w1")
    7230                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_w1")
    7231                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7232                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7233                      .dwendtag $C$DW$T$23
    7234              
    7235              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    7236                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    7237                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    7238              
    7239              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7240                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    7241              $C$DW$351       .dwtag  DW_TAG_member
    7242                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    7243                      .dwattr $C$DW$351, DW_AT_name("Ref")
    7244                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_Ref")
    7245                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7246                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7247              $C$DW$352       .dwtag  DW_TAG_member
    7248                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    7249                      .dwattr $C$DW$352, DW_AT_name("Fbk")
    7250                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_Fbk")
    7251                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7252                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7253              $C$DW$353       .dwtag  DW_TAG_member
    7254                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    7255                      .dwattr $C$DW$353, DW_AT_name("Out")
    7256                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_Out")
    7257                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7258                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7259              $C$DW$354       .dwtag  DW_TAG_member
    7260                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  162

    7261                      .dwattr $C$DW$354, DW_AT_name("c1")
    7262                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_c1")
    7263                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7264                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7265              $C$DW$355       .dwtag  DW_TAG_member
    7266                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    7267                      .dwattr $C$DW$355, DW_AT_name("c2")
    7268                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_c2")
    7269                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7270                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7271                      .dwendtag $C$DW$T$24
    7272              
    7273              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
    7274                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    7275                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7276              
    7277              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7278                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    7279              $C$DW$356       .dwtag  DW_TAG_member
    7280                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    7281                      .dwattr $C$DW$356, DW_AT_name("Kr")
    7282                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_Kr")
    7283                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7284                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7285              $C$DW$357       .dwtag  DW_TAG_member
    7286                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    7287                      .dwattr $C$DW$357, DW_AT_name("Kp")
    7288                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Kp")
    7289                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7290                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7291              $C$DW$358       .dwtag  DW_TAG_member
    7292                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    7293                      .dwattr $C$DW$358, DW_AT_name("Ki")
    7294                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Ki")
    7295                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7296                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7297              $C$DW$359       .dwtag  DW_TAG_member
    7298                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    7299                      .dwattr $C$DW$359, DW_AT_name("Kd")
    7300                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Kd")
    7301                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7302                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7303              $C$DW$360       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    7305                      .dwattr $C$DW$360, DW_AT_name("Km")
    7306                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Km")
    7307                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7308                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7309              $C$DW$361       .dwtag  DW_TAG_member
    7310                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    7311                      .dwattr $C$DW$361, DW_AT_name("Umax")
    7312                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_Umax")
    7313                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7314                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7315              $C$DW$362       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  163

    7316                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    7317                      .dwattr $C$DW$362, DW_AT_name("Umin")
    7318                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Umin")
    7319                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7320                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7321                      .dwendtag $C$DW$T$25
    7322              
    7323              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
    7324                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    7325                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    7326              
    7327              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7328                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    7329              $C$DW$363       .dwtag  DW_TAG_member
    7330                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    7331                      .dwattr $C$DW$363, DW_AT_name("up")
    7332                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_up")
    7333                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7334                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7335              $C$DW$364       .dwtag  DW_TAG_member
    7336                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    7337                      .dwattr $C$DW$364, DW_AT_name("ui")
    7338                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_ui")
    7339                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7340                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7341              $C$DW$365       .dwtag  DW_TAG_member
    7342                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    7343                      .dwattr $C$DW$365, DW_AT_name("ud")
    7344                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_ud")
    7345                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7346                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7347              $C$DW$366       .dwtag  DW_TAG_member
    7348                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    7349                      .dwattr $C$DW$366, DW_AT_name("v1")
    7350                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_v1")
    7351                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7352                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7353              $C$DW$367       .dwtag  DW_TAG_member
    7354                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    7355                      .dwattr $C$DW$367, DW_AT_name("i1")
    7356                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_i1")
    7357                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7358                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7359              $C$DW$368       .dwtag  DW_TAG_member
    7360                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    7361                      .dwattr $C$DW$368, DW_AT_name("d1")
    7362                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_d1")
    7363                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7364                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7365              $C$DW$369       .dwtag  DW_TAG_member
    7366                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    7367                      .dwattr $C$DW$369, DW_AT_name("d2")
    7368                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_d2")
    7369                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7370                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  164

    7371              $C$DW$370       .dwtag  DW_TAG_member
    7372                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    7373                      .dwattr $C$DW$370, DW_AT_name("w1")
    7374                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_w1")
    7375                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7376                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7377                      .dwendtag $C$DW$T$26
    7378              
    7379              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
    7380                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    7381                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    7382              
    7383              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7384                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    7385              $C$DW$371       .dwtag  DW_TAG_member
    7386                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$27)
    7387                      .dwattr $C$DW$371, DW_AT_name("term")
    7388                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_term")
    7389                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7390                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7391              $C$DW$372       .dwtag  DW_TAG_member
    7392                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$28)
    7393                      .dwattr $C$DW$372, DW_AT_name("param")
    7394                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_param")
    7395                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7396                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7397              $C$DW$373       .dwtag  DW_TAG_member
    7398                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$29)
    7399                      .dwattr $C$DW$373, DW_AT_name("data")
    7400                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_data")
    7401                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7402                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7403                      .dwendtag $C$DW$T$30
    7404              
    7405              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
    7406                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    7407                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    7408              
    7409              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7410                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    7411              $C$DW$374       .dwtag  DW_TAG_member
    7412                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    7413                      .dwattr $C$DW$374, DW_AT_name("Ualpha")
    7414                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Ualpha")
    7415                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7416                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7417              $C$DW$375       .dwtag  DW_TAG_member
    7418                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    7419                      .dwattr $C$DW$375, DW_AT_name("Ubeta")
    7420                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Ubeta")
    7421                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7422                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7423              $C$DW$376       .dwtag  DW_TAG_member
    7424                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    7425                      .dwattr $C$DW$376, DW_AT_name("Ta")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  165

    7426                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Ta")
    7427                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7428                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7429              $C$DW$377       .dwtag  DW_TAG_member
    7430                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    7431                      .dwattr $C$DW$377, DW_AT_name("Tb")
    7432                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Tb")
    7433                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7434                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7435              $C$DW$378       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    7437                      .dwattr $C$DW$378, DW_AT_name("Tc")
    7438                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Tc")
    7439                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7440                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7441              $C$DW$379       .dwtag  DW_TAG_member
    7442                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    7443                      .dwattr $C$DW$379, DW_AT_name("tmp1")
    7444                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_tmp1")
    7445                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7446                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7447              $C$DW$380       .dwtag  DW_TAG_member
    7448                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    7449                      .dwattr $C$DW$380, DW_AT_name("tmp2")
    7450                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_tmp2")
    7451                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7452                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7453              $C$DW$381       .dwtag  DW_TAG_member
    7454                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    7455                      .dwattr $C$DW$381, DW_AT_name("tmp3")
    7456                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_tmp3")
    7457                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7458                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7459              $C$DW$382       .dwtag  DW_TAG_member
    7460                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$31)
    7461                      .dwattr $C$DW$382, DW_AT_name("VecSector")
    7462                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_VecSector")
    7463                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7464                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7465                      .dwendtag $C$DW$T$32
    7466              
    7467              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    7468                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    7469                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    7470              
    7471              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7472                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    7473              $C$DW$383       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    7475                      .dwattr $C$DW$383, DW_AT_name("TargetValue")
    7476                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_TargetValue")
    7477                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7478                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7479              $C$DW$384       .dwtag  DW_TAG_member
    7480                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  166

    7481                      .dwattr $C$DW$384, DW_AT_name("RampDelayMax")
    7482                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_RampDelayMax")
    7483                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7484                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7485              $C$DW$385       .dwtag  DW_TAG_member
    7486                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    7487                      .dwattr $C$DW$385, DW_AT_name("RampLowLimit")
    7488                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_RampLowLimit")
    7489                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7490                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7491              $C$DW$386       .dwtag  DW_TAG_member
    7492                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    7493                      .dwattr $C$DW$386, DW_AT_name("RampHighLimit")
    7494                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_RampHighLimit")
    7495                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7496                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7497              $C$DW$387       .dwtag  DW_TAG_member
    7498                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$33)
    7499                      .dwattr $C$DW$387, DW_AT_name("RampDelayCount")
    7500                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RampDelayCount")
    7501                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7502                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7503              $C$DW$388       .dwtag  DW_TAG_member
    7504                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    7505                      .dwattr $C$DW$388, DW_AT_name("SetpointValue")
    7506                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_SetpointValue")
    7507                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7508                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7509              $C$DW$389       .dwtag  DW_TAG_member
    7510                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$33)
    7511                      .dwattr $C$DW$389, DW_AT_name("EqualFlag")
    7512                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_EqualFlag")
    7513                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7514                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7515              $C$DW$390       .dwtag  DW_TAG_member
    7516                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    7517                      .dwattr $C$DW$390, DW_AT_name("Tmp")
    7518                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Tmp")
    7519                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7520                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7521                      .dwendtag $C$DW$T$34
    7522              
    7523              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    7524                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    7525                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    7526              
    7527              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7528                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    7529              $C$DW$391       .dwtag  DW_TAG_member
    7530                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    7531                      .dwattr $C$DW$391, DW_AT_name("Freq")
    7532                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_Freq")
    7533                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7534                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    7535              $C$DW$392       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  167

    7536                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    7537                      .dwattr $C$DW$392, DW_AT_name("StepAngleMax")
    7538                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_StepAngleMax")
    7539                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7540                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7541              $C$DW$393       .dwtag  DW_TAG_member
    7542                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    7543                      .dwattr $C$DW$393, DW_AT_name("Angle")
    7544                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Angle")
    7545                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7546                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    7547              $C$DW$394       .dwtag  DW_TAG_member
    7548                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    7549                      .dwattr $C$DW$394, DW_AT_name("Gain")
    7550                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Gain")
    7551                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7552                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    7553              $C$DW$395       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    7555                      .dwattr $C$DW$395, DW_AT_name("Out")
    7556                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_Out")
    7557                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7558                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    7559              $C$DW$396       .dwtag  DW_TAG_member
    7560                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    7561                      .dwattr $C$DW$396, DW_AT_name("Offset")
    7562                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Offset")
    7563                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7564                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    7565                      .dwendtag $C$DW$T$35
    7566              
    7567              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    7568                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    7569                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7570              
    7571              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7572                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    7573              $C$DW$397       .dwtag  DW_TAG_member
    7574                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    7575                      .dwattr $C$DW$397, DW_AT_name("DcBusVolt")
    7576                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_DcBusVolt")
    7577                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7578                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    7579              $C$DW$398       .dwtag  DW_TAG_member
    7580                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    7581                      .dwattr $C$DW$398, DW_AT_name("MfuncV1")
    7582                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_MfuncV1")
    7583                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7584                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    7585              $C$DW$399       .dwtag  DW_TAG_member
    7586                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    7587                      .dwattr $C$DW$399, DW_AT_name("MfuncV2")
    7588                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_MfuncV2")
    7589                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7590                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  168

    7591              $C$DW$400       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    7593                      .dwattr $C$DW$400, DW_AT_name("MfuncV3")
    7594                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_MfuncV3")
    7595                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7596                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    7597              $C$DW$401       .dwtag  DW_TAG_member
    7598                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$31)
    7599                      .dwattr $C$DW$401, DW_AT_name("OutOfPhase")
    7600                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_OutOfPhase")
    7601                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7602                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    7603              $C$DW$402       .dwtag  DW_TAG_member
    7604                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    7605                      .dwattr $C$DW$402, DW_AT_name("VphaseA")
    7606                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_VphaseA")
    7607                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7608                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    7609              $C$DW$403       .dwtag  DW_TAG_member
    7610                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    7611                      .dwattr $C$DW$403, DW_AT_name("VphaseB")
    7612                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_VphaseB")
    7613                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7614                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    7615              $C$DW$404       .dwtag  DW_TAG_member
    7616                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    7617                      .dwattr $C$DW$404, DW_AT_name("VphaseC")
    7618                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_VphaseC")
    7619                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7620                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    7621              $C$DW$405       .dwtag  DW_TAG_member
    7622                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    7623                      .dwattr $C$DW$405, DW_AT_name("Valpha")
    7624                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Valpha")
    7625                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7626                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    7627              $C$DW$406       .dwtag  DW_TAG_member
    7628                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    7629                      .dwattr $C$DW$406, DW_AT_name("Vbeta")
    7630                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Vbeta")
    7631                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7632                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    7633              $C$DW$407       .dwtag  DW_TAG_member
    7634                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    7635                      .dwattr $C$DW$407, DW_AT_name("temp")
    7636                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_temp")
    7637                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7638                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    7639                      .dwendtag $C$DW$T$36
    7640              
    7641              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    7642                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    7643                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7644              
    7645              $C$DW$T$39      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  169

    7646                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    7647              $C$DW$408       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    7649                      .dwattr $C$DW$408, DW_AT_name("ElecTheta")
    7650                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ElecTheta")
    7651                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7652                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7653              $C$DW$409       .dwtag  DW_TAG_member
    7654                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$33)
    7655                      .dwattr $C$DW$409, DW_AT_name("DirectionQep")
    7656                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_DirectionQep")
    7657                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7658                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7659              $C$DW$410       .dwtag  DW_TAG_member
    7660                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    7661                      .dwattr $C$DW$410, DW_AT_name("OldElecTheta")
    7662                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_OldElecTheta")
    7663                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7664                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7665              $C$DW$411       .dwtag  DW_TAG_member
    7666                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    7667                      .dwattr $C$DW$411, DW_AT_name("Speed")
    7668                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_Speed")
    7669                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7670                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7671              $C$DW$412       .dwtag  DW_TAG_member
    7672                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$33)
    7673                      .dwattr $C$DW$412, DW_AT_name("BaseRpm")
    7674                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_BaseRpm")
    7675                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7676                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7677              $C$DW$413       .dwtag  DW_TAG_member
    7678                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$37)
    7679                      .dwattr $C$DW$413, DW_AT_name("K1")
    7680                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_K1")
    7681                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7682                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7683              $C$DW$414       .dwtag  DW_TAG_member
    7684                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    7685                      .dwattr $C$DW$414, DW_AT_name("K2")
    7686                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_K2")
    7687                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7688                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7689              $C$DW$415       .dwtag  DW_TAG_member
    7690                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    7691                      .dwattr $C$DW$415, DW_AT_name("K3")
    7692                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_K3")
    7693                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7694                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7695              $C$DW$416       .dwtag  DW_TAG_member
    7696                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$38)
    7697                      .dwattr $C$DW$416, DW_AT_name("SpeedRpm")
    7698                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_SpeedRpm")
    7699                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7700                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  170

    7701              $C$DW$417       .dwtag  DW_TAG_member
    7702                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
    7703                      .dwattr $C$DW$417, DW_AT_name("Tmp")
    7704                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Tmp")
    7705                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7706                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7707                      .dwendtag $C$DW$T$39
    7708              
    7709              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    7710                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    7711                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    7712              
    7713              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7714                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    7715              $C$DW$418       .dwtag  DW_TAG_member
    7716                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$40)
    7717                      .dwattr $C$DW$418, DW_AT_name("ElecTheta")
    7718                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_ElecTheta")
    7719                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7720                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7721              $C$DW$419       .dwtag  DW_TAG_member
    7722                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$40)
    7723                      .dwattr $C$DW$419, DW_AT_name("MechTheta")
    7724                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_MechTheta")
    7725                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7726                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7727              $C$DW$420       .dwtag  DW_TAG_member
    7728                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$31)
    7729                      .dwattr $C$DW$420, DW_AT_name("DirectionQep")
    7730                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_DirectionQep")
    7731                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7732                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7733              $C$DW$421       .dwtag  DW_TAG_member
    7734                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$31)
    7735                      .dwattr $C$DW$421, DW_AT_name("QepPeriod")
    7736                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_QepPeriod")
    7737                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7738                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7739              $C$DW$422       .dwtag  DW_TAG_member
    7740                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$33)
    7741                      .dwattr $C$DW$422, DW_AT_name("QepCountIndex")
    7742                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_QepCountIndex")
    7743                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7744                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7745              $C$DW$423       .dwtag  DW_TAG_member
    7746                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$38)
    7747                      .dwattr $C$DW$423, DW_AT_name("RawTheta")
    7748                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_RawTheta")
    7749                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7750                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    7751              $C$DW$424       .dwtag  DW_TAG_member
    7752                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$40)
    7753                      .dwattr $C$DW$424, DW_AT_name("MechScaler")
    7754                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_MechScaler")
    7755                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  171

    7756                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    7757              $C$DW$425       .dwtag  DW_TAG_member
    7758                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$31)
    7759                      .dwattr $C$DW$425, DW_AT_name("LineEncoder")
    7760                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_LineEncoder")
    7761                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7762                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    7763              $C$DW$426       .dwtag  DW_TAG_member
    7764                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$31)
    7765                      .dwattr $C$DW$426, DW_AT_name("PolePairs")
    7766                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_PolePairs")
    7767                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7768                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    7769              $C$DW$427       .dwtag  DW_TAG_member
    7770                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$38)
    7771                      .dwattr $C$DW$427, DW_AT_name("CalibratedAngle")
    7772                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_CalibratedAngle")
    7773                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7774                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    7775              $C$DW$428       .dwtag  DW_TAG_member
    7776                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$31)
    7777                      .dwattr $C$DW$428, DW_AT_name("IndexSyncFlag")
    7778                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_IndexSyncFlag")
    7779                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7780                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    7781                      .dwendtag $C$DW$T$41
    7782              
    7783              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    7784                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    7785                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    7786              
    7787              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7788                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    7789              $C$DW$429       .dwtag  DW_TAG_member
    7790                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$42)
    7791                      .dwattr $C$DW$429, DW_AT_name("stat_reg1")
    7792                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_stat_reg1")
    7793                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7794                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    7795              $C$DW$430       .dwtag  DW_TAG_member
    7796                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$43)
    7797                      .dwattr $C$DW$430, DW_AT_name("stat_reg2")
    7798                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_stat_reg2")
    7799                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7800                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    7801              $C$DW$431       .dwtag  DW_TAG_member
    7802                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$44)
    7803                      .dwattr $C$DW$431, DW_AT_name("cntrl_reg1")
    7804                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_cntrl_reg1")
    7805                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7806                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    7807              $C$DW$432       .dwtag  DW_TAG_member
    7808                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$45)
    7809                      .dwattr $C$DW$432, DW_AT_name("cntrl_reg2")
    7810                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_cntrl_reg2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  172

    7811                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7812                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7813              $C$DW$433       .dwtag  DW_TAG_member
    7814                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$31)
    7815                      .dwattr $C$DW$433, DW_AT_name("readCntrl1")
    7816                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_readCntrl1")
    7817                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7818                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7819              $C$DW$434       .dwtag  DW_TAG_member
    7820                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$31)
    7821                      .dwattr $C$DW$434, DW_AT_name("readCntrl2")
    7822                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_readCntrl2")
    7823                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7824                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    7825              $C$DW$435       .dwtag  DW_TAG_member
    7826                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$31)
    7827                      .dwattr $C$DW$435, DW_AT_name("DRV_fault")
    7828                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_DRV_fault")
    7829                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7830                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    7831                      .dwendtag $C$DW$T$46
    7832              
    7833              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    7834                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    7835                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    7836              
    7837              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    7838                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    7839              $C$DW$436       .dwtag  DW_TAG_member
    7840                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$31)
    7841                      .dwattr $C$DW$436, DW_AT_name("Rsvd0")
    7842                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_Rsvd0")
    7843                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7844                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    7845              $C$DW$437       .dwtag  DW_TAG_member
    7846                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$47)
    7847                      .dwattr $C$DW$437, DW_AT_name("status1_wwd")
    7848                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_status1_wwd")
    7849                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7850                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    7851              $C$DW$438       .dwtag  DW_TAG_member
    7852                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$48)
    7853                      .dwattr $C$DW$438, DW_AT_name("status2_ov_vds")
    7854                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_status2_ov_vds")
    7855                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7856                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    7857              $C$DW$439       .dwtag  DW_TAG_member
    7858                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$49)
    7859                      .dwattr $C$DW$439, DW_AT_name("status3_IC")
    7860                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_status3_IC")
    7861                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7862                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    7863              $C$DW$440       .dwtag  DW_TAG_member
    7864                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$50)
    7865                      .dwattr $C$DW$440, DW_AT_name("status4_gd_Vgs")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  173

    7866                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    7867                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7868                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    7869              $C$DW$441       .dwtag  DW_TAG_member
    7870                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$51)
    7871                      .dwattr $C$DW$441, DW_AT_name("cntrl5_hs_gd")
    7872                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    7873                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7874                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    7875              $C$DW$442       .dwtag  DW_TAG_member
    7876                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$52)
    7877                      .dwattr $C$DW$442, DW_AT_name("cntrl6_ls_gd")
    7878                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    7879                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7880                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    7881              $C$DW$443       .dwtag  DW_TAG_member
    7882                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$53)
    7883                      .dwattr $C$DW$443, DW_AT_name("cntrl7_gd")
    7884                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_cntrl7_gd")
    7885                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7886                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    7887              $C$DW$444       .dwtag  DW_TAG_member
    7888                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$31)
    7889                      .dwattr $C$DW$444, DW_AT_name("Rsvd8")
    7890                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_Rsvd8")
    7891                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7892                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    7893              $C$DW$445       .dwtag  DW_TAG_member
    7894                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$54)
    7895                      .dwattr $C$DW$445, DW_AT_name("cntrl9_IC_ops")
    7896                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    7897                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7898                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    7899              $C$DW$446       .dwtag  DW_TAG_member
    7900                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$55)
    7901                      .dwattr $C$DW$446, DW_AT_name("cntrlA_shunt_amp")
    7902                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    7903                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7904                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    7905              $C$DW$447       .dwtag  DW_TAG_member
    7906                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$56)
    7907                      .dwattr $C$DW$447, DW_AT_name("cntrlB_Vreg")
    7908                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    7909                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7910                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    7911              $C$DW$448       .dwtag  DW_TAG_member
    7912                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$57)
    7913                      .dwattr $C$DW$448, DW_AT_name("cntrlC_Vds_SNS")
    7914                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    7915                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7916                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    7917              $C$DW$449       .dwtag  DW_TAG_member
    7918                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
    7919                      .dwattr $C$DW$449, DW_AT_name("readCntrl5")
    7920                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_readCntrl5")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  174

    7921                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7922                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    7923              $C$DW$450       .dwtag  DW_TAG_member
    7924                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$31)
    7925                      .dwattr $C$DW$450, DW_AT_name("readCntrl6")
    7926                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_readCntrl6")
    7927                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7928                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    7929              $C$DW$451       .dwtag  DW_TAG_member
    7930                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$31)
    7931                      .dwattr $C$DW$451, DW_AT_name("readCntrl7")
    7932                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_readCntrl7")
    7933                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7934                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7935              $C$DW$452       .dwtag  DW_TAG_member
    7936                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$31)
    7937                      .dwattr $C$DW$452, DW_AT_name("readCntrl9")
    7938                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_readCntrl9")
    7939                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7940                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7941              $C$DW$453       .dwtag  DW_TAG_member
    7942                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$31)
    7943                      .dwattr $C$DW$453, DW_AT_name("readCntrlA")
    7944                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_readCntrlA")
    7945                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7946                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7947              $C$DW$454       .dwtag  DW_TAG_member
    7948                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$31)
    7949                      .dwattr $C$DW$454, DW_AT_name("readCntrlB")
    7950                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_readCntrlB")
    7951                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7952                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7953              $C$DW$455       .dwtag  DW_TAG_member
    7954                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$31)
    7955                      .dwattr $C$DW$455, DW_AT_name("readCntrlC")
    7956                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_readCntrlC")
    7957                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7958                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7959              $C$DW$456       .dwtag  DW_TAG_member
    7960                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$31)
    7961                      .dwattr $C$DW$456, DW_AT_name("DRV_fault")
    7962                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_DRV_fault")
    7963                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7964                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7965                      .dwendtag $C$DW$T$58
    7966              
    7967              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    7968                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    7969                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    7970              
    7971              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7972                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
    7973              $C$DW$457       .dwtag  DW_TAG_member
    7974                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$60)
    7975                      .dwattr $C$DW$457, DW_AT_name("PwmARegs")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  175

    7976                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_PwmARegs")
    7977                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7978                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7979              $C$DW$458       .dwtag  DW_TAG_member
    7980                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$60)
    7981                      .dwattr $C$DW$458, DW_AT_name("PwmBRegs")
    7982                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_PwmBRegs")
    7983                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7984                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    7985              $C$DW$459       .dwtag  DW_TAG_member
    7986                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$60)
    7987                      .dwattr $C$DW$459, DW_AT_name("PwmCRegs")
    7988                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_PwmCRegs")
    7989                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7990                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7991              $C$DW$460       .dwtag  DW_TAG_member
    7992                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$62)
    7993                      .dwattr $C$DW$460, DW_AT_name("QepRegs")
    7994                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_QepRegs")
    7995                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7996                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7997              $C$DW$461       .dwtag  DW_TAG_member
    7998                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$64)
    7999                      .dwattr $C$DW$461, DW_AT_name("SpiRegs")
    8000                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_SpiRegs")
    8001                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8002                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8003              $C$DW$462       .dwtag  DW_TAG_member
    8004                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$31)
    8005                      .dwattr $C$DW$462, DW_AT_name("drvScsPin")
    8006                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_drvScsPin")
    8007                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8008                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8009              $C$DW$463       .dwtag  DW_TAG_member
    8010                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    8011                      .dwattr $C$DW$463, DW_AT_name("offset_shntA")
    8012                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_offset_shntA")
    8013                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8014                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8015              $C$DW$464       .dwtag  DW_TAG_member
    8016                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
    8017                      .dwattr $C$DW$464, DW_AT_name("offset_shntB")
    8018                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_offset_shntB")
    8019                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8020                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8021              $C$DW$465       .dwtag  DW_TAG_member
    8022                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$19)
    8023                      .dwattr $C$DW$465, DW_AT_name("offset_shntC")
    8024                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_offset_shntC")
    8025                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8026                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8027              $C$DW$466       .dwtag  DW_TAG_member
    8028                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
    8029                      .dwattr $C$DW$466, DW_AT_name("VdTesting")
    8030                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_VdTesting")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  176

    8031                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8032                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8033              $C$DW$467       .dwtag  DW_TAG_member
    8034                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
    8035                      .dwattr $C$DW$467, DW_AT_name("VqTesting")
    8036                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_VqTesting")
    8037                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8038                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8039              $C$DW$468       .dwtag  DW_TAG_member
    8040                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
    8041                      .dwattr $C$DW$468, DW_AT_name("IdRef")
    8042                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_IdRef")
    8043                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    8044                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8045              $C$DW$469       .dwtag  DW_TAG_member
    8046                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    8047                      .dwattr $C$DW$469, DW_AT_name("IqRef")
    8048                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_IqRef")
    8049                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8050                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8051              $C$DW$470       .dwtag  DW_TAG_member
    8052                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    8053                      .dwattr $C$DW$470, DW_AT_name("SpeedRef")
    8054                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_SpeedRef")
    8055                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    8056                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8057              $C$DW$471       .dwtag  DW_TAG_member
    8058                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    8059                      .dwattr $C$DW$471, DW_AT_name("ElecTheta")
    8060                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_ElecTheta")
    8061                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8062                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8063              $C$DW$472       .dwtag  DW_TAG_member
    8064                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    8065                      .dwattr $C$DW$472, DW_AT_name("MechTheta")
    8066                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_MechTheta")
    8067                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    8068                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8069              $C$DW$473       .dwtag  DW_TAG_member
    8070                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$40)
    8071                      .dwattr $C$DW$473, DW_AT_name("currentAs")
    8072                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_currentAs")
    8073                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8074                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8075              $C$DW$474       .dwtag  DW_TAG_member
    8076                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$40)
    8077                      .dwattr $C$DW$474, DW_AT_name("currentBs")
    8078                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_currentBs")
    8079                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    8080                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8081              $C$DW$475       .dwtag  DW_TAG_member
    8082                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$40)
    8083                      .dwattr $C$DW$475, DW_AT_name("currentCs")
    8084                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_currentCs")
    8085                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  177

    8086                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8087              $C$DW$476       .dwtag  DW_TAG_member
    8088                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$38)
    8089                      .dwattr $C$DW$476, DW_AT_name("alignCntr")
    8090                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_alignCntr")
    8091                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    8092                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8093              $C$DW$477       .dwtag  DW_TAG_member
    8094                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$38)
    8095                      .dwattr $C$DW$477, DW_AT_name("alignCnt")
    8096                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_alignCnt")
    8097                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8098                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8099              $C$DW$478       .dwtag  DW_TAG_member
    8100                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$31)
    8101                      .dwattr $C$DW$478, DW_AT_name("lsw")
    8102                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_lsw")
    8103                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    8104                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8105              $C$DW$479       .dwtag  DW_TAG_member
    8106                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$31)
    8107                      .dwattr $C$DW$479, DW_AT_name("TripFlagDMC")
    8108                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_TripFlagDMC")
    8109                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    8110                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8111              $C$DW$480       .dwtag  DW_TAG_member
    8112                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$31)
    8113                      .dwattr $C$DW$480, DW_AT_name("clearTripFlagDMC")
    8114                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    8115                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8116                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8117              $C$DW$481       .dwtag  DW_TAG_member
    8118                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$31)
    8119                      .dwattr $C$DW$481, DW_AT_name("RunMotor")
    8120                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_RunMotor")
    8121                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    8122                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8123              $C$DW$482       .dwtag  DW_TAG_member
    8124                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$31)
    8125                      .dwattr $C$DW$482, DW_AT_name("SpeedLoopPrescaler")
    8126                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
    8127                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    8128                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8129              $C$DW$483       .dwtag  DW_TAG_member
    8130                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$31)
    8131                      .dwattr $C$DW$483, DW_AT_name("SpeedLoopCount")
    8132                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_SpeedLoopCount")
    8133                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    8134                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8135              $C$DW$484       .dwtag  DW_TAG_member
    8136                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$31)
    8137                      .dwattr $C$DW$484, DW_AT_name("PosSenseReverse")
    8138                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_PosSenseReverse")
    8139                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8140                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:36 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  178

    8141              $C$DW$485       .dwtag  DW_TAG_member
    8142                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$31)
    8143                      .dwattr $C$DW$485, DW_AT_name("newCmdDRV")
    8144                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_newCmdDRV")
    8145                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    8146                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8147              $C$DW$486       .dwtag  DW_TAG_member
    8148                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$40)
    8149                      .dwattr $C$DW$486, DW_AT_name("T")
    8150                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_T")
    8151                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8152                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8153              $C$DW$487       .dwtag  DW_TAG_member
    8154                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$65)
    8155                      .dwattr $C$DW$487, DW_AT_name("clarke")
    8156                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_clarke")
    8157                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8158                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8159              $C$DW$488       .dwtag  DW_TAG_member
    8160                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$66)
    8161                      .dwattr $C$DW$488, DW_AT_name("park")
    8162                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_park")
    8163                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    8164                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8165              $C$DW$489       .dwtag  DW_TAG_member
    8166                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$67)
    8167                      .dwattr $C$DW$489, DW_AT_name("ipark")
    8168                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_ipark")
    8169                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8170                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8171              $C$DW$490       .dwtag  DW_TAG_member
    8172                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$68)
    8173                      .dwattr $C$DW$490, DW_AT_name("pi_pos")
    8174                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_pi_pos")
    8175                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8176                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8177              $C$DW$491       .dwtag  DW_TAG_member
    8178                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$69)
    8179                      .dwattr $C$DW$491, DW_AT_name("pid_spd")
    8180                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_pid_spd")
