TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:25:32 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DiffDrive.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    6792                      .dwattr $C$DW$311, DW_AT_TI_end_line(0x5a9)
    6793                      .dwattr $C$DW$311, DW_AT_TI_end_column(0x01)
    6794                      .dwendentry
    6795                      .dwendtag $C$DW$311
    6796              
    6797              ;**************************************************************
    6798              ;* UNDEFINED EXTERNAL REFERENCES                              *
    6799              ;**************************************************************
    6800                      .global _send_measurement_command
    6801                      .global _set_steering_config_from_flash
    6802                      .global _hal_button_init
    6803                      .global _servo_ramp
    6804                      .global _init_steering_control
    6805                      .global _hal_led_init
    6806                      .global _fsm_main_run
    6807                      .global _init_wifly
    6808                      .global _pwm_servo_init
    6809                      .global _fsm_main_set_state
    6810                      .global _InitMotor1EQepGpio
    6811                      .global _InitMotor2EQepGpio
    6812                      .global _InitMotor1EPwmGpio
    6813                      .global _InitMotor2EPwmGpio
    6814                      .global _InitMotor1_DRV_Gpio
    6815                      .global _InitMotor2_DRV_Gpio
    6816                      .global _InitMotor1SpiGpio
    6817                      .global _GPIO_SetupPinMux
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  153

    6818                      .global _GPIO_SetupPinOptions
    6819                      .global _InitPieCtrl
    6820                      .global _InitPieVectTable
    6821                      .global _piController
    6822                      .global _InitMotor2SpiGpio
    6823                      .global _GPIO_WritePin
    6824                      .global _InitDRV8301
    6825                      .global _InitDRV8301Regs
    6826                      .global _DLOG_4CH_F_init
    6827                      .global _DRV8301_diagnostics
    6828                      .global _control_steering
    6829                      .global _InitSpiRegs_DRV830x
    6830                      .global _ConfigureADC
    6831                      .global _PWM_1ch_UpDwnCnt_CNF_noDB
    6832                      .global _F28x_usDelay
    6833                      .global _InitSysCtrl1
    6834                      .global _fsm_main_get_state
    6835                      .global _fsm_main_init
    6836                      .global _batterySupplyLow
    6837                      .global _DRV8301_SPI_Write
    6838                      .global _modf
    6839                      .global _SysCtlLowSpeedClockGet
    6840                      .global _CpuTimer1Regs
    6841                      .global _CpuTimer2Regs
    6842                      .global _CpuTimer0Regs
    6843                      .global _SpiaRegs
    6844                      .global _AdcaResultRegs
    6845                      .global _AdcbResultRegs
    6846                      .global _PieCtrlRegs
    6847                      .global _InputXbarRegs
    6848                      .global _EQep1Regs
    6849                      .global _EQep3Regs
    6850                      .global _GpioDataRegs
    6851                      .global _EPwmXbarRegs
    6852                      .global _AdcbRegs
    6853                      .global _AdcaRegs
    6854                      .global _CpuSysRegs
    6855                      .global _EPwm2Regs
    6856                      .global _EPwm9Regs
    6857                      .global _EPwm7Regs
    6858                      .global _EPwm6Regs
    6859                      .global _EPwm10Regs
    6860                      .global _EPwm8Regs
    6861                      .global _EPwm1Regs
    6862                      .global _PieVectTable
    6863              
    6864              ;***************************************************************
    6865              ;* TYPE INFORMATION                                            *
    6866              ;***************************************************************
    6867              
    6868              $C$DW$T$637     .dwtag  DW_TAG_enumeration_type
    6869                      .dwattr $C$DW$T$637, DW_AT_byte_size(0x01)
    6870              $C$DW$319       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_STOP"), DW_AT_const_value(0x00)
    6871              $C$DW$320       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_CONFIG"), DW_AT_const_value(0x01)
    6872              $C$DW$321       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_RUN"), DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  154

    6873              $C$DW$322       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_ERROR"), DW_AT_const_value(0x03)
    6874                      .dwendtag $C$DW$T$637
    6875              
    6876              $C$DW$T$638     .dwtag  DW_TAG_typedef, DW_AT_name("fsm_main_state_t")
    6877                      .dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$637)
    6878                      .dwattr $C$DW$T$638, DW_AT_language(DW_LANG_C)
    6879              
    6880              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6881                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    6882              $C$DW$323       .dwtag  DW_TAG_member
    6883                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    6884                      .dwattr $C$DW$323, DW_AT_name("As")
    6885                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_As")
    6886                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6887                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    6888              $C$DW$324       .dwtag  DW_TAG_member
    6889                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    6890                      .dwattr $C$DW$324, DW_AT_name("Bs")
    6891                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_Bs")
    6892                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6893                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    6894              $C$DW$325       .dwtag  DW_TAG_member
    6895                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    6896                      .dwattr $C$DW$325, DW_AT_name("Cs")
    6897                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_Cs")
    6898                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6899                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    6900              $C$DW$326       .dwtag  DW_TAG_member
    6901                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    6902                      .dwattr $C$DW$326, DW_AT_name("Alpha")
    6903                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_Alpha")
    6904                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6905                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    6906              $C$DW$327       .dwtag  DW_TAG_member
    6907                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    6908                      .dwattr $C$DW$327, DW_AT_name("Beta")
    6909                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_Beta")
    6910                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6911                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    6912                      .dwendtag $C$DW$T$20
    6913              
    6914              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
    6915                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
    6916                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    6917              
    6918              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    6919                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
    6920              $C$DW$328       .dwtag  DW_TAG_member
    6921                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    6922                      .dwattr $C$DW$328, DW_AT_name("Alpha")
    6923                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_Alpha")
    6924                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6925                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    6926              $C$DW$329       .dwtag  DW_TAG_member
    6927                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  155

    6928                      .dwattr $C$DW$329, DW_AT_name("Beta")
    6929                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_Beta")
    6930                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6931                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    6932              $C$DW$330       .dwtag  DW_TAG_member
    6933                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    6934                      .dwattr $C$DW$330, DW_AT_name("Angle")
    6935                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_Angle")
    6936                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6937                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    6938              $C$DW$331       .dwtag  DW_TAG_member
    6939                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    6940                      .dwattr $C$DW$331, DW_AT_name("Ds")
    6941                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_Ds")
    6942                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6943                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    6944              $C$DW$332       .dwtag  DW_TAG_member
    6945                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    6946                      .dwattr $C$DW$332, DW_AT_name("Qs")
    6947                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_Qs")
    6948                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6949                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    6950              $C$DW$333       .dwtag  DW_TAG_member
    6951                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    6952                      .dwattr $C$DW$333, DW_AT_name("Sine")
    6953                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_Sine")
    6954                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6955                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    6956              $C$DW$334       .dwtag  DW_TAG_member
    6957                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    6958                      .dwattr $C$DW$334, DW_AT_name("Cosine")
    6959                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_Cosine")
    6960                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6961                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    6962                      .dwendtag $C$DW$T$21
    6963              
    6964              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
    6965                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
    6966                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    6967              
    6968              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    6969                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    6970              $C$DW$335       .dwtag  DW_TAG_member
    6971                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    6972                      .dwattr $C$DW$335, DW_AT_name("Alpha")
    6973                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_Alpha")
    6974                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6975                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    6976              $C$DW$336       .dwtag  DW_TAG_member
    6977                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    6978                      .dwattr $C$DW$336, DW_AT_name("Beta")
    6979                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_Beta")
    6980                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6981                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    6982              $C$DW$337       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  156

    6983                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    6984                      .dwattr $C$DW$337, DW_AT_name("Angle")
    6985                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_Angle")
    6986                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6987                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    6988              $C$DW$338       .dwtag  DW_TAG_member
    6989                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    6990                      .dwattr $C$DW$338, DW_AT_name("Ds")
    6991                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_Ds")
    6992                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6993                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    6994              $C$DW$339       .dwtag  DW_TAG_member
    6995                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    6996                      .dwattr $C$DW$339, DW_AT_name("Qs")
    6997                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_Qs")
    6998                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6999                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    7000              $C$DW$340       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    7002                      .dwattr $C$DW$340, DW_AT_name("Sine")
    7003                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_Sine")
    7004                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7005                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    7006              $C$DW$341       .dwtag  DW_TAG_member
    7007                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    7008                      .dwattr $C$DW$341, DW_AT_name("Cosine")
    7009                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_Cosine")
    7010                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7011                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    7012                      .dwendtag $C$DW$T$22
    7013              
    7014              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
    7015                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    7016                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    7017              
    7018              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7019                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    7020              $C$DW$342       .dwtag  DW_TAG_member
    7021                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    7022                      .dwattr $C$DW$342, DW_AT_name("Ref")
    7023                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_Ref")
    7024                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7025                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    7026              $C$DW$343       .dwtag  DW_TAG_member
    7027                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    7028                      .dwattr $C$DW$343, DW_AT_name("Fbk")
    7029                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_Fbk")
    7030                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7031                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    7032              $C$DW$344       .dwtag  DW_TAG_member
    7033                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    7034                      .dwattr $C$DW$344, DW_AT_name("Out")
    7035                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_Out")
    7036                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7037                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  157

    7038              $C$DW$345       .dwtag  DW_TAG_member
    7039                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    7040                      .dwattr $C$DW$345, DW_AT_name("Kp")
    7041                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_Kp")
    7042                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7043                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    7044              $C$DW$346       .dwtag  DW_TAG_member
    7045                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    7046                      .dwattr $C$DW$346, DW_AT_name("Ki")
    7047                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_Ki")
    7048                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7049                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7050              $C$DW$347       .dwtag  DW_TAG_member
    7051                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    7052                      .dwattr $C$DW$347, DW_AT_name("Umax")
    7053                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_Umax")
    7054                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7055                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7056              $C$DW$348       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    7058                      .dwattr $C$DW$348, DW_AT_name("Umin")
    7059                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_Umin")
    7060                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7061                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7062              $C$DW$349       .dwtag  DW_TAG_member
    7063                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    7064                      .dwattr $C$DW$349, DW_AT_name("up")
    7065                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_up")
    7066                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7067                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7068              $C$DW$350       .dwtag  DW_TAG_member
    7069                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    7070                      .dwattr $C$DW$350, DW_AT_name("ui")
    7071                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_ui")
    7072                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7073                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7074              $C$DW$351       .dwtag  DW_TAG_member
    7075                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    7076                      .dwattr $C$DW$351, DW_AT_name("v1")
    7077                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_v1")
    7078                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7079                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7080              $C$DW$352       .dwtag  DW_TAG_member
    7081                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    7082                      .dwattr $C$DW$352, DW_AT_name("i1")
    7083                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_i1")
    7084                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7085                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7086              $C$DW$353       .dwtag  DW_TAG_member
    7087                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    7088                      .dwattr $C$DW$353, DW_AT_name("w1")
    7089                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_w1")
    7090                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7091                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7092                      .dwendtag $C$DW$T$23
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  158

    7093              
    7094              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    7095                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    7096                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    7097              
    7098              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    7099                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    7100              $C$DW$354       .dwtag  DW_TAG_member
    7101                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    7102                      .dwattr $C$DW$354, DW_AT_name("Ref")
    7103                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_Ref")
    7104                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7105                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7106              $C$DW$355       .dwtag  DW_TAG_member
    7107                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    7108                      .dwattr $C$DW$355, DW_AT_name("Fbk")
    7109                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_Fbk")
    7110                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7111                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7112              $C$DW$356       .dwtag  DW_TAG_member
    7113                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    7114                      .dwattr $C$DW$356, DW_AT_name("Out")
    7115                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_Out")
    7116                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7117                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7118              $C$DW$357       .dwtag  DW_TAG_member
    7119                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    7120                      .dwattr $C$DW$357, DW_AT_name("c1")
    7121                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_c1")
    7122                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7123                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    7124              $C$DW$358       .dwtag  DW_TAG_member
    7125                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    7126                      .dwattr $C$DW$358, DW_AT_name("c2")
    7127                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_c2")
    7128                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7129                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7130                      .dwendtag $C$DW$T$24
    7131              
    7132              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
    7133                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    7134                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    7135              
    7136              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7137                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    7138              $C$DW$359       .dwtag  DW_TAG_member
    7139                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    7140                      .dwattr $C$DW$359, DW_AT_name("Kr")
    7141                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Kr")
    7142                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7143                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7144              $C$DW$360       .dwtag  DW_TAG_member
    7145                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    7146                      .dwattr $C$DW$360, DW_AT_name("Kp")
    7147                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Kp")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  159

    7148                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7149                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7150              $C$DW$361       .dwtag  DW_TAG_member
    7151                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    7152                      .dwattr $C$DW$361, DW_AT_name("Ki")
    7153                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_Ki")
    7154                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7155                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7156              $C$DW$362       .dwtag  DW_TAG_member
    7157                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    7158                      .dwattr $C$DW$362, DW_AT_name("Kd")
    7159                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Kd")
    7160                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7161                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7162              $C$DW$363       .dwtag  DW_TAG_member
    7163                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    7164                      .dwattr $C$DW$363, DW_AT_name("Km")
    7165                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Km")
    7166                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7167                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7168              $C$DW$364       .dwtag  DW_TAG_member
    7169                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    7170                      .dwattr $C$DW$364, DW_AT_name("Umax")
    7171                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_Umax")
    7172                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7173                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    7174              $C$DW$365       .dwtag  DW_TAG_member
    7175                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    7176                      .dwattr $C$DW$365, DW_AT_name("Umin")
    7177                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_Umin")
    7178                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7179                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7180                      .dwendtag $C$DW$T$25
    7181              
    7182              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
    7183                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    7184                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    7185              
    7186              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7187                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    7188              $C$DW$366       .dwtag  DW_TAG_member
    7189                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    7190                      .dwattr $C$DW$366, DW_AT_name("up")
    7191                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_up")
    7192                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7193                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7194              $C$DW$367       .dwtag  DW_TAG_member
    7195                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    7196                      .dwattr $C$DW$367, DW_AT_name("ui")
    7197                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_ui")
    7198                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7199                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7200              $C$DW$368       .dwtag  DW_TAG_member
    7201                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    7202                      .dwattr $C$DW$368, DW_AT_name("ud")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  160

    7203                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_ud")
    7204                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7205                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7206              $C$DW$369       .dwtag  DW_TAG_member
    7207                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    7208                      .dwattr $C$DW$369, DW_AT_name("v1")
    7209                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_v1")
    7210                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7211                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7212              $C$DW$370       .dwtag  DW_TAG_member
    7213                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    7214                      .dwattr $C$DW$370, DW_AT_name("i1")
    7215                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_i1")
    7216                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7217                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7218              $C$DW$371       .dwtag  DW_TAG_member
    7219                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    7220                      .dwattr $C$DW$371, DW_AT_name("d1")
    7221                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_d1")
    7222                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7223                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7224              $C$DW$372       .dwtag  DW_TAG_member
    7225                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    7226                      .dwattr $C$DW$372, DW_AT_name("d2")
    7227                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_d2")
    7228                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7229                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7230              $C$DW$373       .dwtag  DW_TAG_member
    7231                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    7232                      .dwattr $C$DW$373, DW_AT_name("w1")
    7233                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_w1")
    7234                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7235                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7236                      .dwendtag $C$DW$T$26
    7237              
    7238              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
    7239                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    7240                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    7241              
    7242              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7243                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    7244              $C$DW$374       .dwtag  DW_TAG_member
    7245                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$27)
    7246                      .dwattr $C$DW$374, DW_AT_name("term")
    7247                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_term")
    7248                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7249                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7250              $C$DW$375       .dwtag  DW_TAG_member
    7251                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$28)
    7252                      .dwattr $C$DW$375, DW_AT_name("param")
    7253                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_param")
    7254                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7255                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7256              $C$DW$376       .dwtag  DW_TAG_member
    7257                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  161

    7258                      .dwattr $C$DW$376, DW_AT_name("data")
    7259                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_data")
    7260                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7261                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7262                      .dwendtag $C$DW$T$30
    7263              
    7264              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
    7265                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    7266                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    7267              
    7268              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7269                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    7270              $C$DW$377       .dwtag  DW_TAG_member
    7271                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    7272                      .dwattr $C$DW$377, DW_AT_name("Ualpha")
    7273                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Ualpha")
    7274                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7275                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7276              $C$DW$378       .dwtag  DW_TAG_member
    7277                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    7278                      .dwattr $C$DW$378, DW_AT_name("Ubeta")
    7279                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Ubeta")
    7280                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7281                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7282              $C$DW$379       .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    7284                      .dwattr $C$DW$379, DW_AT_name("Ta")
    7285                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_Ta")
    7286                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7287                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7288              $C$DW$380       .dwtag  DW_TAG_member
    7289                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    7290                      .dwattr $C$DW$380, DW_AT_name("Tb")
    7291                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_Tb")
    7292                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7293                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7294              $C$DW$381       .dwtag  DW_TAG_member
    7295                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    7296                      .dwattr $C$DW$381, DW_AT_name("Tc")
    7297                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_Tc")
    7298                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7299                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7300              $C$DW$382       .dwtag  DW_TAG_member
    7301                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    7302                      .dwattr $C$DW$382, DW_AT_name("tmp1")
    7303                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_tmp1")
    7304                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7305                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7306              $C$DW$383       .dwtag  DW_TAG_member
    7307                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    7308                      .dwattr $C$DW$383, DW_AT_name("tmp2")
    7309                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_tmp2")
    7310                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7311                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7312              $C$DW$384       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  162

    7313                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    7314                      .dwattr $C$DW$384, DW_AT_name("tmp3")
    7315                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_tmp3")
    7316                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7317                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7318              $C$DW$385       .dwtag  DW_TAG_member
    7319                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$31)
    7320                      .dwattr $C$DW$385, DW_AT_name("VecSector")
    7321                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_VecSector")
    7322                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7323                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7324                      .dwendtag $C$DW$T$32
    7325              
    7326              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    7327                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    7328                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    7329              
    7330              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    7331                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    7332              $C$DW$386       .dwtag  DW_TAG_member
    7333                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    7334                      .dwattr $C$DW$386, DW_AT_name("TargetValue")
    7335                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_TargetValue")
    7336                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7337                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7338              $C$DW$387       .dwtag  DW_TAG_member
    7339                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$33)
    7340                      .dwattr $C$DW$387, DW_AT_name("RampDelayMax")
    7341                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RampDelayMax")
    7342                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7343                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7344              $C$DW$388       .dwtag  DW_TAG_member
    7345                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    7346                      .dwattr $C$DW$388, DW_AT_name("RampLowLimit")
    7347                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_RampLowLimit")
    7348                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7349                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7350              $C$DW$389       .dwtag  DW_TAG_member
    7351                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    7352                      .dwattr $C$DW$389, DW_AT_name("RampHighLimit")
    7353                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_RampHighLimit")
    7354                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7355                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7356              $C$DW$390       .dwtag  DW_TAG_member
    7357                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$33)
    7358                      .dwattr $C$DW$390, DW_AT_name("RampDelayCount")
    7359                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_RampDelayCount")
    7360                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7361                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7362              $C$DW$391       .dwtag  DW_TAG_member
    7363                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    7364                      .dwattr $C$DW$391, DW_AT_name("SetpointValue")
    7365                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_SetpointValue")
    7366                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7367                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  163

    7368              $C$DW$392       .dwtag  DW_TAG_member
    7369                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$33)
    7370                      .dwattr $C$DW$392, DW_AT_name("EqualFlag")
    7371                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_EqualFlag")
    7372                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7373                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7374              $C$DW$393       .dwtag  DW_TAG_member
    7375                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    7376                      .dwattr $C$DW$393, DW_AT_name("Tmp")
    7377                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_Tmp")
    7378                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7379                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    7380                      .dwendtag $C$DW$T$34
    7381              
    7382              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    7383                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    7384                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    7385              
    7386              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    7387                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    7388              $C$DW$394       .dwtag  DW_TAG_member
    7389                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    7390                      .dwattr $C$DW$394, DW_AT_name("Freq")
    7391                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Freq")
    7392                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7393                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    7394              $C$DW$395       .dwtag  DW_TAG_member
    7395                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    7396                      .dwattr $C$DW$395, DW_AT_name("StepAngleMax")
    7397                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_StepAngleMax")
    7398                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7399                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    7400              $C$DW$396       .dwtag  DW_TAG_member
    7401                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    7402                      .dwattr $C$DW$396, DW_AT_name("Angle")
    7403                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Angle")
    7404                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7405                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    7406              $C$DW$397       .dwtag  DW_TAG_member
    7407                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    7408                      .dwattr $C$DW$397, DW_AT_name("Gain")
    7409                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Gain")
    7410                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7411                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    7412              $C$DW$398       .dwtag  DW_TAG_member
    7413                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    7414                      .dwattr $C$DW$398, DW_AT_name("Out")
    7415                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Out")
    7416                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7417                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    7418              $C$DW$399       .dwtag  DW_TAG_member
    7419                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    7420                      .dwattr $C$DW$399, DW_AT_name("Offset")
    7421                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Offset")
    7422                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  164

    7423                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    7424                      .dwendtag $C$DW$T$35
    7425              
    7426              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    7427                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    7428                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    7429              
    7430              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7431                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    7432              $C$DW$400       .dwtag  DW_TAG_member
    7433                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    7434                      .dwattr $C$DW$400, DW_AT_name("DcBusVolt")
    7435                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_DcBusVolt")
    7436                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7437                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    7438              $C$DW$401       .dwtag  DW_TAG_member
    7439                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    7440                      .dwattr $C$DW$401, DW_AT_name("MfuncV1")
    7441                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_MfuncV1")
    7442                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7443                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    7444              $C$DW$402       .dwtag  DW_TAG_member
    7445                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    7446                      .dwattr $C$DW$402, DW_AT_name("MfuncV2")
    7447                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_MfuncV2")
    7448                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7449                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    7450              $C$DW$403       .dwtag  DW_TAG_member
    7451                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    7452                      .dwattr $C$DW$403, DW_AT_name("MfuncV3")
    7453                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_MfuncV3")
    7454                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7455                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    7456              $C$DW$404       .dwtag  DW_TAG_member
    7457                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$31)
    7458                      .dwattr $C$DW$404, DW_AT_name("OutOfPhase")
    7459                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_OutOfPhase")
    7460                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7461                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    7462              $C$DW$405       .dwtag  DW_TAG_member
    7463                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    7464                      .dwattr $C$DW$405, DW_AT_name("VphaseA")
    7465                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_VphaseA")
    7466                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7467                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    7468              $C$DW$406       .dwtag  DW_TAG_member
    7469                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    7470                      .dwattr $C$DW$406, DW_AT_name("VphaseB")
    7471                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_VphaseB")
    7472                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7473                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    7474              $C$DW$407       .dwtag  DW_TAG_member
    7475                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    7476                      .dwattr $C$DW$407, DW_AT_name("VphaseC")
    7477                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_VphaseC")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  165

    7478                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7479                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    7480              $C$DW$408       .dwtag  DW_TAG_member
    7481                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    7482                      .dwattr $C$DW$408, DW_AT_name("Valpha")
    7483                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Valpha")
    7484                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7485                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7486              $C$DW$409       .dwtag  DW_TAG_member
    7487                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    7488                      .dwattr $C$DW$409, DW_AT_name("Vbeta")
    7489                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_Vbeta")
    7490                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7491                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7492              $C$DW$410       .dwtag  DW_TAG_member
    7493                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    7494                      .dwattr $C$DW$410, DW_AT_name("temp")
    7495                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_temp")
    7496                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7497                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7498                      .dwendtag $C$DW$T$36
    7499              
    7500              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    7501                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    7502                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    7503              
    7504              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7505                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    7506              $C$DW$411       .dwtag  DW_TAG_member
    7507                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
    7508                      .dwattr $C$DW$411, DW_AT_name("ElecTheta")
    7509                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_ElecTheta")
    7510                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7511                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7512              $C$DW$412       .dwtag  DW_TAG_member
    7513                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$33)
    7514                      .dwattr $C$DW$412, DW_AT_name("DirectionQep")
    7515                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_DirectionQep")
    7516                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7517                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7518              $C$DW$413       .dwtag  DW_TAG_member
    7519                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    7520                      .dwattr $C$DW$413, DW_AT_name("OldElecTheta")
    7521                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_OldElecTheta")
    7522                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7523                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7524              $C$DW$414       .dwtag  DW_TAG_member
    7525                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
    7526                      .dwattr $C$DW$414, DW_AT_name("Speed")
    7527                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Speed")
    7528                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7529                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7530              $C$DW$415       .dwtag  DW_TAG_member
    7531                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$33)
    7532                      .dwattr $C$DW$415, DW_AT_name("BaseRpm")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  166

    7533                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_BaseRpm")
    7534                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7535                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7536              $C$DW$416       .dwtag  DW_TAG_member
    7537                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$37)
    7538                      .dwattr $C$DW$416, DW_AT_name("K1")
    7539                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_K1")
    7540                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7541                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    7542              $C$DW$417       .dwtag  DW_TAG_member
    7543                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
    7544                      .dwattr $C$DW$417, DW_AT_name("K2")
    7545                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_K2")
    7546                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7547                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7548              $C$DW$418       .dwtag  DW_TAG_member
    7549                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
    7550                      .dwattr $C$DW$418, DW_AT_name("K3")
    7551                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_K3")
    7552                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7553                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7554              $C$DW$419       .dwtag  DW_TAG_member
    7555                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$38)
    7556                      .dwattr $C$DW$419, DW_AT_name("SpeedRpm")
    7557                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_SpeedRpm")
    7558                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7559                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7560              $C$DW$420       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    7562                      .dwattr $C$DW$420, DW_AT_name("Tmp")
    7563                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Tmp")
    7564                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7565                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7566                      .dwendtag $C$DW$T$39
    7567              
    7568              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    7569                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    7570                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    7571              
    7572              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    7573                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    7574              $C$DW$421       .dwtag  DW_TAG_member
    7575                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$40)
    7576                      .dwattr $C$DW$421, DW_AT_name("ElecTheta")
    7577                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_ElecTheta")
    7578                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7579                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7580              $C$DW$422       .dwtag  DW_TAG_member
    7581                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$40)
    7582                      .dwattr $C$DW$422, DW_AT_name("MechTheta")
    7583                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_MechTheta")
    7584                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7585                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7586              $C$DW$423       .dwtag  DW_TAG_member
    7587                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  167

    7588                      .dwattr $C$DW$423, DW_AT_name("DirectionQep")
    7589                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_DirectionQep")
    7590                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7591                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    7592              $C$DW$424       .dwtag  DW_TAG_member
    7593                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$31)
    7594                      .dwattr $C$DW$424, DW_AT_name("QepPeriod")
    7595                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_QepPeriod")
    7596                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7597                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    7598              $C$DW$425       .dwtag  DW_TAG_member
    7599                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$33)
    7600                      .dwattr $C$DW$425, DW_AT_name("QepCountIndex")
    7601                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_QepCountIndex")
    7602                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7603                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    7604              $C$DW$426       .dwtag  DW_TAG_member
    7605                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$38)
    7606                      .dwattr $C$DW$426, DW_AT_name("RawTheta")
    7607                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_RawTheta")
    7608                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7609                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    7610              $C$DW$427       .dwtag  DW_TAG_member
    7611                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$40)
    7612                      .dwattr $C$DW$427, DW_AT_name("MechScaler")
    7613                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_MechScaler")
    7614                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7615                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    7616              $C$DW$428       .dwtag  DW_TAG_member
    7617                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$31)
    7618                      .dwattr $C$DW$428, DW_AT_name("LineEncoder")
    7619                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_LineEncoder")
    7620                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7621                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    7622              $C$DW$429       .dwtag  DW_TAG_member
    7623                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$31)
    7624                      .dwattr $C$DW$429, DW_AT_name("PolePairs")
    7625                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_PolePairs")
    7626                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7627                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    7628              $C$DW$430       .dwtag  DW_TAG_member
    7629                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$38)
    7630                      .dwattr $C$DW$430, DW_AT_name("CalibratedAngle")
    7631                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_CalibratedAngle")
    7632                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7633                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    7634              $C$DW$431       .dwtag  DW_TAG_member
    7635                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$31)
    7636                      .dwattr $C$DW$431, DW_AT_name("IndexSyncFlag")
    7637                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_IndexSyncFlag")
    7638                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7639                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    7640                      .dwendtag $C$DW$T$41
    7641              
    7642              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  168

    7643                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    7644                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    7645              
    7646              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7647                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    7648              $C$DW$432       .dwtag  DW_TAG_member
    7649                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$42)
    7650                      .dwattr $C$DW$432, DW_AT_name("stat_reg1")
    7651                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_stat_reg1")
    7652                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7653                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7654              $C$DW$433       .dwtag  DW_TAG_member
    7655                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$43)
    7656                      .dwattr $C$DW$433, DW_AT_name("stat_reg2")
    7657                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_stat_reg2")
    7658                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7659                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7660              $C$DW$434       .dwtag  DW_TAG_member
    7661                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$44)
    7662                      .dwattr $C$DW$434, DW_AT_name("cntrl_reg1")
    7663                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_cntrl_reg1")
    7664                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7665                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    7666              $C$DW$435       .dwtag  DW_TAG_member
    7667                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$45)
    7668                      .dwattr $C$DW$435, DW_AT_name("cntrl_reg2")
    7669                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_cntrl_reg2")
    7670                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7671                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    7672              $C$DW$436       .dwtag  DW_TAG_member
    7673                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$31)
    7674                      .dwattr $C$DW$436, DW_AT_name("readCntrl1")
    7675                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_readCntrl1")
    7676                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7677                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    7678              $C$DW$437       .dwtag  DW_TAG_member
    7679                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$31)
    7680                      .dwattr $C$DW$437, DW_AT_name("readCntrl2")
    7681                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_readCntrl2")
    7682                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7683                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    7684              $C$DW$438       .dwtag  DW_TAG_member
    7685                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$31)
    7686                      .dwattr $C$DW$438, DW_AT_name("DRV_fault")
    7687                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_DRV_fault")
    7688                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7689                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    7690                      .dwendtag $C$DW$T$46
    7691              
    7692              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    7693                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    7694                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    7695              
    7696              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    7697                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  169

    7698              $C$DW$439       .dwtag  DW_TAG_member
    7699                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$31)
    7700                      .dwattr $C$DW$439, DW_AT_name("Rsvd0")
    7701                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_Rsvd0")
    7702                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7703                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    7704              $C$DW$440       .dwtag  DW_TAG_member
    7705                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$47)
    7706                      .dwattr $C$DW$440, DW_AT_name("status1_wwd")
    7707                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_status1_wwd")
    7708                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7709                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    7710              $C$DW$441       .dwtag  DW_TAG_member
    7711                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$48)
    7712                      .dwattr $C$DW$441, DW_AT_name("status2_ov_vds")
    7713                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_status2_ov_vds")
    7714                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7715                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    7716              $C$DW$442       .dwtag  DW_TAG_member
    7717                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$49)
    7718                      .dwattr $C$DW$442, DW_AT_name("status3_IC")
    7719                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_status3_IC")
    7720                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7721                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    7722              $C$DW$443       .dwtag  DW_TAG_member
    7723                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$50)
    7724                      .dwattr $C$DW$443, DW_AT_name("status4_gd_Vgs")
    7725                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    7726                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7727                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    7728              $C$DW$444       .dwtag  DW_TAG_member
    7729                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$51)
    7730                      .dwattr $C$DW$444, DW_AT_name("cntrl5_hs_gd")
    7731                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    7732                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7733                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    7734              $C$DW$445       .dwtag  DW_TAG_member
    7735                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$52)
    7736                      .dwattr $C$DW$445, DW_AT_name("cntrl6_ls_gd")
    7737                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    7738                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7739                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    7740              $C$DW$446       .dwtag  DW_TAG_member
    7741                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$53)
    7742                      .dwattr $C$DW$446, DW_AT_name("cntrl7_gd")
    7743                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_cntrl7_gd")
    7744                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7745                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    7746              $C$DW$447       .dwtag  DW_TAG_member
    7747                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$31)
    7748                      .dwattr $C$DW$447, DW_AT_name("Rsvd8")
    7749                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_Rsvd8")
    7750                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7751                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    7752              $C$DW$448       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  170

    7753                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$54)
    7754                      .dwattr $C$DW$448, DW_AT_name("cntrl9_IC_ops")
    7755                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    7756                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7757                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    7758              $C$DW$449       .dwtag  DW_TAG_member
    7759                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$55)
    7760                      .dwattr $C$DW$449, DW_AT_name("cntrlA_shunt_amp")
    7761                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    7762                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7763                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    7764              $C$DW$450       .dwtag  DW_TAG_member
    7765                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$56)
    7766                      .dwattr $C$DW$450, DW_AT_name("cntrlB_Vreg")
    7767                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    7768                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    7769                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    7770              $C$DW$451       .dwtag  DW_TAG_member
    7771                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$57)
    7772                      .dwattr $C$DW$451, DW_AT_name("cntrlC_Vds_SNS")
    7773                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    7774                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7775                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    7776              $C$DW$452       .dwtag  DW_TAG_member
    7777                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$31)
    7778                      .dwattr $C$DW$452, DW_AT_name("readCntrl5")
    7779                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_readCntrl5")
    7780                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7781                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    7782              $C$DW$453       .dwtag  DW_TAG_member
    7783                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$31)
    7784                      .dwattr $C$DW$453, DW_AT_name("readCntrl6")
    7785                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_readCntrl6")
    7786                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7787                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    7788              $C$DW$454       .dwtag  DW_TAG_member
    7789                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$31)
    7790                      .dwattr $C$DW$454, DW_AT_name("readCntrl7")
    7791                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_readCntrl7")
    7792                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7793                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    7794              $C$DW$455       .dwtag  DW_TAG_member
    7795                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$31)
    7796                      .dwattr $C$DW$455, DW_AT_name("readCntrl9")
    7797                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_readCntrl9")
    7798                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7799                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    7800              $C$DW$456       .dwtag  DW_TAG_member
    7801                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$31)
    7802                      .dwattr $C$DW$456, DW_AT_name("readCntrlA")
    7803                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_readCntrlA")
    7804                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7805                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    7806              $C$DW$457       .dwtag  DW_TAG_member
    7807                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  171

    7808                      .dwattr $C$DW$457, DW_AT_name("readCntrlB")
    7809                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_readCntrlB")
    7810                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7811                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    7812              $C$DW$458       .dwtag  DW_TAG_member
    7813                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$31)
    7814                      .dwattr $C$DW$458, DW_AT_name("readCntrlC")
    7815                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_readCntrlC")
    7816                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7817                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    7818              $C$DW$459       .dwtag  DW_TAG_member
    7819                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$31)
    7820                      .dwattr $C$DW$459, DW_AT_name("DRV_fault")
    7821                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_DRV_fault")
    7822                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7823                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    7824                      .dwendtag $C$DW$T$58
    7825              
    7826              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    7827                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    7828                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    7829              
    7830              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7831                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x14c)
    7832              $C$DW$460       .dwtag  DW_TAG_member
    7833                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$60)
    7834                      .dwattr $C$DW$460, DW_AT_name("PwmARegs")
    7835                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_PwmARegs")
    7836                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7837                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    7838              $C$DW$461       .dwtag  DW_TAG_member
    7839                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$60)
    7840                      .dwattr $C$DW$461, DW_AT_name("PwmBRegs")
    7841                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_PwmBRegs")
    7842                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7843                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    7844              $C$DW$462       .dwtag  DW_TAG_member
    7845                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$60)
    7846                      .dwattr $C$DW$462, DW_AT_name("PwmCRegs")
    7847                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_PwmCRegs")
    7848                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7849                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7850              $C$DW$463       .dwtag  DW_TAG_member
    7851                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$62)
    7852                      .dwattr $C$DW$463, DW_AT_name("QepRegs")
    7853                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_QepRegs")
    7854                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7855                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7856              $C$DW$464       .dwtag  DW_TAG_member
    7857                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$64)
    7858                      .dwattr $C$DW$464, DW_AT_name("SpiRegs")
    7859                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_SpiRegs")
    7860                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7861                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7862              $C$DW$465       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  172

    7863                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$31)
    7864                      .dwattr $C$DW$465, DW_AT_name("drvScsPin")
    7865                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_drvScsPin")
    7866                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7867                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7868              $C$DW$466       .dwtag  DW_TAG_member
    7869                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
    7870                      .dwattr $C$DW$466, DW_AT_name("offset_shntA")
    7871                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_offset_shntA")
    7872                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7873                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7874              $C$DW$467       .dwtag  DW_TAG_member
    7875                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
    7876                      .dwattr $C$DW$467, DW_AT_name("offset_shntB")
    7877                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_offset_shntB")
    7878                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7879                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7880              $C$DW$468       .dwtag  DW_TAG_member
    7881                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
    7882                      .dwattr $C$DW$468, DW_AT_name("offset_shntC")
    7883                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_offset_shntC")
    7884                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7885                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7886              $C$DW$469       .dwtag  DW_TAG_member
    7887                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
    7888                      .dwattr $C$DW$469, DW_AT_name("VdTesting")
    7889                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_VdTesting")
    7890                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7891                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7892              $C$DW$470       .dwtag  DW_TAG_member
    7893                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
    7894                      .dwattr $C$DW$470, DW_AT_name("VqTesting")
    7895                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_VqTesting")
    7896                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7897                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7898              $C$DW$471       .dwtag  DW_TAG_member
    7899                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
    7900                      .dwattr $C$DW$471, DW_AT_name("IdRef")
    7901                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_IdRef")
    7902                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7903                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7904              $C$DW$472       .dwtag  DW_TAG_member
    7905                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
    7906                      .dwattr $C$DW$472, DW_AT_name("IqRef")
    7907                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_IqRef")
    7908                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7909                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7910              $C$DW$473       .dwtag  DW_TAG_member
    7911                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    7912                      .dwattr $C$DW$473, DW_AT_name("SpeedRef")
    7913                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_SpeedRef")
    7914                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7915                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7916              $C$DW$474       .dwtag  DW_TAG_member
    7917                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  173

    7918                      .dwattr $C$DW$474, DW_AT_name("ElecTheta")
    7919                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_ElecTheta")
    7920                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7921                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7922              $C$DW$475       .dwtag  DW_TAG_member
    7923                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    7924                      .dwattr $C$DW$475, DW_AT_name("MechTheta")
    7925                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_MechTheta")
    7926                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7927                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7928              $C$DW$476       .dwtag  DW_TAG_member
    7929                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$40)
    7930                      .dwattr $C$DW$476, DW_AT_name("currentAs")
    7931                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_currentAs")
    7932                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7933                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7934              $C$DW$477       .dwtag  DW_TAG_member
    7935                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$40)
    7936                      .dwattr $C$DW$477, DW_AT_name("currentBs")
    7937                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_currentBs")
    7938                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7939                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7940              $C$DW$478       .dwtag  DW_TAG_member
    7941                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$40)
    7942                      .dwattr $C$DW$478, DW_AT_name("currentCs")
    7943                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_currentCs")
    7944                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7945                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7946              $C$DW$479       .dwtag  DW_TAG_member
    7947                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$38)
    7948                      .dwattr $C$DW$479, DW_AT_name("alignCntr")
    7949                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_alignCntr")
    7950                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7951                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7952              $C$DW$480       .dwtag  DW_TAG_member
    7953                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$38)
    7954                      .dwattr $C$DW$480, DW_AT_name("alignCnt")
    7955                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_alignCnt")
    7956                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7957                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7958              $C$DW$481       .dwtag  DW_TAG_member
    7959                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$31)
    7960                      .dwattr $C$DW$481, DW_AT_name("lsw")
    7961                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_lsw")
    7962                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7963                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7964              $C$DW$482       .dwtag  DW_TAG_member
    7965                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$31)
    7966                      .dwattr $C$DW$482, DW_AT_name("TripFlagDMC")
    7967                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_TripFlagDMC")
    7968                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    7969                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7970              $C$DW$483       .dwtag  DW_TAG_member
    7971                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$31)
    7972                      .dwattr $C$DW$483, DW_AT_name("clearTripFlagDMC")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  174

    7973                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    7974                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7975                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7976              $C$DW$484       .dwtag  DW_TAG_member
    7977                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$31)
    7978                      .dwattr $C$DW$484, DW_AT_name("RunMotor")
    7979                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_RunMotor")
    7980                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    7981                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7982              $C$DW$485       .dwtag  DW_TAG_member
    7983                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$31)
    7984                      .dwattr $C$DW$485, DW_AT_name("SpeedLoopPrescaler")
    7985                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
    7986                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7987                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7988              $C$DW$486       .dwtag  DW_TAG_member
    7989                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$31)
    7990                      .dwattr $C$DW$486, DW_AT_name("SpeedLoopCount")
    7991                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_SpeedLoopCount")
    7992                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    7993                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7994              $C$DW$487       .dwtag  DW_TAG_member
    7995                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$31)
    7996                      .dwattr $C$DW$487, DW_AT_name("PosSenseReverse")
    7997                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_PosSenseReverse")
    7998                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7999                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8000              $C$DW$488       .dwtag  DW_TAG_member
    8001                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$31)
    8002                      .dwattr $C$DW$488, DW_AT_name("newCmdDRV")
    8003                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_newCmdDRV")
    8004                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    8005                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8006              $C$DW$489       .dwtag  DW_TAG_member
    8007                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$40)
    8008                      .dwattr $C$DW$489, DW_AT_name("T")
    8009                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_T")
    8010                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    8011                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8012              $C$DW$490       .dwtag  DW_TAG_member
    8013                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$65)
    8014                      .dwattr $C$DW$490, DW_AT_name("clarke")
    8015                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_clarke")
    8016                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8017                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8018              $C$DW$491       .dwtag  DW_TAG_member
    8019                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$66)
    8020                      .dwattr $C$DW$491, DW_AT_name("park")
    8021                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_park")
    8022                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    8023                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8024              $C$DW$492       .dwtag  DW_TAG_member
    8025                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$67)
    8026                      .dwattr $C$DW$492, DW_AT_name("ipark")
    8027                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_ipark")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:25:39 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DiffDrive.asm                                                        PAGE  175

    8028                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8029                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8030              $C$DW$493       .dwtag  DW_TAG_member
    8031                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$68)
    8032                      .dwattr $C$DW$493, DW_AT_name("pi_pos")
    8033                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_pi_pos")
    8034                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    8035                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8036              $C$DW$494       .dwtag  DW_TAG_member
    8037                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$69)
    8038                      .dwattr $C$DW$494, DW_AT_name("pid_spd")
    8039                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_pid_spd")
