TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:43 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:36:43 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../utility Src Files/DLOG_4CH_F.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              ;       C:\ti\ccsv6\tools\compiler\ti-cgt-c2000_6.4.2\bin\ac2000.exe -@C:\\Users\\ficm\\AppData\\Local\\Temp\
      14 00000000               .sect   ".text"
      15                      .clink

     298 000000b2 0218          MOVB      ACC,#24               ; [CPU_] |47| 
     299 000000b3 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |47| 
     300 000000b4 8AA9          MOVL      XAR4,ACC              ; [CPU_] |47| 
     301 000000b5 0AC4          INC       *+XAR4[0]             ; [CPU_] |47| 
     302                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 48,column 4,is_stmt,isa 0
     303 000000b6 0217          MOVB      ACC,#23               ; [CPU_] |48| 
     304 000000b7 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |48| 
     305 000000b8 8AA9          MOVL      XAR4,ACC              ; [CPU_] |48| 
     306 000000b9 88C4          MOVZ      AR6,*+XAR4[0]         ; [CPU_] |48| 
     307 000000ba 0218          MOVB      ACC,#24               ; [CPU_] |48| 
     308 000000bb 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |48| 
     309 000000bc 8AA9          MOVL      XAR4,ACC              ; [CPU_] |48| 
     310 000000bd 92A6          MOV       AL,AR6                ; [CPU_] |48| 
     311 000000be 54C4          CMP       AL,*+XAR4[0]          ; [CPU_] |48| 
     312 000000bf ED14          BF        $C$L4,NEQ             ; [CPU_] |48| 
     313                      ; branchcc occurs ; [] |48| 
     314                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 50,column 5,is_stmt,isa 0
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:43 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    7

     315 000000c0 0218          MOVB      ACC,#24               ; [CPU_] |50| 
     316 000000c1 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |50| 
     317 000000c2 8AA9          MOVL      XAR4,ACC              ; [CPU_] |50| 
     318 000000c3 2BC4          MOV       *+XAR4[0],#0          ; [CPU_] |50| 
     319                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 51,column 5,is_stmt,isa 0
     320 000000c4 0214          MOVB      ACC,#20               ; [CPU_] |51| 
     321 000000c5 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |51| 
     322 000000c6 8AA9          MOVL      XAR4,ACC              ; [CPU_] |51| 
     323 000000c7 56BF          MOVB      *+XAR4[0],#1,UNC      ; [CPU_] |51| 
         000000c8 01C4 
     324                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 54,column 3,is_stmt,isa 0
     325 000000c9 6F0A          B         $C$L4,UNC             ; [CPU_] |54| 
     326                      ; branch occurs ; [] |54| 
     327 000000ca       $C$L3:    
     328                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 29,column 2,is_stmt,isa 0
     329 000000ca 0214          MOVB      ACC,#20               ; [CPU_] |29| 
     330 000000cb 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |29| 
     331 000000cc 8AA9          MOVL      XAR4,ACC              ; [CPU_] |29| 
     332 000000cd 92C4          MOV       AL,*+XAR4[0]          ; [CPU_] |29| 
     333 000000ce 5201          CMPB      AL,#1                 ; [CPU_] |29| 
     334 000000cf 56C1          BF        $C$L1,EQ              ; [CPU_] |29| 
         000000d0 FF71 
     335                      ; branchcc occurs ; [] |29| 
     336 000000d1 5202          CMPB      AL,#2                 ; [CPU_] |29| 
     337 000000d2 EC91          BF        $C$L2,EQ              ; [CPU_] |29| 
     338                      ; branchcc occurs ; [] |29| 
     339 000000d3       $C$L4:    
     340                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 56,column 2,is_stmt,isa 0
     341 000000d3 8344          MOVL      XAR5,*-SP[4]          ; [CPU_] |56| 
     342 000000d4 83C5          MOVL      XAR5,*+XAR5[0]        ; [CPU_] |56| 
     343 000000d5 0210          MOVB      ACC,#16               ; [CPU_] |56| 
     344 000000d6 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |56| 
     345 000000d7 8AA9          MOVL      XAR4,ACC              ; [CPU_] |56| 
     346 000000d8 C4C5          MOVL      XAR6,*+XAR5[0]        ; [CPU_] |56| 
     347 000000d9 C2C4          MOVL      *+XAR4[0],XAR6        ; [CPU_] |56| 
     348                      .dwpsn  file "../utility Src Files/DLOG_4CH_F.c",line 57,column 1,is_stmt,isa 0
     349 000000da FE84          SUBB      SP,#4                 ; [CPU_U] 
     350                      .dwcfi  cfa_offset, -2
     351              $C$DW$8 .dwtag  DW_TAG_TI_branch
     352                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     353                      .dwattr $C$DW$8, DW_AT_TI_return
     354 000000db 0006          LRETR     ; [CPU_] 
     355                      ; return occurs ; [] 
     356                      .dwattr $C$DW$5, DW_AT_TI_end_file("../utility Src Files/DLOG_4CH_F.c")
     357                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x39)
     358                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     359                      .dwendentry
     360                      .dwendtag $C$DW$5
     361              
     362              
     363              ;***************************************************************
     364              ;* TYPE INFORMATION                                            *
     365              ;***************************************************************
     366              
     367              $C$DW$T$22      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:43 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    8

     368                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
     369              $C$DW$9 .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$20)
     371                      .dwattr $C$DW$9, DW_AT_name("input_ptr1")
     372                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_input_ptr1")
     373                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     374                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     375              $C$DW$10        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$20)
     377                      .dwattr $C$DW$10, DW_AT_name("input_ptr2")
     378                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_input_ptr2")
     379                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     380                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     381              $C$DW$11        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$20)
     383                      .dwattr $C$DW$11, DW_AT_name("input_ptr3")
     384                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_input_ptr3")
     385                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     386                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     387              $C$DW$12        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$20)
     389                      .dwattr $C$DW$12, DW_AT_name("input_ptr4")
     390                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_input_ptr4")
     391                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     392                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     393              $C$DW$13        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$20)
     395                      .dwattr $C$DW$13, DW_AT_name("output_ptr1")
     396                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_output_ptr1")
     397                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     398                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     399              $C$DW$14        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$20)
     401                      .dwattr $C$DW$14, DW_AT_name("output_ptr2")
     402                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_output_ptr2")
     403                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     404                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     405              $C$DW$15        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$20)
     407                      .dwattr $C$DW$15, DW_AT_name("output_ptr3")
     408                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_output_ptr3")
     409                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     410                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     411              $C$DW$16        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$20)
     413                      .dwattr $C$DW$16, DW_AT_name("output_ptr4")
     414                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_output_ptr4")
     415                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     416                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     417              $C$DW$17        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     419                      .dwattr $C$DW$17, DW_AT_name("prev_value")
     420                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_prev_value")
     421                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     422                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:43 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE    9

     423              $C$DW$18        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$18, DW_AT_name("trig_value")
     426                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_trig_value")
     427                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     428                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     429              $C$DW$19        .dwtag  DW_TAG_member
     430                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$21)
     431                      .dwattr $C$DW$19, DW_AT_name("status")
     432                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_status")
     433                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     434                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     435              $C$DW$20        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$21)
     437                      .dwattr $C$DW$20, DW_AT_name("pre_scalar")
     438                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_pre_scalar")
     439                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     440                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     441              $C$DW$21        .dwtag  DW_TAG_member
     442                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     443                      .dwattr $C$DW$21, DW_AT_name("skip_count")
     444                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_skip_count")
     445                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     446                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     447              $C$DW$22        .dwtag  DW_TAG_member
     448                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     449                      .dwattr $C$DW$22, DW_AT_name("size")
     450                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_size")
     451                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     452                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     453              $C$DW$23        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$21)
     455                      .dwattr $C$DW$23, DW_AT_name("count")
     456                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_count")
     457                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     458                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     459                      .dwendtag $C$DW$T$22
     460              
     461              $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("DLOG_4CH_F")
     462                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     463                      .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     464              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     465                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     466                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     467              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     468                      .dwattr $C$DW$T$2, DW_AT_name("void")
     469              $C$DW$T$4       .dwtag  DW_TAG_base_type
     470                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     471                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     472                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     473              $C$DW$T$5       .dwtag  DW_TAG_base_type
     474                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     475                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     476                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     477              $C$DW$T$6       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:43 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DLOG_4CH_F.asm                                                       PAGE   10

     478                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     479                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     480                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     481              $C$DW$T$7       .dwtag  DW_TAG_base_type
     482                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     483                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     484                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     485              $C$DW$T$8       .dwtag  DW_TAG_base_type
     486                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     487                      .dwattr $C$DW$T$8, DW_AT_name("short")
     488                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     489              $C$DW$T$9       .dwtag  DW_TAG_base_type
     490                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     491                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     492                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     493              $C$DW$T$10      .dwtag  DW_TAG_base_type
     494                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     495                      .dwattr $C$DW$T$10, DW_AT_name("int")
     496                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     497              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("int16")
     498                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$10)
     499                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     500              $C$DW$T$11      .dwtag  DW_TAG_base_type
     501                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     502                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     503                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     504              $C$DW$T$12      .dwtag  DW_TAG_base_type
     505                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     506                      .dwattr $C$DW$T$12, DW_AT_name("long")
     507                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     508              $C$DW$T$13      .dwtag  DW_TAG_base_type
     509                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
