TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:26:02 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../motors/HAL/drv8305.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("DRV8305_SPI_Read")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8305_SPI_Read")

     841 00000250 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |159| 
     842 00000251 9A03          MOVB      AL,#3                 ; [CPU_] |159| 
     843              $C$DW$41        .dwtag  DW_TAG_TI_branch
     844                      .dwattr $C$DW$41, DW_AT_low_pc(0x00)
     845                      .dwattr $C$DW$41, DW_AT_name("_DRV8305_SPI_Read")
     846                      .dwattr $C$DW$41, DW_AT_TI_call
     847 00000252 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_] |159| 
         00000253 0000 
     848                      ; call occurs [#_DRV8305_SPI_Read] ; [] |159| 
     849 00000254 CCA9          AND       AL,AL,#0x0777         ; [CPU_] |159| 
         00000255 0777 
     850 00000256 8F00          MOVL      XAR4,#314             ; [CPU_U] |159| 
         00000257 013A 
     851 00000258 88A9          MOVZ      AR6,AL                ; [CPU_] |159| 
     852 00000259 A8A9          MOVL      ACC,XAR4              ; [CPU_] |159| 
     853 0000025a 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |159| 
     854 0000025b 8AA9          MOVL      XAR4,ACC              ; [CPU_] |159| 
     855 0000025c 7EC4          MOV       *+XAR4[0],AR6         ; [CPU_] |159| 
     856                      .dwpsn  file "../motors/HAL/drv8305.c",line 160,column 2,is_stmt,isa 0
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   19

     857 0000025d 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |160| 
     858 0000025e 9A04          MOVB      AL,#4                 ; [CPU_] |160| 
     859              $C$DW$42        .dwtag  DW_TAG_TI_branch
     860                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     861                      .dwattr $C$DW$42, DW_AT_name("_DRV8305_SPI_Read")
     862                      .dwattr $C$DW$42, DW_AT_TI_call
     863 0000025f 7640!         LCR       #_DRV8305_SPI_Read    ; [CPU_] |160| 
         00000260 0000 
     864                      ; call occurs [#_DRV8305_SPI_Read] ; [] |160| 
     865 00000261 CCA9          AND       AL,AL,#0x07e0         ; [CPU_] |160| 
         00000262 07E0 
     866 00000263 8F00          MOVL      XAR4,#315             ; [CPU_U] |160| 
         00000264 013B 
     867 00000265 88A9          MOVZ      AR6,AL                ; [CPU_] |160| 
     868 00000266 A8A9          MOVL      ACC,XAR4              ; [CPU_] |160| 
     869 00000267 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |160| 
     870 00000268 8AA9          MOVL      XAR4,ACC              ; [CPU_] |160| 
     871 00000269 7EC4          MOV       *+XAR4[0],AR6         ; [CPU_] |160| 
     872                      .dwpsn  file "../motors/HAL/drv8305.c",line 162,column 2,is_stmt,isa 0
     873                      .dwpsn  file "../motors/HAL/drv8305.c",line 167,column 2,is_stmt,isa 0
     874                      .dwpsn  file "../motors/HAL/drv8305.c",line 172,column 2,is_stmt,isa 0
     875                      .dwpsn  file "../motors/HAL/drv8305.c",line 177,column 2,is_stmt,isa 0
     876 0000026a 8F00          MOVL      XAR4,#315             ; [CPU_U] |177| 
         0000026b 013B 
     877 0000026c A8A9          MOVL      ACC,XAR4              ; [CPU_] |177| 
     878 0000026d 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |177| 
     879 0000026e 8AA9          MOVL      XAR4,ACC              ; [CPU_] |177| 
     880 0000026f 92C4          MOV       AL,*+XAR4[0]          ; [CPU_] |177| 
     881 00000270 ED01          BF        $C$L7,NEQ             ; [CPU_] |177| 
     882                      ; branchcc occurs ; [] |177| 
     883                      .dwpsn  file "../motors/HAL/drv8305.c",line 182,column 2,is_stmt,isa 0
     884 00000271       $C$L7:    
     885                      .dwpsn  file "../motors/HAL/drv8305.c",line 183,column 1,is_stmt,isa 0
     886 00000271 FE82          SUBB      SP,#2                 ; [CPU_U] 
     887                      .dwcfi  cfa_offset, -2
     888              $C$DW$43        .dwtag  DW_TAG_TI_branch
     889                      .dwattr $C$DW$43, DW_AT_low_pc(0x00)
     890                      .dwattr $C$DW$43, DW_AT_TI_return
     891 00000272 0006          LRETR     ; [CPU_] 
     892                      ; return occurs ; [] 
     893                      .dwattr $C$DW$36, DW_AT_TI_end_file("../motors/HAL/drv8305.c")
     894                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xb7)
     895                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
     896                      .dwendentry
     897                      .dwendtag $C$DW$36
     898              
     899              ;**************************************************************
     900              ;* UNDEFINED EXTERNAL REFERENCES                              *
     901              ;**************************************************************
     902                      .global _DRV8305_SPI_Read
     903                      .global _DRV8305_SPI_Write
     904              
     905              ;***************************************************************
     906              ;* TYPE INFORMATION                                            *
     907              ;***************************************************************
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   20

     908              
     909              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     910                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     911              $C$DW$44        .dwtag  DW_TAG_member
     912                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     913                      .dwattr $C$DW$44, DW_AT_name("As")
     914                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_As")
     915                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     917              $C$DW$45        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$45, DW_AT_name("Bs")
     920                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Bs")
     921                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     922                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$46        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$46, DW_AT_name("Cs")
     926                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Cs")
     927                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     928                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$47        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$47, DW_AT_name("Alpha")
     932                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Alpha")
     933                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     934                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$48        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$48, DW_AT_name("Beta")
     938                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Beta")
     939                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     940                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     941                      .dwendtag $C$DW$T$20
     942              
     943              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
     944                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     945                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     946              
     947              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     948                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     949              $C$DW$49        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$49, DW_AT_name("Alpha")
     952                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Alpha")
     953                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$50        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$50, DW_AT_name("Beta")
     958                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Beta")
     959                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     960                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$51        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   21

     963                      .dwattr $C$DW$51, DW_AT_name("Angle")
     964                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Angle")
     965                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     966                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$52        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$52, DW_AT_name("Ds")
     970                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ds")
     971                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     972                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     973              $C$DW$53        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$53, DW_AT_name("Qs")
     976                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Qs")
     977                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     978                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$54        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$54, DW_AT_name("Sine")
     982                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Sine")
     983                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     984                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$55        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     987                      .dwattr $C$DW$55, DW_AT_name("Cosine")
     988                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cosine")
     989                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     990                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     991                      .dwendtag $C$DW$T$21
     992              
     993              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
     994                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     995                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     996              
     997              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     998                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     999              $C$DW$56        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$56, DW_AT_name("Alpha")
    1002                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
    1003                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$57        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1007                      .dwattr $C$DW$57, DW_AT_name("Beta")
    1008                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
    1009                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1010                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$58        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$58, DW_AT_name("Angle")
    1014                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Angle")
    1015                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1016                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$59        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   22

    1018                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$59, DW_AT_name("Ds")
    1020                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Ds")
    1021                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1022                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$60        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$60, DW_AT_name("Qs")
    1026                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Qs")
    1027                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1028                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$61        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$61, DW_AT_name("Sine")
    1032                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Sine")
    1033                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1034                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$62        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$62, DW_AT_name("Cosine")
    1038                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Cosine")
    1039                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1040                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1041                      .dwendtag $C$DW$T$22
    1042              
    1043              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
    1044                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    1045                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1046              
    1047              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1048                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    1049              $C$DW$63        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1051                      .dwattr $C$DW$63, DW_AT_name("Ref")
    1052                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Ref")
    1053                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1055              $C$DW$64        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$64, DW_AT_name("Fbk")
    1058                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Fbk")
    1059                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1060                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1061              $C$DW$65        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$65, DW_AT_name("Out")
    1064                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Out")
    1065                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1066                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1067              $C$DW$66        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$66, DW_AT_name("Kp")
    1070                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Kp")
    1071                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1072                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   23

    1073              $C$DW$67        .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$67, DW_AT_name("Ki")
    1076                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ki")
    1077                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1078                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$68        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$68, DW_AT_name("Umax")
    1082                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Umax")
    1083                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1084                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$69        .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$69, DW_AT_name("Umin")
    1088                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Umin")
    1089                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1090                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$70        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$70, DW_AT_name("up")
    1094                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_up")
    1095                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1096                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$71        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$71, DW_AT_name("ui")
    1100                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_ui")
    1101                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1102                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$72        .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$72, DW_AT_name("v1")
    1106                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_v1")
    1107                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1108                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$73        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$73, DW_AT_name("i1")
    1112                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_i1")
    1113                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1114                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1115              $C$DW$74        .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$74, DW_AT_name("w1")
    1118                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_w1")
    1119                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1120                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1121                      .dwendtag $C$DW$T$23
    1122              
    1123              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    1124                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    1125                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1126              
    1127              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   24

    1128                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    1129              $C$DW$75        .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$75, DW_AT_name("Ref")
    1132                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Ref")
    1133                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$76        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$76, DW_AT_name("Fbk")
    1138                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Fbk")
    1139                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1140                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$77        .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$77, DW_AT_name("Out")
    1144                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Out")
    1145                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1146                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$78        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$78, DW_AT_name("c1")
    1150                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_c1")
    1151                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1152                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1153              $C$DW$79        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$79, DW_AT_name("c2")
    1156                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_c2")
    1157                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1158                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1159                      .dwendtag $C$DW$T$24
    1160              
    1161              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
    1162                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    1163                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1164              
    1165              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1166                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    1167              $C$DW$80        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$80, DW_AT_name("Kr")
    1170                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Kr")
    1171                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$81        .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$81, DW_AT_name("Kp")
    1176                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Kp")
    1177                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1178                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$82        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$82, DW_AT_name("Ki")
    1182                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Ki")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   25

    1183                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1184                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1185              $C$DW$83        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$83, DW_AT_name("Kd")
    1188                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Kd")
    1189                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1190                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$84        .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$84, DW_AT_name("Km")
    1194                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Km")
    1195                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1196                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$85        .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$85, DW_AT_name("Umax")
    1200                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Umax")
    1201                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1202                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$86        .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$86, DW_AT_name("Umin")
    1206                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Umin")
    1207                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1208                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1209                      .dwendtag $C$DW$T$25
    1210              
    1211              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
    1212                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    1213                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1214              
    1215              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1216                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    1217              $C$DW$87        .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$87, DW_AT_name("up")
    1220                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_up")
    1221                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$88        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$88, DW_AT_name("ui")
    1226                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ui")
    1227                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1228                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$89        .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$89, DW_AT_name("ud")
    1232                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ud")
    1233                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1234                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$90        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$90, DW_AT_name("v1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   26

    1238                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_v1")
    1239                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1240                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$91        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$91, DW_AT_name("i1")
    1244                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_i1")
    1245                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1246                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$92        .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$92, DW_AT_name("d1")
    1250                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_d1")
    1251                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1252                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$93        .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$93, DW_AT_name("d2")
    1256                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_d2")
    1257                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1258                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$94        .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$94, DW_AT_name("w1")
    1262                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_w1")
    1263                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1264                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1265                      .dwendtag $C$DW$T$26
    1266              
    1267              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
    1268                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    1269                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1270              
    1271              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1272                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    1273              $C$DW$95        .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$27)
    1275                      .dwattr $C$DW$95, DW_AT_name("term")
    1276                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_term")
    1277                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$96        .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1281                      .dwattr $C$DW$96, DW_AT_name("param")
    1282                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_param")
    1283                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1284                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$97        .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1287                      .dwattr $C$DW$97, DW_AT_name("data")
    1288                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_data")
    1289                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1290                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1291                      .dwendtag $C$DW$T$30
    1292              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   27

    1293              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
    1294                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    1295                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    1296              
    1297              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1298                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    1299              $C$DW$98        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$98, DW_AT_name("Ualpha")
    1302                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Ualpha")
    1303                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$99        .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$99, DW_AT_name("Ubeta")
    1308                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Ubeta")
    1309                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1310                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1311              $C$DW$100       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$100, DW_AT_name("Ta")
    1314                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Ta")
    1315                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1316                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$101       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$101, DW_AT_name("Tb")
    1320                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Tb")
    1321                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1322                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1323              $C$DW$102       .dwtag  DW_TAG_member
    1324                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1325                      .dwattr $C$DW$102, DW_AT_name("Tc")
    1326                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Tc")
    1327                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1328                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1329              $C$DW$103       .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$103, DW_AT_name("tmp1")
    1332                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_tmp1")
    1333                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1334                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$104       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$104, DW_AT_name("tmp2")
    1338                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_tmp2")
    1339                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1340                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$105       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$105, DW_AT_name("tmp3")
    1344                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_tmp3")
    1345                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1346                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$106       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   28

    1348                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$31)
    1349                      .dwattr $C$DW$106, DW_AT_name("VecSector")
    1350                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_VecSector")
    1351                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1352                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1353                      .dwendtag $C$DW$T$32
    1354              
    1355              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    1356                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    1357                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1358              
    1359              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1360                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    1361              $C$DW$107       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$107, DW_AT_name("TargetValue")
    1364                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_TargetValue")
    1365                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$108       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$33)
    1369                      .dwattr $C$DW$108, DW_AT_name("RampDelayMax")
    1370                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RampDelayMax")
    1371                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1372                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$109       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1375                      .dwattr $C$DW$109, DW_AT_name("RampLowLimit")
    1376                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_RampLowLimit")
    1377                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1378                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1379              $C$DW$110       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1381                      .dwattr $C$DW$110, DW_AT_name("RampHighLimit")
    1382                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_RampHighLimit")
    1383                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1384                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$111       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$33)
    1387                      .dwattr $C$DW$111, DW_AT_name("RampDelayCount")
    1388                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_RampDelayCount")
    1389                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1390                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$112       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$112, DW_AT_name("SetpointValue")
    1394                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SetpointValue")
    1395                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1396                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$113       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$33)
    1399                      .dwattr $C$DW$113, DW_AT_name("EqualFlag")
    1400                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_EqualFlag")
    1401                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1402                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   29

    1403              $C$DW$114       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$114, DW_AT_name("Tmp")
    1406                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_Tmp")
    1407                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1408                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1409                      .dwendtag $C$DW$T$34
    1410              
    1411              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    1412                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1413                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1414              
    1415              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1416                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1417              $C$DW$115       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$115, DW_AT_name("Freq")
    1420                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Freq")
    1421                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1423              $C$DW$116       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$116, DW_AT_name("StepAngleMax")
    1426                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_StepAngleMax")
    1427                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1428                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1429              $C$DW$117       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$117, DW_AT_name("Angle")
    1432                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Angle")
    1433                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1434                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$118       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$118, DW_AT_name("Gain")
    1438                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_Gain")
    1439                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1440                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$119       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$119, DW_AT_name("Out")
    1444                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_Out")
    1445                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1446                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$120       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$120, DW_AT_name("Offset")
    1450                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Offset")
    1451                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1452                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1453                      .dwendtag $C$DW$T$35
    1454              
    1455              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    1456                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1457                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   30

    1458              
    1459              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1460                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1461              $C$DW$121       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$121, DW_AT_name("DcBusVolt")
    1464                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_DcBusVolt")
    1465                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1467              $C$DW$122       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$122, DW_AT_name("MfuncV1")
    1470                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_MfuncV1")
    1471                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1472                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1473              $C$DW$123       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$123, DW_AT_name("MfuncV2")
    1476                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_MfuncV2")
    1477                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1478                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1479              $C$DW$124       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$124, DW_AT_name("MfuncV3")
    1482                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_MfuncV3")
    1483                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1484                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$125       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$31)
    1487                      .dwattr $C$DW$125, DW_AT_name("OutOfPhase")
    1488                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_OutOfPhase")
    1489                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1490                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$126       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$126, DW_AT_name("VphaseA")
    1494                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_VphaseA")
    1495                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1496                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$127       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$127, DW_AT_name("VphaseB")
    1500                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_VphaseB")
    1501                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1502                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$128       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$128, DW_AT_name("VphaseC")
    1506                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_VphaseC")
    1507                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1508                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$129       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1511                      .dwattr $C$DW$129, DW_AT_name("Valpha")
    1512                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Valpha")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   31

    1513                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1514                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$130       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1517                      .dwattr $C$DW$130, DW_AT_name("Vbeta")
    1518                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_Vbeta")
    1519                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1520                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$131       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$131, DW_AT_name("temp")
    1524                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_temp")
    1525                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1526                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1527                      .dwendtag $C$DW$T$36
    1528              
    1529              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    1530                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1531                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1532              
    1533              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1534                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1535              $C$DW$132       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$132, DW_AT_name("ElecTheta")
    1538                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ElecTheta")
    1539                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$133       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$33)
    1543                      .dwattr $C$DW$133, DW_AT_name("DirectionQep")
    1544                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_DirectionQep")
    1545                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1546                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$134       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$134, DW_AT_name("OldElecTheta")
    1550                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OldElecTheta")
    1551                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1552                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$135       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1555                      .dwattr $C$DW$135, DW_AT_name("Speed")
    1556                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_Speed")
    1557                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1558                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$136       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$33)
    1561                      .dwattr $C$DW$136, DW_AT_name("BaseRpm")
    1562                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_BaseRpm")
    1563                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1564                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$137       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$37)
    1567                      .dwattr $C$DW$137, DW_AT_name("K1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   32

    1568                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_K1")
    1569                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1570                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$138       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$138, DW_AT_name("K2")
    1574                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_K2")
    1575                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1576                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$139       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1579                      .dwattr $C$DW$139, DW_AT_name("K3")
    1580                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_K3")
    1581                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1582                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$140       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$38)
    1585                      .dwattr $C$DW$140, DW_AT_name("SpeedRpm")
    1586                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_SpeedRpm")
    1587                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1588                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$141       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1591                      .dwattr $C$DW$141, DW_AT_name("Tmp")
    1592                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_Tmp")
    1593                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1594                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1595                      .dwendtag $C$DW$T$39
    1596              
    1597              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    1598                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1599                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1600              
    1601              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1602                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1603              $C$DW$142       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$40)
    1605                      .dwattr $C$DW$142, DW_AT_name("ElecTheta")
    1606                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ElecTheta")
    1607                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$143       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$40)
    1611                      .dwattr $C$DW$143, DW_AT_name("MechTheta")
    1612                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_MechTheta")
    1613                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1614                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$144       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1617                      .dwattr $C$DW$144, DW_AT_name("DirectionQep")
    1618                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DirectionQep")
    1619                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1620                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$145       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   33

    1623                      .dwattr $C$DW$145, DW_AT_name("QepPeriod")
    1624                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_QepPeriod")
    1625                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1626                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$146       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$33)
    1629                      .dwattr $C$DW$146, DW_AT_name("QepCountIndex")
    1630                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_QepCountIndex")
    1631                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1632                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$147       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$38)
    1635                      .dwattr $C$DW$147, DW_AT_name("RawTheta")
    1636                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_RawTheta")
    1637                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1638                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$148       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$40)
    1641                      .dwattr $C$DW$148, DW_AT_name("MechScaler")
    1642                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_MechScaler")
    1643                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1644                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$149       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$31)
    1647                      .dwattr $C$DW$149, DW_AT_name("LineEncoder")
    1648                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LineEncoder")
    1649                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1650                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$150       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$31)
    1653                      .dwattr $C$DW$150, DW_AT_name("PolePairs")
    1654                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PolePairs")
    1655                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1656                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$151       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$38)
    1659                      .dwattr $C$DW$151, DW_AT_name("CalibratedAngle")
    1660                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CalibratedAngle")
    1661                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1662                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$152       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    1665                      .dwattr $C$DW$152, DW_AT_name("IndexSyncFlag")
    1666                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1667                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1668                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1669                      .dwendtag $C$DW$T$41
    1670              
    1671              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    1672                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1673                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1674              
    1675              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1676                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1677              $C$DW$153       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   34

    1678                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$42)
    1679                      .dwattr $C$DW$153, DW_AT_name("stat_reg1")
    1680                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_stat_reg1")
    1681                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$154       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$43)
    1685                      .dwattr $C$DW$154, DW_AT_name("stat_reg2")
    1686                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_stat_reg2")
    1687                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1688                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$155       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$44)
    1691                      .dwattr $C$DW$155, DW_AT_name("cntrl_reg1")
    1692                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_cntrl_reg1")
    1693                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1694                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$156       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$45)
    1697                      .dwattr $C$DW$156, DW_AT_name("cntrl_reg2")
    1698                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_cntrl_reg2")
    1699                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1700                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$157       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    1703                      .dwattr $C$DW$157, DW_AT_name("readCntrl1")
    1704                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_readCntrl1")
    1705                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1706                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$158       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1709                      .dwattr $C$DW$158, DW_AT_name("readCntrl2")
    1710                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_readCntrl2")
    1711                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1712                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$159       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1715                      .dwattr $C$DW$159, DW_AT_name("DRV_fault")
    1716                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_DRV_fault")
    1717                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1718                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1719                      .dwendtag $C$DW$T$46
    1720              
    1721              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    1722                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1723                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1724              
    1725              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1726                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1727              $C$DW$160       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1729                      .dwattr $C$DW$160, DW_AT_name("Rsvd0")
    1730                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Rsvd0")
    1731                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   35

    1733              $C$DW$161       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$47)
    1735                      .dwattr $C$DW$161, DW_AT_name("status1_wwd")
    1736                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_status1_wwd")
    1737                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1738                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1739              $C$DW$162       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$48)
    1741                      .dwattr $C$DW$162, DW_AT_name("status2_ov_vds")
    1742                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_status2_ov_vds")
    1743                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1744                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$163       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$49)
    1747                      .dwattr $C$DW$163, DW_AT_name("status3_IC")
    1748                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_status3_IC")
    1749                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1750                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$164       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$50)
    1753                      .dwattr $C$DW$164, DW_AT_name("status4_gd_Vgs")
    1754                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1755                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1756                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$165       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$51)
    1759                      .dwattr $C$DW$165, DW_AT_name("cntrl5_hs_gd")
    1760                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1761                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1762                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$166       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$52)
    1765                      .dwattr $C$DW$166, DW_AT_name("cntrl6_ls_gd")
    1766                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1767                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1768                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$167       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$53)
    1771                      .dwattr $C$DW$167, DW_AT_name("cntrl7_gd")
    1772                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_cntrl7_gd")
    1773                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1774                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$168       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1777                      .dwattr $C$DW$168, DW_AT_name("Rsvd8")
    1778                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_Rsvd8")
    1779                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1780                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1781              $C$DW$169       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$54)
    1783                      .dwattr $C$DW$169, DW_AT_name("cntrl9_IC_ops")
    1784                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1785                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1786                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$170       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   36

    1788                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$55)
    1789                      .dwattr $C$DW$170, DW_AT_name("cntrlA_shunt_amp")
    1790                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1791                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1792                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$171       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$56)
    1795                      .dwattr $C$DW$171, DW_AT_name("cntrlB_Vreg")
    1796                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1797                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1798                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1799              $C$DW$172       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$57)
    1801                      .dwattr $C$DW$172, DW_AT_name("cntrlC_Vds_SNS")
    1802                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1803                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1804                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1805              $C$DW$173       .dwtag  DW_TAG_member
    1806                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    1807                      .dwattr $C$DW$173, DW_AT_name("readCntrl5")
    1808                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_readCntrl5")
    1809                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1810                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1811              $C$DW$174       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    1813                      .dwattr $C$DW$174, DW_AT_name("readCntrl6")
    1814                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_readCntrl6")
    1815                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1816                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1817              $C$DW$175       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$31)
    1819                      .dwattr $C$DW$175, DW_AT_name("readCntrl7")
    1820                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_readCntrl7")
    1821                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1822                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1823              $C$DW$176       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    1825                      .dwattr $C$DW$176, DW_AT_name("readCntrl9")
    1826                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_readCntrl9")
    1827                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1828                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$177       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1831                      .dwattr $C$DW$177, DW_AT_name("readCntrlA")
    1832                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_readCntrlA")
    1833                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1834                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$178       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1837                      .dwattr $C$DW$178, DW_AT_name("readCntrlB")
    1838                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_readCntrlB")
    1839                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1840                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1841              $C$DW$179       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   37

    1843                      .dwattr $C$DW$179, DW_AT_name("readCntrlC")
    1844                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_readCntrlC")
    1845                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1846                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1847              $C$DW$180       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
    1849                      .dwattr $C$DW$180, DW_AT_name("DRV_fault")
    1850                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_DRV_fault")
    1851                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1852                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1853                      .dwendtag $C$DW$T$58
    1854              
    1855              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    1856                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1857                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1858              
    1859              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1860                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x14c)
    1861              $C$DW$181       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$60)
    1863                      .dwattr $C$DW$181, DW_AT_name("PwmARegs")
    1864                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PwmARegs")
    1865                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$182       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$60)
    1869                      .dwattr $C$DW$182, DW_AT_name("PwmBRegs")
    1870                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PwmBRegs")
    1871                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1872                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$183       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$60)
    1875                      .dwattr $C$DW$183, DW_AT_name("PwmCRegs")
    1876                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PwmCRegs")
    1877                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1878                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$184       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$62)
    1881                      .dwattr $C$DW$184, DW_AT_name("QepRegs")
    1882                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_QepRegs")
    1883                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1884                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$185       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$64)
    1887                      .dwattr $C$DW$185, DW_AT_name("SpiRegs")
    1888                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SpiRegs")
    1889                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1890                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$186       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1893                      .dwattr $C$DW$186, DW_AT_name("drvScsPin")
    1894                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_drvScsPin")
    1895                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1896                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$187       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   38

    1898                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1899                      .dwattr $C$DW$187, DW_AT_name("offset_shntA")
    1900                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_offset_shntA")
    1901                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1902                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$188       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$188, DW_AT_name("offset_shntB")
    1906                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_offset_shntB")
    1907                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1908                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$189       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$189, DW_AT_name("offset_shntC")
    1912                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_offset_shntC")
    1913                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1914                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$190       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$190, DW_AT_name("VdTesting")
    1918                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_VdTesting")
    1919                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1920                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$191       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1923                      .dwattr $C$DW$191, DW_AT_name("VqTesting")
    1924                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_VqTesting")
    1925                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1926                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$192       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$192, DW_AT_name("IdRef")
    1930                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_IdRef")
    1931                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1932                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$193       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1935                      .dwattr $C$DW$193, DW_AT_name("IqRef")
    1936                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_IqRef")
    1937                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1938                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$194       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$194, DW_AT_name("SpeedRef")
    1942                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SpeedRef")
    1943                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1944                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$195       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$195, DW_AT_name("ElecTheta")
    1948                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ElecTheta")
    1949                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1950                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$196       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   39

    1953                      .dwattr $C$DW$196, DW_AT_name("MechTheta")
    1954                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_MechTheta")
    1955                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1956                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$197       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$40)
    1959                      .dwattr $C$DW$197, DW_AT_name("currentAs")
    1960                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_currentAs")
    1961                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1962                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$198       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$40)
    1965                      .dwattr $C$DW$198, DW_AT_name("currentBs")
    1966                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_currentBs")
    1967                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1968                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$199       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$40)
    1971                      .dwattr $C$DW$199, DW_AT_name("currentCs")
    1972                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_currentCs")
    1973                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1974                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$200       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$38)
    1977                      .dwattr $C$DW$200, DW_AT_name("alignCntr")
    1978                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_alignCntr")
    1979                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1980                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$201       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$38)
    1983                      .dwattr $C$DW$201, DW_AT_name("alignCnt")
    1984                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_alignCnt")
    1985                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1986                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$202       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$31)
    1989                      .dwattr $C$DW$202, DW_AT_name("lsw")
    1990                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_lsw")
    1991                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1992                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$203       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$31)
    1995                      .dwattr $C$DW$203, DW_AT_name("TripFlagDMC")
    1996                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_TripFlagDMC")
    1997                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1998                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$204       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$31)
    2001                      .dwattr $C$DW$204, DW_AT_name("clearTripFlagDMC")
    2002                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    2003                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2004                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2005              $C$DW$205       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$31)
    2007                      .dwattr $C$DW$205, DW_AT_name("RunMotor")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   40

    2008                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_RunMotor")
    2009                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    2010                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$206       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$31)
    2013                      .dwattr $C$DW$206, DW_AT_name("SpeedLoopPrescaler")
    2014                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
    2015                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2016                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$207       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$31)
    2019                      .dwattr $C$DW$207, DW_AT_name("SpeedLoopCount")
    2020                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SpeedLoopCount")
    2021                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    2022                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$208       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$31)
    2025                      .dwattr $C$DW$208, DW_AT_name("PosSenseReverse")
    2026                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_PosSenseReverse")
    2027                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2028                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2029              $C$DW$209       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$31)
    2031                      .dwattr $C$DW$209, DW_AT_name("newCmdDRV")
    2032                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_newCmdDRV")
    2033                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2034                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$210       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$40)
    2037                      .dwattr $C$DW$210, DW_AT_name("T")
    2038                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_T")
    2039                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2040                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$211       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$65)
    2043                      .dwattr $C$DW$211, DW_AT_name("clarke")
    2044                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_clarke")
    2045                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2046                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$212       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$66)
    2049                      .dwattr $C$DW$212, DW_AT_name("park")
    2050                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_park")
    2051                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2052                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2053              $C$DW$213       .dwtag  DW_TAG_member
    2054                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$67)
    2055                      .dwattr $C$DW$213, DW_AT_name("ipark")
    2056                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ipark")
    2057                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    2058                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$214       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$68)
    2061                      .dwattr $C$DW$214, DW_AT_name("pi_pos")
    2062                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_pi_pos")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:04 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8305.asm                                                          PAGE   41

    2063                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    2064                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$215       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$69)
    2067                      .dwattr $C$DW$215, DW_AT_name("pid_spd")
    2068                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_pid_spd")
    2069                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2070                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2071              $C$DW$216       .dwtag  DW_TAG_member
    2072                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$68)
