TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:25:59 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../motors/HAL/drv8301.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("DRV8301_SPI_Read")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DRV8301_SPI_Read")

     427                      .dwcfi  cfa_offset, -4
     428              $C$DW$25        .dwtag  DW_TAG_variable, DW_AT_name("motor")
     429                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_motor")
     430                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$281)
     431                      .dwattr $C$DW$25, DW_AT_location[DW_OP_breg20 -2]
     432 000000d8 A842          MOVL      *-SP[2],XAR4          ; [CPU_] |132| 
     433                      .dwpsn  file "../motors/HAL/drv8301.c",line 134,column 2,is_stmt,isa 0
     434 000000d9 9A00          MOVB      AL,#0                 ; [CPU_] |134| 
     435              $C$DW$26        .dwtag  DW_TAG_TI_branch
     436                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     437                      .dwattr $C$DW$26, DW_AT_name("_DRV8301_SPI_Read")
     438                      .dwattr $C$DW$26, DW_AT_TI_call
     439 000000da 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_] |134| 
         000000db 0000 
     440                      ; call occurs [#_DRV8301_SPI_Read] ; [] |134| 
     441 000000dc 88A9          MOVZ      AR6,AL                ; [CPU_] |134| 
     442 000000dd 8F00          MOVL      XAR4,#304             ; [CPU_U] |134| 
         000000de 0130 
     443 000000df A8A9          MOVL      ACC,XAR4              ; [CPU_] |134| 
     444 000000e0 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |134| 
     445 000000e1 8AA9          MOVL      XAR4,ACC              ; [CPU_] |134| 
     446 000000e2 7EC4          MOV       *+XAR4[0],AR6         ; [CPU_] |134| 
     447                      .dwpsn  file "../motors/HAL/drv8301.c",line 137,column 2,is_stmt,isa 0
     448 000000e3 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |137| 
     449 000000e4 9A01          MOVB      AL,#1                 ; [CPU_] |137| 
     450              $C$DW$27        .dwtag  DW_TAG_TI_branch
     451                      .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     452                      .dwattr $C$DW$27, DW_AT_name("_DRV8301_SPI_Read")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   10

     453                      .dwattr $C$DW$27, DW_AT_TI_call
     454 000000e5 7640!         LCR       #_DRV8301_SPI_Read    ; [CPU_] |137| 
         000000e6 0000 
     455                      ; call occurs [#_DRV8301_SPI_Read] ; [] |137| 
     456 000000e7 9080          ANDB      AL,#128               ; [CPU_] |137| 
     457 000000e8 8F00          MOVL      XAR4,#305             ; [CPU_U] |137| 
         000000e9 0131 
     458 000000ea 88A9          MOVZ      AR6,AL                ; [CPU_] |137| 
     459 000000eb A8A9          MOVL      ACC,XAR4              ; [CPU_] |137| 
     460 000000ec 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |137| 
     461 000000ed 8AA9          MOVL      XAR4,ACC              ; [CPU_] |137| 
     462 000000ee 7EC4          MOV       *+XAR4[0],AR6         ; [CPU_] |137| 
     463                      .dwpsn  file "../motors/HAL/drv8301.c",line 139,column 2,is_stmt,isa 0
     464                      .dwpsn  file "../motors/HAL/drv8301.c",line 144,column 2,is_stmt,isa 0
     465 000000ef 8F00          MOVL      XAR4,#305             ; [CPU_U] |144| 
         000000f0 0131 
     466 000000f1 A8A9          MOVL      ACC,XAR4              ; [CPU_] |144| 
     467 000000f2 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |144| 
     468 000000f3 8AA9          MOVL      XAR4,ACC              ; [CPU_] |144| 
     469 000000f4 92C4          MOV       AL,*+XAR4[0]          ; [CPU_] |144| 
     470 000000f5 ED01          BF        $C$L7,NEQ             ; [CPU_] |144| 
     471                      ; branchcc occurs ; [] |144| 
     472                      .dwpsn  file "../motors/HAL/drv8301.c",line 149,column 2,is_stmt,isa 0
     473 000000f6       $C$L7:    
     474                      .dwpsn  file "../motors/HAL/drv8301.c",line 150,column 1,is_stmt,isa 0
     475 000000f6 FE82          SUBB      SP,#2                 ; [CPU_U] 
     476                      .dwcfi  cfa_offset, -2
     477              $C$DW$28        .dwtag  DW_TAG_TI_branch
     478                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     479                      .dwattr $C$DW$28, DW_AT_TI_return
     480 000000f7 0006          LRETR     ; [CPU_] 
     481                      ; return occurs ; [] 
     482                      .dwattr $C$DW$23, DW_AT_TI_end_file("../motors/HAL/drv8301.c")
     483                      .dwattr $C$DW$23, DW_AT_TI_end_line(0x96)
     484                      .dwattr $C$DW$23, DW_AT_TI_end_column(0x01)
     485                      .dwendentry
     486                      .dwendtag $C$DW$23
     487              
     488              ;**************************************************************
     489              ;* UNDEFINED EXTERNAL REFERENCES                              *
     490              ;**************************************************************
     491                      .global _DRV8301_SPI_Read
     492                      .global _DRV8301_SPI_Write
     493              
     494              ;***************************************************************
     495              ;* TYPE INFORMATION                                            *
     496              ;***************************************************************
     497              
     498              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     499                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     500              $C$DW$29        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     502                      .dwattr $C$DW$29, DW_AT_name("As")
     503                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_As")
     504                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   11

     505                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     506              $C$DW$30        .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     508                      .dwattr $C$DW$30, DW_AT_name("Bs")
     509                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_Bs")
     510                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     511                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     512              $C$DW$31        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     514                      .dwattr $C$DW$31, DW_AT_name("Cs")
     515                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_Cs")
     516                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     517                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     518              $C$DW$32        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$32, DW_AT_name("Alpha")
     521                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_Alpha")
     522                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     523                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     524              $C$DW$33        .dwtag  DW_TAG_member
     525                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     526                      .dwattr $C$DW$33, DW_AT_name("Beta")
     527                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_Beta")
     528                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     529                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     530                      .dwendtag $C$DW$T$20
     531              
     532              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
     533                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     534                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     535              
     536              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     537                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     538              $C$DW$34        .dwtag  DW_TAG_member
     539                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     540                      .dwattr $C$DW$34, DW_AT_name("Alpha")
     541                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_Alpha")
     542                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     544              $C$DW$35        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     546                      .dwattr $C$DW$35, DW_AT_name("Beta")
     547                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_Beta")
     548                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     549                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     550              $C$DW$36        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     552                      .dwattr $C$DW$36, DW_AT_name("Angle")
     553                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_Angle")
     554                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     555                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     556              $C$DW$37        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$37, DW_AT_name("Ds")
     559                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_Ds")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   12

     560                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     561                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     562              $C$DW$38        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$38, DW_AT_name("Qs")
     565                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_Qs")
     566                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     567                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     568              $C$DW$39        .dwtag  DW_TAG_member
     569                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     570                      .dwattr $C$DW$39, DW_AT_name("Sine")
     571                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_Sine")
     572                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     573                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     574              $C$DW$40        .dwtag  DW_TAG_member
     575                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     576                      .dwattr $C$DW$40, DW_AT_name("Cosine")
     577                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_Cosine")
     578                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     579                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     580                      .dwendtag $C$DW$T$21
     581              
     582              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
     583                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     584                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     585              
     586              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     587                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     588              $C$DW$41        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     590                      .dwattr $C$DW$41, DW_AT_name("Alpha")
     591                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_Alpha")
     592                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     594              $C$DW$42        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$42, DW_AT_name("Beta")
     597                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_Beta")
     598                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     599                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     600              $C$DW$43        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$43, DW_AT_name("Angle")
     603                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_Angle")
     604                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     605                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     606              $C$DW$44        .dwtag  DW_TAG_member
     607                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     608                      .dwattr $C$DW$44, DW_AT_name("Ds")
     609                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_Ds")
     610                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     611                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$45        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$45, DW_AT_name("Qs")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   13

     615                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_Qs")
     616                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     617                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     618              $C$DW$46        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$46, DW_AT_name("Sine")
     621                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Sine")
     622                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     623                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     624              $C$DW$47        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$47, DW_AT_name("Cosine")
     627                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_Cosine")
     628                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     629                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     630                      .dwendtag $C$DW$T$22
     631              
     632              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
     633                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     634                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     635              
     636              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     637                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     638              $C$DW$48        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$48, DW_AT_name("Ref")
     641                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_Ref")
     642                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     644              $C$DW$49        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     646                      .dwattr $C$DW$49, DW_AT_name("Fbk")
     647                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_Fbk")
     648                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     649                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     650              $C$DW$50        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     652                      .dwattr $C$DW$50, DW_AT_name("Out")
     653                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_Out")
     654                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     655                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     656              $C$DW$51        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$51, DW_AT_name("Kp")
     659                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_Kp")
     660                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     661                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     662              $C$DW$52        .dwtag  DW_TAG_member
     663                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     664                      .dwattr $C$DW$52, DW_AT_name("Ki")
     665                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_Ki")
     666                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     667                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     668              $C$DW$53        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   14

     670                      .dwattr $C$DW$53, DW_AT_name("Umax")
     671                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Umax")
     672                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     673                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     674              $C$DW$54        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     676                      .dwattr $C$DW$54, DW_AT_name("Umin")
     677                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Umin")
     678                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     679                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     680              $C$DW$55        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$55, DW_AT_name("up")
     683                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_up")
     684                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     685                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     686              $C$DW$56        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$56, DW_AT_name("ui")
     689                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ui")
     690                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     691                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$57        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$57, DW_AT_name("v1")
     695                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_v1")
     696                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     697                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$58        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$58, DW_AT_name("i1")
     701                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_i1")
     702                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     703                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$59        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$59, DW_AT_name("w1")
     707                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_w1")
     708                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     709                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     710                      .dwendtag $C$DW$T$23
     711              
     712              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
     713                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     714                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     715              
     716              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     717                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     718              $C$DW$60        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$60, DW_AT_name("Ref")
     721                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Ref")
     722                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     724              $C$DW$61        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   15

     725                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$61, DW_AT_name("Fbk")
     727                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Fbk")
     728                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     729                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     730              $C$DW$62        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$62, DW_AT_name("Out")
     733                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Out")
     734                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     735                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     736              $C$DW$63        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$63, DW_AT_name("c1")
     739                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_c1")
     740                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     741                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     742              $C$DW$64        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$64, DW_AT_name("c2")
     745                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_c2")
     746                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     747                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     748                      .dwendtag $C$DW$T$24
     749              
     750              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
     751                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     752                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     753              
     754              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     755                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     756              $C$DW$65        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$65, DW_AT_name("Kr")
     759                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Kr")
     760                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     762              $C$DW$66        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     764                      .dwattr $C$DW$66, DW_AT_name("Kp")
     765                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Kp")
     766                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     767                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     768              $C$DW$67        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$67, DW_AT_name("Ki")
     771                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Ki")
     772                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     773                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     774              $C$DW$68        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$68, DW_AT_name("Kd")
     777                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Kd")
     778                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     779                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   16

     780              $C$DW$69        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$69, DW_AT_name("Km")
     783                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Km")
     784                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     785                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     786              $C$DW$70        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$70, DW_AT_name("Umax")
     789                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Umax")
     790                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     791                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$71        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$71, DW_AT_name("Umin")
     795                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Umin")
     796                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     797                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     798                      .dwendtag $C$DW$T$25
     799              
     800              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
     801                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
     802                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     803              
     804              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     805                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     806              $C$DW$72        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     808                      .dwattr $C$DW$72, DW_AT_name("up")
     809                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_up")
     810                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$73        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$73, DW_AT_name("ui")
     815                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ui")
     816                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     817                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$74        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$74, DW_AT_name("ud")
     821                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ud")
     822                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     823                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$75        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$75, DW_AT_name("v1")
     827                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_v1")
     828                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     829                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     830              $C$DW$76        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$76, DW_AT_name("i1")
     833                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_i1")
     834                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   17

     835                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     836              $C$DW$77        .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     838                      .dwattr $C$DW$77, DW_AT_name("d1")
     839                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_d1")
     840                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     841                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     842              $C$DW$78        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$78, DW_AT_name("d2")
     845                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_d2")
     846                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     847                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     848              $C$DW$79        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     850                      .dwattr $C$DW$79, DW_AT_name("w1")
     851                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_w1")
     852                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     853                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     854                      .dwendtag $C$DW$T$26
     855              
     856              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
     857                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     858                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     859              
     860              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     861                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
     862              $C$DW$80        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$27)
     864                      .dwattr $C$DW$80, DW_AT_name("term")
     865                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_term")
     866                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$81        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
     870                      .dwattr $C$DW$81, DW_AT_name("param")
     871                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_param")
     872                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     873                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$82        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     876                      .dwattr $C$DW$82, DW_AT_name("data")
     877                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_data")
     878                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     879                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     880                      .dwendtag $C$DW$T$30
     881              
     882              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
     883                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
     884                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     885              
     886              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     887                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
     888              $C$DW$83        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   18

     890                      .dwattr $C$DW$83, DW_AT_name("Ualpha")
     891                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Ualpha")
     892                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$84        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$84, DW_AT_name("Ubeta")
     897                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ubeta")
     898                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     899                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     900              $C$DW$85        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$85, DW_AT_name("Ta")
     903                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Ta")
     904                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     905                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     906              $C$DW$86        .dwtag  DW_TAG_member
     907                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     908                      .dwattr $C$DW$86, DW_AT_name("Tb")
     909                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Tb")
     910                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     911                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$87        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$87, DW_AT_name("Tc")
     915                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Tc")
     916                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     917                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     918              $C$DW$88        .dwtag  DW_TAG_member
     919                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     920                      .dwattr $C$DW$88, DW_AT_name("tmp1")
     921                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_tmp1")
     922                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     923                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$89        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$89, DW_AT_name("tmp2")
     927                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_tmp2")
     928                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     929                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$90        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$90, DW_AT_name("tmp3")
     933                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_tmp3")
     934                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     935                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     936              $C$DW$91        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$31)
     938                      .dwattr $C$DW$91, DW_AT_name("VecSector")
     939                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_VecSector")
     940                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     941                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     942                      .dwendtag $C$DW$T$32
     943              
     944              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   19

     945                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
     946                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
     947              
     948              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     949                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
     950              $C$DW$92        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$92, DW_AT_name("TargetValue")
     953                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_TargetValue")
     954                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$93        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$33)
     958                      .dwattr $C$DW$93, DW_AT_name("RampDelayMax")
     959                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_RampDelayMax")
     960                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     961                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$94        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$94, DW_AT_name("RampLowLimit")
     965                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RampLowLimit")
     966                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     967                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$95        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$95, DW_AT_name("RampHighLimit")
     971                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_RampHighLimit")
     972                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     973                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     974              $C$DW$96        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
     976                      .dwattr $C$DW$96, DW_AT_name("RampDelayCount")
     977                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_RampDelayCount")
     978                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     979                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     980              $C$DW$97        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$97, DW_AT_name("SetpointValue")
     983                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SetpointValue")
     984                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     985                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$98        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$33)
     988                      .dwattr $C$DW$98, DW_AT_name("EqualFlag")
     989                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_EqualFlag")
     990                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     991                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     992              $C$DW$99        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$99, DW_AT_name("Tmp")
     995                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Tmp")
     996                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     997                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     998                      .dwendtag $C$DW$T$34
     999              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   20

    1000              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    1001                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1002                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1003              
    1004              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1005                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1006              $C$DW$100       .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1008                      .dwattr $C$DW$100, DW_AT_name("Freq")
    1009                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Freq")
    1010                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$101       .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$101, DW_AT_name("StepAngleMax")
    1015                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_StepAngleMax")
    1016                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1017                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$102       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1020                      .dwattr $C$DW$102, DW_AT_name("Angle")
    1021                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Angle")
    1022                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1023                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$103       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$103, DW_AT_name("Gain")
    1027                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Gain")
    1028                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1029                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$104       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$104, DW_AT_name("Out")
    1033                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Out")
    1034                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1035                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$105       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$105, DW_AT_name("Offset")
    1039                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Offset")
    1040                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1041                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1042                      .dwendtag $C$DW$T$35
    1043              
    1044              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    1045                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1046                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1047              
    1048              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1049                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1050              $C$DW$106       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$106, DW_AT_name("DcBusVolt")
    1053                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_DcBusVolt")
    1054                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   21

    1055                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$107       .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$107, DW_AT_name("MfuncV1")
    1059                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_MfuncV1")
    1060                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1061                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$108       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$108, DW_AT_name("MfuncV2")
    1065                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_MfuncV2")
    1066                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1067                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$109       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$109, DW_AT_name("MfuncV3")
    1071                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_MfuncV3")
    1072                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1073                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1074              $C$DW$110       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$31)
    1076                      .dwattr $C$DW$110, DW_AT_name("OutOfPhase")
    1077                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OutOfPhase")
    1078                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1079                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1080              $C$DW$111       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$111, DW_AT_name("VphaseA")
    1083                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_VphaseA")
    1084                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1085                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$112       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$112, DW_AT_name("VphaseB")
    1089                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_VphaseB")
    1090                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1091                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$113       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$113, DW_AT_name("VphaseC")
    1095                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_VphaseC")
    1096                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1097                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$114       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$114, DW_AT_name("Valpha")
    1101                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_Valpha")
    1102                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1103                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$115       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$115, DW_AT_name("Vbeta")
    1107                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_Vbeta")
    1108                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1109                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   22

    1110              $C$DW$116       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$116, DW_AT_name("temp")
    1113                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_temp")
    1114                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1115                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1116                      .dwendtag $C$DW$T$36
    1117              
    1118              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    1119                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1120                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1121              
    1122              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1123                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1124              $C$DW$117       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$117, DW_AT_name("ElecTheta")
    1127                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_ElecTheta")
    1128                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1130              $C$DW$118       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$33)
    1132                      .dwattr $C$DW$118, DW_AT_name("DirectionQep")
    1133                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_DirectionQep")
    1134                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1135                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1136              $C$DW$119       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$119, DW_AT_name("OldElecTheta")
    1139                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_OldElecTheta")
    1140                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1141                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1142              $C$DW$120       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$120, DW_AT_name("Speed")
    1145                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_Speed")
    1146                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1147                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1148              $C$DW$121       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1150                      .dwattr $C$DW$121, DW_AT_name("BaseRpm")
    1151                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_BaseRpm")
    1152                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1153                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1154              $C$DW$122       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$37)
    1156                      .dwattr $C$DW$122, DW_AT_name("K1")
    1157                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_K1")
    1158                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1159                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1160              $C$DW$123       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$123, DW_AT_name("K2")
    1163                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_K2")
    1164                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   23

    1165                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1166              $C$DW$124       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$124, DW_AT_name("K3")
    1169                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_K3")
    1170                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1171                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1172              $C$DW$125       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$38)
    1174                      .dwattr $C$DW$125, DW_AT_name("SpeedRpm")
    1175                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SpeedRpm")
    1176                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1177                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1178              $C$DW$126       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$126, DW_AT_name("Tmp")
    1181                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Tmp")
    1182                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1183                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1184                      .dwendtag $C$DW$T$39
    1185              
    1186              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    1187                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1188                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1189              
    1190              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1191                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1192              $C$DW$127       .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$40)
    1194                      .dwattr $C$DW$127, DW_AT_name("ElecTheta")
    1195                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ElecTheta")
    1196                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$128       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$40)
    1200                      .dwattr $C$DW$128, DW_AT_name("MechTheta")
    1201                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_MechTheta")
    1202                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1203                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1204              $C$DW$129       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$31)
    1206                      .dwattr $C$DW$129, DW_AT_name("DirectionQep")
    1207                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_DirectionQep")
    1208                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1209                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1210              $C$DW$130       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$31)
    1212                      .dwattr $C$DW$130, DW_AT_name("QepPeriod")
    1213                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_QepPeriod")
    1214                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1215                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$131       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    1218                      .dwattr $C$DW$131, DW_AT_name("QepCountIndex")
    1219                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_QepCountIndex")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   24

    1220                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1221                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$132       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$38)
    1224                      .dwattr $C$DW$132, DW_AT_name("RawTheta")
    1225                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_RawTheta")
    1226                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1227                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$133       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$40)
    1230                      .dwattr $C$DW$133, DW_AT_name("MechScaler")
    1231                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MechScaler")
    1232                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1233                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1234              $C$DW$134       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    1236                      .dwattr $C$DW$134, DW_AT_name("LineEncoder")
    1237                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_LineEncoder")
    1238                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1239                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$135       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$31)
    1242                      .dwattr $C$DW$135, DW_AT_name("PolePairs")
    1243                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PolePairs")
    1244                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1245                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$136       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$38)
    1248                      .dwattr $C$DW$136, DW_AT_name("CalibratedAngle")
    1249                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CalibratedAngle")
    1250                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1251                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1252              $C$DW$137       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$31)
    1254                      .dwattr $C$DW$137, DW_AT_name("IndexSyncFlag")
    1255                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1256                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1257                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1258                      .dwendtag $C$DW$T$41
    1259              
    1260              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    1261                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    1262                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1263              
    1264              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1265                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1266              $C$DW$138       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$42)
    1268                      .dwattr $C$DW$138, DW_AT_name("stat_reg1")
    1269                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_stat_reg1")
    1270                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$139       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$43)
    1274                      .dwattr $C$DW$139, DW_AT_name("stat_reg2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   25

    1275                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_stat_reg2")
    1276                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1277                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$140       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$44)
    1280                      .dwattr $C$DW$140, DW_AT_name("cntrl_reg1")
    1281                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_cntrl_reg1")
    1282                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1283                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$141       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$45)
    1286                      .dwattr $C$DW$141, DW_AT_name("cntrl_reg2")
    1287                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_cntrl_reg2")
    1288                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1289                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1290              $C$DW$142       .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$31)
    1292                      .dwattr $C$DW$142, DW_AT_name("readCntrl1")
    1293                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_readCntrl1")
    1294                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1295                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$143       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$31)
    1298                      .dwattr $C$DW$143, DW_AT_name("readCntrl2")
    1299                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_readCntrl2")
    1300                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1301                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1302              $C$DW$144       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1304                      .dwattr $C$DW$144, DW_AT_name("DRV_fault")
    1305                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_DRV_fault")
    1306                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1307                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1308                      .dwendtag $C$DW$T$46
    1309              
    1310              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    1311                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1312                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1313              
    1314              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1315                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1316              $C$DW$145       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$31)
    1318                      .dwattr $C$DW$145, DW_AT_name("Rsvd0")
    1319                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_Rsvd0")
    1320                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$146       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$47)
    1324                      .dwattr $C$DW$146, DW_AT_name("status1_wwd")
    1325                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_status1_wwd")
    1326                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1327                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1328              $C$DW$147       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$48)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   26

    1330                      .dwattr $C$DW$147, DW_AT_name("status2_ov_vds")
    1331                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_status2_ov_vds")
    1332                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1333                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$148       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$49)
    1336                      .dwattr $C$DW$148, DW_AT_name("status3_IC")
    1337                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_status3_IC")
    1338                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1339                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$149       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$50)
    1342                      .dwattr $C$DW$149, DW_AT_name("status4_gd_Vgs")
    1343                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1344                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1345                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1346              $C$DW$150       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$51)
    1348                      .dwattr $C$DW$150, DW_AT_name("cntrl5_hs_gd")
    1349                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1350                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1351                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$151       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$52)
    1354                      .dwattr $C$DW$151, DW_AT_name("cntrl6_ls_gd")
    1355                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1356                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1357                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1358              $C$DW$152       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$53)
    1360                      .dwattr $C$DW$152, DW_AT_name("cntrl7_gd")
    1361                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_cntrl7_gd")
    1362                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1363                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$153       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1366                      .dwattr $C$DW$153, DW_AT_name("Rsvd8")
    1367                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Rsvd8")
    1368                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1369                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$154       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$54)
    1372                      .dwattr $C$DW$154, DW_AT_name("cntrl9_IC_ops")
    1373                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1374                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1375                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$155       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$55)
    1378                      .dwattr $C$DW$155, DW_AT_name("cntrlA_shunt_amp")
    1379                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1380                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1381                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$156       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$56)
    1384                      .dwattr $C$DW$156, DW_AT_name("cntrlB_Vreg")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   27

    1385                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1386                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1387                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$157       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$57)
    1390                      .dwattr $C$DW$157, DW_AT_name("cntrlC_Vds_SNS")
    1391                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1392                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1393                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$158       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1396                      .dwattr $C$DW$158, DW_AT_name("readCntrl5")
    1397                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_readCntrl5")
    1398                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1399                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$159       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1402                      .dwattr $C$DW$159, DW_AT_name("readCntrl6")
    1403                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_readCntrl6")
    1404                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1405                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$160       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1408                      .dwattr $C$DW$160, DW_AT_name("readCntrl7")
    1409                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_readCntrl7")
    1410                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1411                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$161       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1414                      .dwattr $C$DW$161, DW_AT_name("readCntrl9")
    1415                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_readCntrl9")
    1416                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1417                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$162       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$31)
    1420                      .dwattr $C$DW$162, DW_AT_name("readCntrlA")
    1421                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_readCntrlA")
    1422                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1423                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$163       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    1426                      .dwattr $C$DW$163, DW_AT_name("readCntrlB")
    1427                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_readCntrlB")
    1428                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1429                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$164       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$31)
    1432                      .dwattr $C$DW$164, DW_AT_name("readCntrlC")
    1433                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_readCntrlC")
    1434                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1435                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$165       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$31)
    1438                      .dwattr $C$DW$165, DW_AT_name("DRV_fault")
    1439                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DRV_fault")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   28

    1440                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1441                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1442                      .dwendtag $C$DW$T$58
    1443              
    1444              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    1445                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1446                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1447              
    1448              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1449                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x14c)
    1450              $C$DW$166       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$60)
    1452                      .dwattr $C$DW$166, DW_AT_name("PwmARegs")
    1453                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PwmARegs")
    1454                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$167       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$60)
    1458                      .dwattr $C$DW$167, DW_AT_name("PwmBRegs")
    1459                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PwmBRegs")
    1460                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1461                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$168       .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$60)
    1464                      .dwattr $C$DW$168, DW_AT_name("PwmCRegs")
    1465                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PwmCRegs")
    1466                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1467                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$169       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$62)
    1470                      .dwattr $C$DW$169, DW_AT_name("QepRegs")
    1471                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_QepRegs")
    1472                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1473                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1474              $C$DW$170       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$64)
    1476                      .dwattr $C$DW$170, DW_AT_name("SpiRegs")
    1477                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SpiRegs")
    1478                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1479                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1480              $C$DW$171       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$31)
    1482                      .dwattr $C$DW$171, DW_AT_name("drvScsPin")
    1483                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_drvScsPin")
    1484                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1485                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1486              $C$DW$172       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1488                      .dwattr $C$DW$172, DW_AT_name("offset_shntA")
    1489                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_offset_shntA")
    1490                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1491                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1492              $C$DW$173       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1494                      .dwattr $C$DW$173, DW_AT_name("offset_shntB")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   29

    1495                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_offset_shntB")
    1496                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1497                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$174       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$174, DW_AT_name("offset_shntC")
    1501                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_offset_shntC")
    1502                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1503                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1504              $C$DW$175       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1506                      .dwattr $C$DW$175, DW_AT_name("VdTesting")
    1507                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_VdTesting")
    1508                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1509                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$176       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$176, DW_AT_name("VqTesting")
    1513                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_VqTesting")
    1514                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1515                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1516              $C$DW$177       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1518                      .dwattr $C$DW$177, DW_AT_name("IdRef")
    1519                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_IdRef")
    1520                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1521                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1522              $C$DW$178       .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1524                      .dwattr $C$DW$178, DW_AT_name("IqRef")
    1525                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_IqRef")
    1526                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1527                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$179       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$179, DW_AT_name("SpeedRef")
    1531                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SpeedRef")
    1532                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1533                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1534              $C$DW$180       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1536                      .dwattr $C$DW$180, DW_AT_name("ElecTheta")
    1537                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ElecTheta")
    1538                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1539                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$181       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$181, DW_AT_name("MechTheta")
    1543                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_MechTheta")
    1544                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1545                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$182       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    1548                      .dwattr $C$DW$182, DW_AT_name("currentAs")
    1549                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_currentAs")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   30

    1550                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1551                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$183       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$40)
    1554                      .dwattr $C$DW$183, DW_AT_name("currentBs")
    1555                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_currentBs")
    1556                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1557                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$184       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    1560                      .dwattr $C$DW$184, DW_AT_name("currentCs")
    1561                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_currentCs")
    1562                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1563                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$185       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$38)
    1566                      .dwattr $C$DW$185, DW_AT_name("alignCntr")
    1567                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_alignCntr")
    1568                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1569                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$186       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$38)
    1572                      .dwattr $C$DW$186, DW_AT_name("alignCnt")
    1573                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_alignCnt")
    1574                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1575                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$187       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1578                      .dwattr $C$DW$187, DW_AT_name("lsw")
    1579                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_lsw")
    1580                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1581                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$188       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1584                      .dwattr $C$DW$188, DW_AT_name("TripFlagDMC")
    1585                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_TripFlagDMC")
    1586                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1587                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$189       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1590                      .dwattr $C$DW$189, DW_AT_name("clearTripFlagDMC")
    1591                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    1592                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1593                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$190       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$31)
    1596                      .dwattr $C$DW$190, DW_AT_name("RunMotor")
    1597                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_RunMotor")
    1598                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1599                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1600              $C$DW$191       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    1602                      .dwattr $C$DW$191, DW_AT_name("SpeedLoopPrescaler")
    1603                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
    1604                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   31

    1605                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$192       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$31)
    1608                      .dwattr $C$DW$192, DW_AT_name("SpeedLoopCount")
    1609                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_SpeedLoopCount")
    1610                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    1611                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$193       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$31)
    1614                      .dwattr $C$DW$193, DW_AT_name("PosSenseReverse")
    1615                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PosSenseReverse")
    1616                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1617                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$194       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$31)
    1620                      .dwattr $C$DW$194, DW_AT_name("newCmdDRV")
    1621                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_newCmdDRV")
    1622                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1623                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1624              $C$DW$195       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$40)
    1626                      .dwattr $C$DW$195, DW_AT_name("T")
    1627                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_T")
    1628                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1629                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$196       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$65)
    1632                      .dwattr $C$DW$196, DW_AT_name("clarke")
    1633                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_clarke")
    1634                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1635                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$197       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$66)
    1638                      .dwattr $C$DW$197, DW_AT_name("park")
    1639                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_park")
    1640                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1641                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1642              $C$DW$198       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$67)
    1644                      .dwattr $C$DW$198, DW_AT_name("ipark")
    1645                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_ipark")
    1646                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1647                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1648              $C$DW$199       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$68)
    1650                      .dwattr $C$DW$199, DW_AT_name("pi_pos")
    1651                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_pi_pos")
    1652                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1653                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1654              $C$DW$200       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$69)
    1656                      .dwattr $C$DW$200, DW_AT_name("pid_spd")
    1657                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_pid_spd")
    1658                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1659                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:00 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
drv8301.asm                                                          PAGE   32

    1660              $C$DW$201       .dwtag  DW_TAG_member
