TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:36:49 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../motors/HAL/DRV830x_SPI.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("F28x_usDelay")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_F28x_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_declaration

     521              $C$DW$50        .dwtag  DW_TAG_variable, DW_AT_name("cntrlReg")
     522                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_cntrlReg")
     523                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$294)
     524                      .dwattr $C$DW$50, DW_AT_location[DW_OP_breg20 -6]
     525 00000083 9643          MOV       *-SP[3],AL            ; [CPU_] |124| 
     526 00000084 A842          MOVL      *-SP[2],XAR4          ; [CPU_] |124| 
     527                      .dwpsn  file "../motors/HAL/DRV830x_SPI.c",line 128,column 5,is_stmt,isa 0
     528 00000085 8F00          MOVL      XAR4,#308             ; [CPU_U] |128| 
         00000086 0134 
     529 00000087 A8A9          MOVL      ACC,XAR4              ; [CPU_] |128| 
     530 00000088 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |128| 
     531 00000089 1E46          MOVL      *-SP[6],ACC           ; [CPU_] |128| 
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   11

     532                      .dwpsn  file "../motors/HAL/DRV830x_SPI.c",line 130,column 2,is_stmt,isa 0
     533 0000008a 1844          AND       *-SP[4],#0x7fff       ; [CPU_] |130| 
         0000008b 7FFF 
     534                      .dwpsn  file "../motors/HAL/DRV830x_SPI.c",line 131,column 2,is_stmt,isa 0
     535 0000008c 9243          MOV       AL,*-SP[3]            ; [CPU_] |131| 
     536 0000008d CD44          AND       AH,*-SP[4],#0x87ff    ; [CPU_] |131| 
         0000008e 87FF 
     537 0000008f 900F          ANDB      AL,#0x0f              ; [CPU_] |131| 
     538 00000090 FF8A          LSL       AL,11                 ; [CPU_] |131| 
     539 00000091 CAA8          OR        AL,AH                 ; [CPU_] |131| 
     540 00000092 9644          MOV       *-SP[4],AL            ; [CPU_] |131| 
     541                      .dwpsn  file "../motors/HAL/DRV830x_SPI.c",line 132,column 2,is_stmt,isa 0
     542 00000093 5843          MOVZ      AR0,*-SP[3]           ; [CPU_] |132| 
     543 00000094 8A46          MOVL      XAR4,*-SP[6]          ; [CPU_] |132| 
     544 00000095 CD44          AND       AH,*-SP[4],#0xf800    ; [CPU_] |132| 
         00000096 F800 
     545 00000097 CC94          AND       AL,*+XAR4[AR0],#0x07ff ; [CPU_] |132| 
         00000098 07FF 
     546 00000099 CAA8          OR        AL,AH                 ; [CPU_] |132| 
     547 0000009a 9644          MOV       *-SP[4],AL            ; [CPU_] |132| 
     548                      .dwpsn  file "../motors/HAL/DRV830x_SPI.c",line 134,column 2,is_stmt,isa 0
     549 0000009b 0208          MOVB      ACC,#8                ; [CPU_] |134| 
     550 0000009c 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |134| 
     551 0000009d 8AA9          MOVL      XAR4,ACC              ; [CPU_] |134| 
     552 0000009e 020A          MOVB      ACC,#10               ; [CPU_] |134| 
     553 0000009f 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |134| 
     554 000000a0 83A9          MOVL      XAR5,ACC              ; [CPU_] |134| 
     555 000000a1 9244          MOV       AL,*-SP[4]            ; [CPU_] |134| 
     556 000000a2 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |134| 
     557 000000a3 93C5          MOV       AH,*+XAR5[0]          ; [CPU_] |134| 
     558              $C$DW$51        .dwtag  DW_TAG_TI_branch
     559                      .dwattr $C$DW$51, DW_AT_low_pc(0x00)
     560                      .dwattr $C$DW$51, DW_AT_name("_SPI_Driver")
     561                      .dwattr $C$DW$51, DW_AT_TI_call
     562 000000a4 7640'         LCR       #_SPI_Driver          ; [CPU_] |134| 
         000000a5 0000 
     563                      ; call occurs [#_SPI_Driver] ; [] |134| 
     564                      .dwpsn  file "../motors/HAL/DRV830x_SPI.c",line 135,column 1,is_stmt,isa 0
     565 000000a6 FE86          SUBB      SP,#6                 ; [CPU_U] 
     566                      .dwcfi  cfa_offset, -2
     567              $C$DW$52        .dwtag  DW_TAG_TI_branch
     568                      .dwattr $C$DW$52, DW_AT_low_pc(0x00)
     569                      .dwattr $C$DW$52, DW_AT_TI_return
     570 000000a7 0006          LRETR     ; [CPU_] 
     571                      ; return occurs ; [] 
     572                      .dwattr $C$DW$44, DW_AT_TI_end_file("../motors/HAL/DRV830x_SPI.c")
     573                      .dwattr $C$DW$44, DW_AT_TI_end_line(0x87)
     574                      .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
     575                      .dwendentry
     576                      .dwendtag $C$DW$44
     577              
     578              ;**************************************************************
     579              ;* UNDEFINED EXTERNAL REFERENCES                              *
     580              ;**************************************************************
     581                      .global _F28x_usDelay
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   12

     582                      .global _GPIO_WritePin
     583              
     584              ;***************************************************************
     585              ;* TYPE INFORMATION                                            *
     586              ;***************************************************************
     587              
     588              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     589                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
     590              $C$DW$53        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     592                      .dwattr $C$DW$53, DW_AT_name("As")
     593                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_As")
     594                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     596              $C$DW$54        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     598                      .dwattr $C$DW$54, DW_AT_name("Bs")
     599                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_Bs")
     600                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     601                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     602              $C$DW$55        .dwtag  DW_TAG_member
     603                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     604                      .dwattr $C$DW$55, DW_AT_name("Cs")
     605                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_Cs")
     606                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     607                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     608              $C$DW$56        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$56, DW_AT_name("Alpha")
     611                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_Alpha")
     612                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     613                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     614              $C$DW$57        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$57, DW_AT_name("Beta")
     617                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_Beta")
     618                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     619                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     620                      .dwendtag $C$DW$T$20
     621              
     622              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
     623                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
     624                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
     625              
     626              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     627                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
     628              $C$DW$58        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$58, DW_AT_name("Alpha")
     631                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_Alpha")
     632                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     634              $C$DW$59        .dwtag  DW_TAG_member
     635                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     636                      .dwattr $C$DW$59, DW_AT_name("Beta")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   13

     637                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_Beta")
     638                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     639                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     640              $C$DW$60        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$60, DW_AT_name("Angle")
     643                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Angle")
     644                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     645                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     646              $C$DW$61        .dwtag  DW_TAG_member
     647                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     648                      .dwattr $C$DW$61, DW_AT_name("Ds")
     649                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_Ds")
     650                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     651                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     652              $C$DW$62        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$62, DW_AT_name("Qs")
     655                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_Qs")
     656                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     657                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     658              $C$DW$63        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     660                      .dwattr $C$DW$63, DW_AT_name("Sine")
     661                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_Sine")
     662                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     663                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     664              $C$DW$64        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     666                      .dwattr $C$DW$64, DW_AT_name("Cosine")
     667                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_Cosine")
     668                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     669                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     670                      .dwendtag $C$DW$T$21
     671              
     672              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
     673                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
     674                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     675              
     676              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     677                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
     678              $C$DW$65        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     680                      .dwattr $C$DW$65, DW_AT_name("Alpha")
     681                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_Alpha")
     682                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$66        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$66, DW_AT_name("Beta")
     687                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_Beta")
     688                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     689                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     690              $C$DW$67        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   14

     692                      .dwattr $C$DW$67, DW_AT_name("Angle")
     693                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_Angle")
     694                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     695                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     696              $C$DW$68        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$68, DW_AT_name("Ds")
     699                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_Ds")
     700                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     701                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     702              $C$DW$69        .dwtag  DW_TAG_member
     703                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     704                      .dwattr $C$DW$69, DW_AT_name("Qs")
     705                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_Qs")
     706                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     707                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     708              $C$DW$70        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$70, DW_AT_name("Sine")
     711                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_Sine")
     712                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     713                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     714              $C$DW$71        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$71, DW_AT_name("Cosine")
     717                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_Cosine")
     718                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     719                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     720                      .dwendtag $C$DW$T$22
     721              
     722              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
     723                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
     724                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     725              
     726              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     727                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
     728              $C$DW$72        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$72, DW_AT_name("Ref")
     731                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_Ref")
     732                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$73        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$73, DW_AT_name("Fbk")
     737                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_Fbk")
     738                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     739                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$74        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$74, DW_AT_name("Out")
     743                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_Out")
     744                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     745                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$75        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   15

     747                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     748                      .dwattr $C$DW$75, DW_AT_name("Kp")
     749                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Kp")
     750                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     751                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$76        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$76, DW_AT_name("Ki")
     755                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Ki")
     756                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     757                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     758              $C$DW$77        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$77, DW_AT_name("Umax")
     761                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Umax")
     762                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     763                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     764              $C$DW$78        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     766                      .dwattr $C$DW$78, DW_AT_name("Umin")
     767                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Umin")
     768                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     769                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$79        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$79, DW_AT_name("up")
     773                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_up")
     774                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     775                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     776              $C$DW$80        .dwtag  DW_TAG_member
     777                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     778                      .dwattr $C$DW$80, DW_AT_name("ui")
     779                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ui")
     780                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     781                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$81        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$81, DW_AT_name("v1")
     785                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_v1")
     786                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     787                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     788              $C$DW$82        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$82, DW_AT_name("i1")
     791                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_i1")
     792                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     793                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     794              $C$DW$83        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     796                      .dwattr $C$DW$83, DW_AT_name("w1")
     797                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_w1")
     798                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     799                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     800                      .dwendtag $C$DW$T$23
     801              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   16

     802              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
     803                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
     804                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
     805              
     806              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     807                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
     808              $C$DW$84        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$84, DW_AT_name("Ref")
     811                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Ref")
     812                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     814              $C$DW$85        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     816                      .dwattr $C$DW$85, DW_AT_name("Fbk")
     817                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Fbk")
     818                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     819                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     820              $C$DW$86        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$86, DW_AT_name("Out")
     823                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Out")
     824                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     825                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$87        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$87, DW_AT_name("c1")
     829                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_c1")
     830                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     831                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$88        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$88, DW_AT_name("c2")
     835                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_c2")
     836                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     837                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     838                      .dwendtag $C$DW$T$24
     839              
     840              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
     841                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
     842                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     843              
     844              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     845                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
     846              $C$DW$89        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$89, DW_AT_name("Kr")
     849                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Kr")
     850                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$90        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$90, DW_AT_name("Kp")
     855                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Kp")
     856                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   17

     857                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     858              $C$DW$91        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$91, DW_AT_name("Ki")
     861                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Ki")
     862                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     863                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$92        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$92, DW_AT_name("Kd")
     867                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Kd")
     868                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     869                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     870              $C$DW$93        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$93, DW_AT_name("Km")
     873                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Km")
     874                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     875                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     876              $C$DW$94        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$94, DW_AT_name("Umax")
     879                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Umax")
     880                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     881                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$95        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$95, DW_AT_name("Umin")
     885                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Umin")
     886                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     887                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     888                      .dwendtag $C$DW$T$25
     889              
     890              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
     891                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
     892                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
     893              
     894              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     895                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
     896              $C$DW$96        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$96, DW_AT_name("up")
     899                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_up")
     900                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$97        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$97, DW_AT_name("ui")
     905                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ui")
     906                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     907                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$98        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$98, DW_AT_name("ud")
     911                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_ud")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   18

     912                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     913                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     914              $C$DW$99        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$99, DW_AT_name("v1")
     917                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_v1")
     918                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     919                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     920              $C$DW$100       .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$100, DW_AT_name("i1")
     923                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_i1")
     924                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     925                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     926              $C$DW$101       .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$101, DW_AT_name("d1")
     929                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_d1")
     930                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     931                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     932              $C$DW$102       .dwtag  DW_TAG_member
     933                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     934                      .dwattr $C$DW$102, DW_AT_name("d2")
     935                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_d2")
     936                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     937                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     938              $C$DW$103       .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$103, DW_AT_name("w1")
     941                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_w1")
     942                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     943                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     944                      .dwendtag $C$DW$T$26
     945              
     946              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
     947                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
     948                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     949              
     950              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     951                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
     952              $C$DW$104       .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
     954                      .dwattr $C$DW$104, DW_AT_name("term")
     955                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_term")
     956                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$105       .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
     960                      .dwattr $C$DW$105, DW_AT_name("param")
     961                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_param")
     962                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     963                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     964              $C$DW$106       .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$29)
     966                      .dwattr $C$DW$106, DW_AT_name("data")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   19

     967                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_data")
     968                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     969                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     970                      .dwendtag $C$DW$T$30
     971              
     972              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
     973                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
     974                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
     975              
     976              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     977                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
     978              $C$DW$107       .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     980                      .dwattr $C$DW$107, DW_AT_name("Ualpha")
     981                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Ualpha")
     982                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     984              $C$DW$108       .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     986                      .dwattr $C$DW$108, DW_AT_name("Ubeta")
     987                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Ubeta")
     988                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     989                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$109       .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$109, DW_AT_name("Ta")
     993                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_Ta")
     994                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     995                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$110       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$110, DW_AT_name("Tb")
     999                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_Tb")
    1000                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1001                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1002              $C$DW$111       .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$111, DW_AT_name("Tc")
    1005                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_Tc")
    1006                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1007                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1008              $C$DW$112       .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$112, DW_AT_name("tmp1")
    1011                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_tmp1")
    1012                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1013                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1014              $C$DW$113       .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$113, DW_AT_name("tmp2")
    1017                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_tmp2")
    1018                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1019                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1020              $C$DW$114       .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   20

    1022                      .dwattr $C$DW$114, DW_AT_name("tmp3")
    1023                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_tmp3")
    1024                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1025                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1026              $C$DW$115       .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$31)
    1028                      .dwattr $C$DW$115, DW_AT_name("VecSector")
    1029                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_VecSector")
    1030                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1031                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1032                      .dwendtag $C$DW$T$32
    1033              
    1034              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    1035                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    1036                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    1037              
    1038              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1039                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    1040              $C$DW$116       .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$116, DW_AT_name("TargetValue")
    1043                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_TargetValue")
    1044                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1046              $C$DW$117       .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$33)
    1048                      .dwattr $C$DW$117, DW_AT_name("RampDelayMax")
    1049                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RampDelayMax")
    1050                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1051                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1052              $C$DW$118       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$118, DW_AT_name("RampLowLimit")
    1055                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_RampLowLimit")
    1056                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1057                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$119       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$119, DW_AT_name("RampHighLimit")
    1061                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_RampHighLimit")
    1062                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1063                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$120       .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$33)
    1066                      .dwattr $C$DW$120, DW_AT_name("RampDelayCount")
    1067                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_RampDelayCount")
    1068                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1069                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1070              $C$DW$121       .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$121, DW_AT_name("SetpointValue")
    1073                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SetpointValue")
    1074                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1075                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1076              $C$DW$122       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   21

    1077                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    1078                      .dwattr $C$DW$122, DW_AT_name("EqualFlag")
    1079                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_EqualFlag")
    1080                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1081                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1082              $C$DW$123       .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$123, DW_AT_name("Tmp")
    1085                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_Tmp")
    1086                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1087                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1088                      .dwendtag $C$DW$T$34
    1089              
    1090              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    1091                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    1092                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1093              
    1094              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1095                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1096              $C$DW$124       .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$124, DW_AT_name("Freq")
    1099                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Freq")
    1100                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$125       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$125, DW_AT_name("StepAngleMax")
    1105                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_StepAngleMax")
    1106                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1107                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1108              $C$DW$126       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$126, DW_AT_name("Angle")
    1111                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_Angle")
    1112                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1113                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$127       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$127, DW_AT_name("Gain")
    1117                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_Gain")
    1118                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1119                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$128       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$128, DW_AT_name("Out")
    1123                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_Out")
    1124                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1125                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1126              $C$DW$129       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$129, DW_AT_name("Offset")
    1129                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_Offset")
    1130                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1131                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   22

    1132                      .dwendtag $C$DW$T$35
    1133              
    1134              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    1135                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    1136                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1137              
    1138              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1139                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    1140              $C$DW$130       .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$130, DW_AT_name("DcBusVolt")
    1143                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_DcBusVolt")
    1144                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1146              $C$DW$131       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$131, DW_AT_name("MfuncV1")
    1149                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_MfuncV1")
    1150                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1151                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$132       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$132, DW_AT_name("MfuncV2")
    1155                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_MfuncV2")
    1156                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1157                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1158              $C$DW$133       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$133, DW_AT_name("MfuncV3")
    1161                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_MfuncV3")
    1162                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1163                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1164              $C$DW$134       .dwtag  DW_TAG_member
    1165                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$31)
    1166                      .dwattr $C$DW$134, DW_AT_name("OutOfPhase")
    1167                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OutOfPhase")
    1168                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1169                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$135       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$135, DW_AT_name("VphaseA")
    1173                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_VphaseA")
    1174                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1175                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$136       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$136, DW_AT_name("VphaseB")
    1179                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_VphaseB")
    1180                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1181                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$137       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$137, DW_AT_name("VphaseC")
    1185                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_VphaseC")
    1186                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   23

    1187                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$138       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$138, DW_AT_name("Valpha")
    1191                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Valpha")
    1192                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1193                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$139       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$139, DW_AT_name("Vbeta")
    1197                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_Vbeta")
    1198                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1199                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$140       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$140, DW_AT_name("temp")
    1203                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_temp")
    1204                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1205                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1206                      .dwendtag $C$DW$T$36
    1207              
    1208              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    1209                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    1210                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1211              
    1212              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1213                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    1214              $C$DW$141       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$141, DW_AT_name("ElecTheta")
    1217                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ElecTheta")
    1218                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$142       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$33)
    1222                      .dwattr $C$DW$142, DW_AT_name("DirectionQep")
    1223                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DirectionQep")
    1224                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1225                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$143       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$143, DW_AT_name("OldElecTheta")
    1229                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OldElecTheta")
    1230                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1231                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$144       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$144, DW_AT_name("Speed")
    1235                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_Speed")
    1236                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1237                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1238              $C$DW$145       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$33)
    1240                      .dwattr $C$DW$145, DW_AT_name("BaseRpm")
    1241                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_BaseRpm")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   24

    1242                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1243                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$146       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$37)
    1246                      .dwattr $C$DW$146, DW_AT_name("K1")
    1247                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_K1")
    1248                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1249                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$147       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$147, DW_AT_name("K2")
    1253                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_K2")
    1254                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1255                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$148       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$148, DW_AT_name("K3")
    1259                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_K3")
    1260                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1261                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$149       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$38)
    1264                      .dwattr $C$DW$149, DW_AT_name("SpeedRpm")
    1265                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SpeedRpm")
    1266                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1267                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$150       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$150, DW_AT_name("Tmp")
    1271                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Tmp")
    1272                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1273                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1274                      .dwendtag $C$DW$T$39
    1275              
    1276              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    1277                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    1278                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1279              
    1280              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1281                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    1282              $C$DW$151       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$40)
    1284                      .dwattr $C$DW$151, DW_AT_name("ElecTheta")
    1285                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ElecTheta")
    1286                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$152       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$40)
    1290                      .dwattr $C$DW$152, DW_AT_name("MechTheta")
    1291                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_MechTheta")
    1292                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1293                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$153       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    1296                      .dwattr $C$DW$153, DW_AT_name("DirectionQep")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   25

    1297                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_DirectionQep")
    1298                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1299                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$154       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1302                      .dwattr $C$DW$154, DW_AT_name("QepPeriod")
    1303                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_QepPeriod")
    1304                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1305                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$155       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$33)
    1308                      .dwattr $C$DW$155, DW_AT_name("QepCountIndex")
    1309                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_QepCountIndex")
    1310                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1311                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$156       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$38)
    1314                      .dwattr $C$DW$156, DW_AT_name("RawTheta")
    1315                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RawTheta")
    1316                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1317                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$157       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$40)
    1320                      .dwattr $C$DW$157, DW_AT_name("MechScaler")
    1321                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MechScaler")
    1322                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1323                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$158       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
    1326                      .dwattr $C$DW$158, DW_AT_name("LineEncoder")
    1327                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_LineEncoder")
    1328                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1329                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1330              $C$DW$159       .dwtag  DW_TAG_member
    1331                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1332                      .dwattr $C$DW$159, DW_AT_name("PolePairs")
    1333                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PolePairs")
    1334                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1335                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$160       .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$38)
    1338                      .dwattr $C$DW$160, DW_AT_name("CalibratedAngle")
    1339                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_CalibratedAngle")
    1340                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1341                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$161       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1344                      .dwattr $C$DW$161, DW_AT_name("IndexSyncFlag")
    1345                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IndexSyncFlag")
    1346                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1347                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1348                      .dwendtag $C$DW$T$41
    1349              
    1350              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    1351                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   26

    1352                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1353              
    1354              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1355                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    1356              $C$DW$162       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$42)
    1358                      .dwattr $C$DW$162, DW_AT_name("stat_reg1")
    1359                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_stat_reg1")
    1360                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1361                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$163       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$43)
    1364                      .dwattr $C$DW$163, DW_AT_name("stat_reg2")
    1365                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_stat_reg2")
    1366                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1367                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$164       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$44)
    1370                      .dwattr $C$DW$164, DW_AT_name("cntrl_reg1")
    1371                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_cntrl_reg1")
    1372                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1373                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$165       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$45)
    1376                      .dwattr $C$DW$165, DW_AT_name("cntrl_reg2")
    1377                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_cntrl_reg2")
    1378                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1379                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1380              $C$DW$166       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    1382                      .dwattr $C$DW$166, DW_AT_name("readCntrl1")
    1383                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_readCntrl1")
    1384                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1385                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1386              $C$DW$167       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$31)
    1388                      .dwattr $C$DW$167, DW_AT_name("readCntrl2")
    1389                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_readCntrl2")
    1390                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1391                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$168       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$31)
    1394                      .dwattr $C$DW$168, DW_AT_name("DRV_fault")
    1395                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DRV_fault")
    1396                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1397                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1398                      .dwendtag $C$DW$T$46
    1399              
    1400              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    1401                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    1402                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1403              
    1404              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1405                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    1406              $C$DW$169       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   27

    1407                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$31)
    1408                      .dwattr $C$DW$169, DW_AT_name("Rsvd0")
    1409                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Rsvd0")
    1410                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$170       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$47)
    1414                      .dwattr $C$DW$170, DW_AT_name("status1_wwd")
    1415                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_status1_wwd")
    1416                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1417                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$171       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$48)
    1420                      .dwattr $C$DW$171, DW_AT_name("status2_ov_vds")
    1421                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_status2_ov_vds")
    1422                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1423                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$172       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$49)
    1426                      .dwattr $C$DW$172, DW_AT_name("status3_IC")
    1427                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_status3_IC")
    1428                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1429                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$173       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$50)
    1432                      .dwattr $C$DW$173, DW_AT_name("status4_gd_Vgs")
    1433                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    1434                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1435                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$174       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$51)
    1438                      .dwattr $C$DW$174, DW_AT_name("cntrl5_hs_gd")
    1439                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    1440                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1441                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$175       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$52)
    1444                      .dwattr $C$DW$175, DW_AT_name("cntrl6_ls_gd")
    1445                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    1446                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1447                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$176       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$53)
    1450                      .dwattr $C$DW$176, DW_AT_name("cntrl7_gd")
    1451                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_cntrl7_gd")
    1452                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1453                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$177       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    1456                      .dwattr $C$DW$177, DW_AT_name("Rsvd8")
    1457                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Rsvd8")
    1458                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1459                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$178       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   28

    1462                      .dwattr $C$DW$178, DW_AT_name("cntrl9_IC_ops")
    1463                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    1464                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1465                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$179       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$55)
    1468                      .dwattr $C$DW$179, DW_AT_name("cntrlA_shunt_amp")
    1469                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    1470                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1471                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$180       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$56)
    1474                      .dwattr $C$DW$180, DW_AT_name("cntrlB_Vreg")
    1475                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    1476                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1477                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$181       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$57)
    1480                      .dwattr $C$DW$181, DW_AT_name("cntrlC_Vds_SNS")
    1481                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    1482                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1483                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$182       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$31)
    1486                      .dwattr $C$DW$182, DW_AT_name("readCntrl5")
    1487                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_readCntrl5")
    1488                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1489                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$183       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$31)
    1492                      .dwattr $C$DW$183, DW_AT_name("readCntrl6")
    1493                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_readCntrl6")
    1494                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1495                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$184       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$31)
    1498                      .dwattr $C$DW$184, DW_AT_name("readCntrl7")
    1499                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_readCntrl7")
    1500                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1501                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$185       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$31)
    1504                      .dwattr $C$DW$185, DW_AT_name("readCntrl9")
    1505                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_readCntrl9")
    1506                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1507                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1508              $C$DW$186       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    1510                      .dwattr $C$DW$186, DW_AT_name("readCntrlA")
    1511                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_readCntrlA")
    1512                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1513                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$187       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$31)
    1516                      .dwattr $C$DW$187, DW_AT_name("readCntrlB")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   29

    1517                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_readCntrlB")
    1518                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1519                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$188       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$31)
    1522                      .dwattr $C$DW$188, DW_AT_name("readCntrlC")
    1523                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_readCntrlC")
    1524                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1525                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$189       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$31)
    1528                      .dwattr $C$DW$189, DW_AT_name("DRV_fault")
    1529                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_DRV_fault")
    1530                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1531                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1532                      .dwendtag $C$DW$T$58
    1533              
    1534              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    1535                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    1536                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1537              
    1538              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    1539                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x150)
    1540              $C$DW$190       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$60)
    1542                      .dwattr $C$DW$190, DW_AT_name("PwmARegs")
    1543                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PwmARegs")
    1544                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$191       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$60)
    1548                      .dwattr $C$DW$191, DW_AT_name("PwmBRegs")
    1549                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PwmBRegs")
    1550                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1551                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$192       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$60)
    1554                      .dwattr $C$DW$192, DW_AT_name("PwmCRegs")
    1555                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PwmCRegs")
    1556                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1557                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$193       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$62)
    1560                      .dwattr $C$DW$193, DW_AT_name("QepRegs")
    1561                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_QepRegs")
    1562                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1563                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$194       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$64)
    1566                      .dwattr $C$DW$194, DW_AT_name("SpiRegs")
    1567                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SpiRegs")
    1568                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1569                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$195       .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   30

    1572                      .dwattr $C$DW$195, DW_AT_name("drvScsPin")
    1573                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_drvScsPin")
    1574                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1575                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$196       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$196, DW_AT_name("offset_shntA")
    1579                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_offset_shntA")
    1580                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1581                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$197       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$197, DW_AT_name("offset_shntB")
    1585                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_offset_shntB")
    1586                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1587                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$198       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$198, DW_AT_name("offset_shntC")
    1591                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_offset_shntC")
    1592                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1593                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$199       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$199, DW_AT_name("VdTesting")
    1597                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_VdTesting")
    1598                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1599                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1600              $C$DW$200       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1602                      .dwattr $C$DW$200, DW_AT_name("VqTesting")
    1603                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_VqTesting")
    1604                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1605                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$201       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$201, DW_AT_name("IdRef")
    1609                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_IdRef")
    1610                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1611                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$202       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    1614                      .dwattr $C$DW$202, DW_AT_name("IqRef")
    1615                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_IqRef")
    1616                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1617                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$203       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$203, DW_AT_name("SpeedRef")
    1621                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_SpeedRef")
    1622                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1623                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1624              $C$DW$204       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$204, DW_AT_name("ElecTheta")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   31

    1627                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ElecTheta")
    1628                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1629                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$205       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$205, DW_AT_name("MechTheta")
    1633                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_MechTheta")
    1634                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1635                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$206       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$40)
    1638                      .dwattr $C$DW$206, DW_AT_name("currentAs")
    1639                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_currentAs")
    1640                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1641                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1642              $C$DW$207       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$40)
    1644                      .dwattr $C$DW$207, DW_AT_name("currentBs")
    1645                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_currentBs")
    1646                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1647                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1648              $C$DW$208       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$40)
    1650                      .dwattr $C$DW$208, DW_AT_name("currentCs")
    1651                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_currentCs")
    1652                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1653                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1654              $C$DW$209       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$38)
    1656                      .dwattr $C$DW$209, DW_AT_name("alignCntr")
    1657                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_alignCntr")
    1658                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1659                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1660              $C$DW$210       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$38)
    1662                      .dwattr $C$DW$210, DW_AT_name("alignCnt")
    1663                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_alignCnt")
    1664                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1665                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$211       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$31)
    1668                      .dwattr $C$DW$211, DW_AT_name("lsw")
    1669                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_lsw")
    1670                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1671                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$212       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$31)
    1674                      .dwattr $C$DW$212, DW_AT_name("TripFlagDMC")
    1675                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_TripFlagDMC")
    1676                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    1677                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$213       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
    1680                      .dwattr $C$DW$213, DW_AT_name("clearTripFlagDMC")
    1681                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_clearTripFlagDMC")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   32

    1682                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1683                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$214       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$31)
    1686                      .dwattr $C$DW$214, DW_AT_name("RunMotor")
    1687                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_RunMotor")
    1688                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    1689                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$215       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$31)
    1692                      .dwattr $C$DW$215, DW_AT_name("SpeedLoopPrescaler")
    1693                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
    1694                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1695                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$216       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$31)
    1698                      .dwattr $C$DW$216, DW_AT_name("SpeedLoopCount")
    1699                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_SpeedLoopCount")
    1700                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    1701                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$217       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$31)
    1704                      .dwattr $C$DW$217, DW_AT_name("PosSenseReverse")
    1705                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PosSenseReverse")
    1706                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1707                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1708              $C$DW$218       .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$31)
    1710                      .dwattr $C$DW$218, DW_AT_name("newCmdDRV")
    1711                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_newCmdDRV")
    1712                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    1713                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1714              $C$DW$219       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$40)
    1716                      .dwattr $C$DW$219, DW_AT_name("T")
    1717                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_T")
    1718                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1719                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1720              $C$DW$220       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$65)
    1722                      .dwattr $C$DW$220, DW_AT_name("clarke")
    1723                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_clarke")
    1724                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1725                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1726              $C$DW$221       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$66)
    1728                      .dwattr $C$DW$221, DW_AT_name("park")
    1729                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_park")
    1730                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1731                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1732              $C$DW$222       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$67)
    1734                      .dwattr $C$DW$222, DW_AT_name("ipark")
    1735                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ipark")
    1736                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:50 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
DRV830x_SPI.asm                                                      PAGE   33

    1737                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1738              $C$DW$223       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$68)
    1740                      .dwattr $C$DW$223, DW_AT_name("pi_pos")
    1741                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_pi_pos")
    1742                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1743                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$224       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$69)
    1746                      .dwattr $C$DW$224, DW_AT_name("pid_spd")
    1747                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_pid_spd")
    1748                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1749                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
