TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:26:43 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("F28x_usDelay")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_F28x_usDelay")

    1911              ;* FUNCTION ENVIRONMENT                                        *
    1912              ;*                                                             *
    1913              ;* FUNCTION PROPERTIES                                         *
    1914              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1915              ;***************************************************************
    1916              
    1917 0000029b       _HIB:
    1918                      .dwcfi  cfa_offset, -2
    1919                      .dwcfi  save_reg_to_mem, 26, 0
    1920                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1921 0000029b 7622   EALLOW
    1922                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1923 0000029c 761F!         MOVW      DP,#_CpuSysRegs+118   ; [CPU_U] 
         0000029d 0001 
    1924 0000029e 1A36!         OR        @_CpuSysRegs+118,#0x0003 ; [CPU_] |724| 
         0000029f 0003 
    1925                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1926 000002a0 761A   EDIS
    1927                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1928 000002a1 FF69          SPM       #0                    ; [CPU_] 
    1929              $C$DW$95        .dwtag  DW_TAG_TI_branch
    1930                      .dwattr $C$DW$95, DW_AT_low_pc(0x00)
    1931                      .dwattr $C$DW$95, DW_AT_name("_DisablePeripheralClocks")
    1932                      .dwattr $C$DW$95, DW_AT_TI_call
    1933 000002a2 7640'         LCR       #_DisablePeripheralClocks ; [CPU_] |726| 
         000002a3 00C1 
    1934                      ; call occurs [#_DisablePeripheralClocks] ; [] |726| 
    1935                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1936 000002a4 7622   EALLOW
    1937                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1938 000002a5 761F!         MOVW      DP,#_ClkCfgRegs+14    ; [CPU_U] 
         000002a6 0000 
    1939 000002a7 180E!         AND       @_ClkCfgRegs+14,#0xfffd ; [CPU_] |728| 
         000002a8 FFFD 
    1940                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1941 000002a9 180E!         AND       @_ClkCfgRegs+14,#0xfffe ; [CPU_] |729| 
         000002aa FFFE 
    1942                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1943 000002ab 761A   EDIS
    1944                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1945 000002ac 7621   IDLE
    1946                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_SysCtrl.c"
    1947 000002ad FF69          SPM       #0                    ; [CPU_] 
    1948              $C$DW$96        .dwtag  DW_TAG_TI_branch
    1949                      .dwattr $C$DW$96, DW_AT_low_pc(0x00)
    1950                      .dwattr $C$DW$96, DW_AT_TI_return
    1951 000002ae 0006          LRETR     ; [CPU_] 
    1952                      ; return occurs ; [] 
    1953                      .dwattr $C$DW$94, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   40

    1954                      .dwattr $C$DW$94, DW_AT_TI_end_line(0x2dc)
    1955                      .dwattr $C$DW$94, DW_AT_TI_end_column(0x01)
    1956                      .dwendentry
    1957                      .dwendtag $C$DW$94
    1958              
    1959              ;**************************************************************
    1960              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1961              ;**************************************************************
    1962                      .global _F28x_usDelay
    1963                      .global _GPIO_EnableUnbondedIOPullups
    1964                      .global _RamfuncsRunStart
    1965                      .global _RamfuncsLoadStart
    1966                      .global _RamfuncsLoadSize
    1967                      .global _DcsmZ1Regs
    1968                      .global _DcsmZ2Regs
    1969                      .global _Flash0EccRegs
    1970                      .global _Flash1EccRegs
    1971                      .global _WdRegs
    1972                      .global _ClkCfgRegs
    1973                      .global _AnalogSubsysRegs
    1974                      .global _CpuSysRegs
    1975                      .global _Flash1CtrlRegs
    1976                      .global _Flash0CtrlRegs
    1977                      .global _memcpy
    1978              
    1979              ;***************************************************************
    1980              ;* TYPE INFORMATION                                            *
    1981              ;***************************************************************
    1982              
    1983              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1984                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    1985                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    1986              $C$DW$97        .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1988                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    1989                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    1990                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$98        .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$112)
    1994                      .dwattr $C$DW$98, DW_AT_name("INTOSC1TRIM")
    1995                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    1996                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1997                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1998              $C$DW$99        .dwtag  DW_TAG_member
    1999                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$114)
    2000                      .dwattr $C$DW$99, DW_AT_name("INTOSC2TRIM")
    2001                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2002                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2003                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$100       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    2006                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    2007                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    2008                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   41

    2009                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$101       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$176)
    2012                      .dwattr $C$DW$101, DW_AT_name("TSNSCTL")
    2013                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_TSNSCTL")
    2014                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2015                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2016              $C$DW$102       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
    2018                      .dwattr $C$DW$102, DW_AT_name("rsvd3")
    2019                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd3")
    2020                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2021                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2022              $C$DW$103       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$118)
    2024                      .dwattr $C$DW$103, DW_AT_name("LOCK")
    2025                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_LOCK")
    2026                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2027                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2028              $C$DW$104       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$23)
    2030                      .dwattr $C$DW$104, DW_AT_name("rsvd4")
    2031                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd4")
    2032                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2033                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$105       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    2036                      .dwattr $C$DW$105, DW_AT_name("ANAREFTRIMA")
    2037                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2038                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2039                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$106       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$30)
    2042                      .dwattr $C$DW$106, DW_AT_name("ANAREFTRIMB")
    2043                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2044                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2045                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2046              $C$DW$107       .dwtag  DW_TAG_member
    2047                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$32)
    2048                      .dwattr $C$DW$107, DW_AT_name("ANAREFTRIMC")
    2049                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2050                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2051                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$108       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$34)
    2054                      .dwattr $C$DW$108, DW_AT_name("ANAREFTRIMD")
    2055                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2056                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2057                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$109       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$24)
    2060                      .dwattr $C$DW$109, DW_AT_name("rsvd5")
    2061                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd5")
    2062                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2063                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   42

    2064                      .dwendtag $C$DW$T$25
    2065              
    2066              $C$DW$110       .dwtag  DW_TAG_TI_far_type
    2067                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$25)
    2068              $C$DW$T$224     .dwtag  DW_TAG_volatile_type
    2069                      .dwattr $C$DW$T$224, DW_AT_type(*$C$DW$110)
    2070              
    2071              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2072                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2073                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2074              $C$DW$111       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$111, DW_AT_name("BGVALTRIM")
    2077                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_BGVALTRIM")
    2078                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2079                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2081              $C$DW$112       .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2083                      .dwattr $C$DW$112, DW_AT_name("BGSLOPETRIM")
    2084                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2085                      .dwattr $C$DW$112, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2086                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2088              $C$DW$113       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2090                      .dwattr $C$DW$113, DW_AT_name("IREFTRIM")
    2091                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IREFTRIM")
    2092                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    2093                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2095              $C$DW$114       .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2097                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    2098                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    2099                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2100                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2101                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2102              $C$DW$115       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2104                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    2105                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    2106                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2107                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2108                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2109                      .dwendtag $C$DW$T$26
    2110              
    2111              
    2112              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2113                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2114                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2115              $C$DW$116       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$27)
    2117                      .dwattr $C$DW$116, DW_AT_name("all")
    2118                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   43

    2119                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$117       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    2123                      .dwattr $C$DW$117, DW_AT_name("bit")
    2124                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    2125                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2127                      .dwendtag $C$DW$T$28
    2128              
    2129              
    2130              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2131                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2132                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2133              $C$DW$118       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2135                      .dwattr $C$DW$118, DW_AT_name("BGVALTRIM")
    2136                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_BGVALTRIM")
    2137                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2138                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$119       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$119, DW_AT_name("BGSLOPETRIM")
    2143                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2144                      .dwattr $C$DW$119, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2145                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2146                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2147              $C$DW$120       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$120, DW_AT_name("IREFTRIM")
    2150                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IREFTRIM")
    2151                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    2152                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$121       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2156                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    2157                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    2158                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2159                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2160                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2161              $C$DW$122       .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2163                      .dwattr $C$DW$122, DW_AT_name("rsvd2")
    2164                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd2")
    2165                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2166                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2167                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2168                      .dwendtag $C$DW$T$29
    2169              
    2170              
    2171              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2172                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2173                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   44

    2174              $C$DW$123       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    2176                      .dwattr $C$DW$123, DW_AT_name("all")
    2177                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    2178                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2179                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$124       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$29)
    2182                      .dwattr $C$DW$124, DW_AT_name("bit")
    2183                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    2184                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2186                      .dwendtag $C$DW$T$30
    2187              
    2188              
    2189              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2190                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2191                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2192              $C$DW$125       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$125, DW_AT_name("BGVALTRIM")
    2195                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_BGVALTRIM")
    2196                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2197                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$126       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$126, DW_AT_name("BGSLOPETRIM")
    2202                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2203                      .dwattr $C$DW$126, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2204                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$127       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$127, DW_AT_name("IREFTRIM")
    2209                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IREFTRIM")
    2210                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    2211                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$128       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    2216                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    2217                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2218                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2219                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$129       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$129, DW_AT_name("rsvd2")
    2223                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd2")
    2224                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2225                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2226                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2227                      .dwendtag $C$DW$T$31
    2228              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   45

    2229              
    2230              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2231                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2232                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2233              $C$DW$130       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$27)
    2235                      .dwattr $C$DW$130, DW_AT_name("all")
    2236                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_all")
    2237                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2239              $C$DW$131       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$31)
    2241                      .dwattr $C$DW$131, DW_AT_name("bit")
    2242                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_bit")
    2243                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2245                      .dwendtag $C$DW$T$32
    2246              
    2247              
    2248              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2249                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2250                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2251              $C$DW$132       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$132, DW_AT_name("BGVALTRIM")
    2254                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_BGVALTRIM")
    2255                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2256                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2258              $C$DW$133       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$133, DW_AT_name("BGSLOPETRIM")
    2261                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2262                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2263                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$134       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$134, DW_AT_name("IREFTRIM")
    2268                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IREFTRIM")
    2269                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    2270                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2271                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$135       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2274                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    2275                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    2276                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2277                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2278                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2279              $C$DW$136       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2281                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2282                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    2283                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   46

    2284                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2285                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2286                      .dwendtag $C$DW$T$33
    2287              
    2288              
    2289              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2290                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2291                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2292              $C$DW$137       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$27)
    2294                      .dwattr $C$DW$137, DW_AT_name("all")
    2295                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    2296                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2297                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$138       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$33)
    2300                      .dwattr $C$DW$138, DW_AT_name("bit")
    2301                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    2302                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2303                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2304                      .dwendtag $C$DW$T$34
    2305              
    2306              
    2307              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2308                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2309                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2310              $C$DW$139       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2312                      .dwattr $C$DW$139, DW_AT_name("AUXPLLDIV")
    2313                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2314                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2315                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2317              $C$DW$140       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2319                      .dwattr $C$DW$140, DW_AT_name("rsvd1")
    2320                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd1")
    2321                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2322                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2323                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2324              $C$DW$141       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$141, DW_AT_name("rsvd2")
    2327                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd2")
    2328                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2329                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2330                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2331                      .dwendtag $C$DW$T$35
    2332              
    2333              
    2334              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2335                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2336                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2337              $C$DW$142       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   47

    2339                      .dwattr $C$DW$142, DW_AT_name("all")
    2340                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    2341                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2342                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$143       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$35)
    2345                      .dwattr $C$DW$143, DW_AT_name("bit")
    2346                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    2347                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2349                      .dwendtag $C$DW$T$36
    2350              
    2351              
    2352              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2353                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2354                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2355              $C$DW$144       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2357                      .dwattr $C$DW$144, DW_AT_name("PLLEN")
    2358                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PLLEN")
    2359                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2360                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2362              $C$DW$145       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2364                      .dwattr $C$DW$145, DW_AT_name("PLLCLKEN")
    2365                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PLLCLKEN")
    2366                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2367                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2368                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2369              $C$DW$146       .dwtag  DW_TAG_member
    2370                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2371                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    2372                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    2373                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2374                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2375                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$147       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2378                      .dwattr $C$DW$147, DW_AT_name("rsvd2")
    2379                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd2")
    2380                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2381                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2382                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2383                      .dwendtag $C$DW$T$37
    2384              
    2385              
    2386              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2387                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2388                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2389              $C$DW$148       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    2391                      .dwattr $C$DW$148, DW_AT_name("all")
    2392                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    2393                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   48

    2394                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2395              $C$DW$149       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$37)
    2397                      .dwattr $C$DW$149, DW_AT_name("bit")
    2398                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    2399                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2400                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2401                      .dwendtag $C$DW$T$38
    2402              
    2403              
    2404              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2405                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2406                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2407              $C$DW$150       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2409                      .dwattr $C$DW$150, DW_AT_name("IMULT")
    2410                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_IMULT")
    2411                      .dwattr $C$DW$150, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    2412                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2413                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2414              $C$DW$151       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    2417                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    2418                      .dwattr $C$DW$151, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2419                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$152       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2423                      .dwattr $C$DW$152, DW_AT_name("FMULT")
    2424                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_FMULT")
    2425                      .dwattr $C$DW$152, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2426                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$153       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    2431                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    2432                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2433                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2434                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$154       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2437                      .dwattr $C$DW$154, DW_AT_name("rsvd3")
    2438                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd3")
    2439                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2440                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2441                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2442                      .dwendtag $C$DW$T$39
    2443              
    2444              
    2445              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2446                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2447                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2448              $C$DW$155       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   49

    2449                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$27)
    2450                      .dwattr $C$DW$155, DW_AT_name("all")
    2451                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    2452                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$156       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$39)
    2456                      .dwattr $C$DW$156, DW_AT_name("bit")
    2457                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    2458                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2459                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2460                      .dwendtag $C$DW$T$40
    2461              
    2462              
    2463              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2464                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2465                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2466              $C$DW$157       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2468                      .dwattr $C$DW$157, DW_AT_name("LOCKS")
    2469                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_LOCKS")
    2470                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2471                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2472                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2473              $C$DW$158       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2475                      .dwattr $C$DW$158, DW_AT_name("SLIPS")
    2476                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SLIPS")
    2477                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2478                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2480              $C$DW$159       .dwtag  DW_TAG_member
    2481                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2482                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    2483                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    2484                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2485                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2486                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2487              $C$DW$160       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2489                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
    2490                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    2491                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2492                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2493                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2494                      .dwendtag $C$DW$T$41
    2495              
    2496              
    2497              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2498                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2499                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2500              $C$DW$161       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$27)
    2502                      .dwattr $C$DW$161, DW_AT_name("all")
    2503                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   50

    2504                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$162       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$41)
    2508                      .dwattr $C$DW$162, DW_AT_name("bit")
    2509                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    2510                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2511                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2512                      .dwendtag $C$DW$T$42
    2513              
    2514              
    2515              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2516                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2517                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2518              $C$DW$163       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2520                      .dwattr $C$DW$163, DW_AT_name("CLKSRCCTL1")
    2521                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2522                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2523                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2525              $C$DW$164       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2527                      .dwattr $C$DW$164, DW_AT_name("CLKSRCCTL2")
    2528                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2529                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2530                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2531                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2532              $C$DW$165       .dwtag  DW_TAG_member
    2533                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2534                      .dwattr $C$DW$165, DW_AT_name("CLKSRCCTL3")
    2535                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2536                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2537                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2538                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2539              $C$DW$166       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2541                      .dwattr $C$DW$166, DW_AT_name("SYSPLLCTL1")
    2542                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2543                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2544                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2545                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2546              $C$DW$167       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$167, DW_AT_name("SYSPLLCTL2")
    2549                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2550                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2551                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2552                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$168       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2555                      .dwattr $C$DW$168, DW_AT_name("SYSPLLCTL3")
    2556                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2557                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2558                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   51

    2559                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$169       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2562                      .dwattr $C$DW$169, DW_AT_name("SYSPLLMULT")
    2563                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2564                      .dwattr $C$DW$169, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2565                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2567              $C$DW$170       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2569                      .dwattr $C$DW$170, DW_AT_name("AUXPLLCTL1")
    2570                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2571                      .dwattr $C$DW$170, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2572                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$171       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2577                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2578                      .dwattr $C$DW$171, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2579                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2581              $C$DW$172       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2583                      .dwattr $C$DW$172, DW_AT_name("rsvd2")
    2584                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd2")
    2585                      .dwattr $C$DW$172, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2586                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2587                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2588              $C$DW$173       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$173, DW_AT_name("AUXPLLMULT")
    2591                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2592                      .dwattr $C$DW$173, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2593                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2595              $C$DW$174       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2597                      .dwattr $C$DW$174, DW_AT_name("SYSCLKDIVSEL")
    2598                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2599                      .dwattr $C$DW$174, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2600                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2601                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$175       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2604                      .dwattr $C$DW$175, DW_AT_name("AUXCLKDIVSEL")
    2605                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2606                      .dwattr $C$DW$175, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2607                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2608                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2609              $C$DW$176       .dwtag  DW_TAG_member
    2610                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2611                      .dwattr $C$DW$176, DW_AT_name("PERCLKDIVSEL")
    2612                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2613                      .dwattr $C$DW$176, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   52

    2614                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$177       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2618                      .dwattr $C$DW$177, DW_AT_name("rsvd3")
    2619                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd3")
    2620                      .dwattr $C$DW$177, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2621                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2622                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2623              $C$DW$178       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2625                      .dwattr $C$DW$178, DW_AT_name("LOSPCP")
    2626                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_LOSPCP")
    2627                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2628                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2629                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2630              $C$DW$179       .dwtag  DW_TAG_member
    2631                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2632                      .dwattr $C$DW$179, DW_AT_name("rsvd4")
    2633                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd4")
    2634                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2635                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2636                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2637                      .dwendtag $C$DW$T$43
    2638              
    2639              
    2640              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2641                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2642                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2643              $C$DW$180       .dwtag  DW_TAG_member
    2644                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$27)
    2645                      .dwattr $C$DW$180, DW_AT_name("all")
    2646                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    2647                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2648                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2649              $C$DW$181       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$43)
    2651                      .dwattr $C$DW$181, DW_AT_name("bit")
    2652                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    2653                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2654                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2655                      .dwendtag $C$DW$T$44
    2656              
    2657              
    2658              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2659                      .dwattr $C$DW$T$45, DW_AT_name("CLKSRCCTL1_BITS")
    2660                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2661              $C$DW$182       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2663                      .dwattr $C$DW$182, DW_AT_name("OSCCLKSRCSEL")
    2664                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2665                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2666                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2667                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$183       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   53

    2669                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2671                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2672                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2673                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2675              $C$DW$184       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2677                      .dwattr $C$DW$184, DW_AT_name("INTOSC2OFF")
    2678                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2679                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2680                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2681                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$185       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2684                      .dwattr $C$DW$185, DW_AT_name("XTALOFF")
    2685                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_XTALOFF")
    2686                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2687                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2689              $C$DW$186       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2691                      .dwattr $C$DW$186, DW_AT_name("WDHALTI")
    2692                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_WDHALTI")
    2693                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2694                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2696              $C$DW$187       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2698                      .dwattr $C$DW$187, DW_AT_name("rsvd2")
    2699                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd2")
    2700                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2701                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2702                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2703              $C$DW$188       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2705                      .dwattr $C$DW$188, DW_AT_name("rsvd3")
    2706                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd3")
    2707                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2708                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2709                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2710                      .dwendtag $C$DW$T$45
    2711              
    2712              
    2713              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2714                      .dwattr $C$DW$T$46, DW_AT_name("CLKSRCCTL1_REG")
    2715                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2716              $C$DW$189       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    2718                      .dwattr $C$DW$189, DW_AT_name("all")
    2719                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    2720                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2721                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$190       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$45)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   54

    2724                      .dwattr $C$DW$190, DW_AT_name("bit")
    2725                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    2726                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2727                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2728                      .dwendtag $C$DW$T$46
    2729              
    2730              
    2731              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2732                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL2_BITS")
    2733                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2734              $C$DW$191       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2736                      .dwattr $C$DW$191, DW_AT_name("AUXOSCCLKSRCSEL")
    2737                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    2738                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2739                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2740                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2741              $C$DW$192       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2743                      .dwattr $C$DW$192, DW_AT_name("CANABCLKSEL")
    2744                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CANABCLKSEL")
    2745                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2746                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2748              $C$DW$193       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2750                      .dwattr $C$DW$193, DW_AT_name("CANBBCLKSEL")
    2751                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    2752                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2753                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2754                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2755              $C$DW$194       .dwtag  DW_TAG_member
    2756                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2757                      .dwattr $C$DW$194, DW_AT_name("rsvd1")
    2758                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd1")
    2759                      .dwattr $C$DW$194, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2760                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2761                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$195       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2764                      .dwattr $C$DW$195, DW_AT_name("rsvd2")
    2765                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd2")
    2766                      .dwattr $C$DW$195, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2767                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2769              $C$DW$196       .dwtag  DW_TAG_member
    2770                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2771                      .dwattr $C$DW$196, DW_AT_name("rsvd3")
    2772                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd3")
    2773                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2774                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$197       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2778                      .dwattr $C$DW$197, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   55

    2779                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd4")
    2780                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2781                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2782                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2783                      .dwendtag $C$DW$T$47
    2784              
    2785              
    2786              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2787                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL2_REG")
    2788                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2789              $C$DW$198       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$27)
    2791                      .dwattr $C$DW$198, DW_AT_name("all")
    2792                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_all")
    2793                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2794                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2795              $C$DW$199       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$47)
    2797                      .dwattr $C$DW$199, DW_AT_name("bit")
    2798                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_bit")
    2799                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2801                      .dwendtag $C$DW$T$48
    2802              
    2803              
    2804              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2805                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL3_BITS")
    2806                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    2807              $C$DW$200       .dwtag  DW_TAG_member
    2808                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2809                      .dwattr $C$DW$200, DW_AT_name("XCLKOUTSEL")
    2810                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    2811                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    2812                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2814              $C$DW$201       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2816                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2817                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2818                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2819                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2820                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2821              $C$DW$202       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2823                      .dwattr $C$DW$202, DW_AT_name("rsvd2")
    2824                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_rsvd2")
    2825                      .dwattr $C$DW$202, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2826                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2827                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2828                      .dwendtag $C$DW$T$49
    2829              
    2830              
    2831              $C$DW$T$50      .dwtag  DW_TAG_union_type
    2832                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL3_REG")
    2833                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   56

    2834              $C$DW$203       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$27)
    2836                      .dwattr $C$DW$203, DW_AT_name("all")
    2837                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_all")
    2838                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2839                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2840              $C$DW$204       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$49)
    2842                      .dwattr $C$DW$204, DW_AT_name("bit")
    2843                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_bit")
    2844                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2845                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2846                      .dwendtag $C$DW$T$50
    2847              
    2848              
    2849              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2850                      .dwattr $C$DW$T$52, DW_AT_name("CLK_CFG_REGS")
    2851                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x32)
    2852              $C$DW$205       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    2854                      .dwattr $C$DW$205, DW_AT_name("rsvd1")
    2855                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd1")
    2856                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2857                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$206       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$44)
    2860                      .dwattr $C$DW$206, DW_AT_name("CLKCFGLOCK1")
    2861                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    2862                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2863                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$207       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$51)
    2866                      .dwattr $C$DW$207, DW_AT_name("rsvd2")
    2867                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd2")
    2868                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2869                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$208       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$46)
    2872                      .dwattr $C$DW$208, DW_AT_name("CLKSRCCTL1")
    2873                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2874                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2875                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$209       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$48)
    2878                      .dwattr $C$DW$209, DW_AT_name("CLKSRCCTL2")
    2879                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2880                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2881                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$210       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$50)
    2884                      .dwattr $C$DW$210, DW_AT_name("CLKSRCCTL3")
    2885                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2886                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2887                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$211       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   57

    2889                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$168)
    2890                      .dwattr $C$DW$211, DW_AT_name("SYSPLLCTL1")
    2891                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2892                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2893                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$212       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$51)
    2896                      .dwattr $C$DW$212, DW_AT_name("rsvd3")
    2897                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd3")
    2898                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2899                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$213       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$170)
    2902                      .dwattr $C$DW$213, DW_AT_name("SYSPLLMULT")
    2903                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2904                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2905                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$214       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$172)
    2908                      .dwattr $C$DW$214, DW_AT_name("SYSPLLSTS")
    2909                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_SYSPLLSTS")
    2910                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2911                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$215       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$38)
    2914                      .dwattr $C$DW$215, DW_AT_name("AUXPLLCTL1")
    2915                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2916                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2917                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2918              $C$DW$216       .dwtag  DW_TAG_member
    2919                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$51)
    2920                      .dwattr $C$DW$216, DW_AT_name("rsvd4")
    2921                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd4")
    2922                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2923                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2924              $C$DW$217       .dwtag  DW_TAG_member
    2925                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$40)
    2926                      .dwattr $C$DW$217, DW_AT_name("AUXPLLMULT")
    2927                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2928                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2929                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2930              $C$DW$218       .dwtag  DW_TAG_member
    2931                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$42)
    2932                      .dwattr $C$DW$218, DW_AT_name("AUXPLLSTS")
    2933                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_AUXPLLSTS")
    2934                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2935                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$219       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$166)
    2938                      .dwattr $C$DW$219, DW_AT_name("SYSCLKDIVSEL")
    2939                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2940                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2941                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$220       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$36)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   58

    2944                      .dwattr $C$DW$220, DW_AT_name("AUXCLKDIVSEL")
    2945                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2946                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2947                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2948              $C$DW$221       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$156)
    2950                      .dwattr $C$DW$221, DW_AT_name("PERCLKDIVSEL")
    2951                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2952                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2953                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$222       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$191)
    2956                      .dwattr $C$DW$222, DW_AT_name("XCLKOUTDIVSEL")
    2957                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    2958                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2959                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2960              $C$DW$223       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$21)
    2962                      .dwattr $C$DW$223, DW_AT_name("rsvd5")
    2963                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd5")
    2964                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2965                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$224       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$120)
    2968                      .dwattr $C$DW$224, DW_AT_name("LOSPCP")
    2969                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_LOSPCP")
    2970                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2971                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$225       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$124)
    2974                      .dwattr $C$DW$225, DW_AT_name("MCDCR")
    2975                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_MCDCR")
    2976                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2977                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$226       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$189)
    2980                      .dwattr $C$DW$226, DW_AT_name("X1CNT")
    2981                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_X1CNT")
    2982                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2983                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2984                      .dwendtag $C$DW$T$52
    2985              
    2986              $C$DW$227       .dwtag  DW_TAG_TI_far_type
    2987                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$52)
    2988              $C$DW$T$241     .dwtag  DW_TAG_volatile_type
    2989                      .dwattr $C$DW$T$241, DW_AT_type(*$C$DW$227)
    2990              
    2991              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2992                      .dwattr $C$DW$T$53, DW_AT_name("CPUSYSLOCK1_BITS")
    2993                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    2994              $C$DW$228       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2996                      .dwattr $C$DW$228, DW_AT_name("HIBBOOTMODE")
    2997                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2998                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   59

    2999                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3000                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3001              $C$DW$229       .dwtag  DW_TAG_member
    3002                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3003                      .dwattr $C$DW$229, DW_AT_name("IORESTOREADDR")
    3004                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_IORESTOREADDR")
    3005                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3006                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3007                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3008              $C$DW$230       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3010                      .dwattr $C$DW$230, DW_AT_name("PIEVERRADDR")
    3011                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3012                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3013                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3014                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3015              $C$DW$231       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3017                      .dwattr $C$DW$231, DW_AT_name("PCLKCR0")
    3018                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_PCLKCR0")
    3019                      .dwattr $C$DW$231, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3020                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3021                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$232       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3024                      .dwattr $C$DW$232, DW_AT_name("PCLKCR1")
    3025                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_PCLKCR1")
    3026                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3027                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3028                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$233       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3031                      .dwattr $C$DW$233, DW_AT_name("PCLKCR2")
    3032                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_PCLKCR2")
    3033                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3034                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3035                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3036              $C$DW$234       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3038                      .dwattr $C$DW$234, DW_AT_name("PCLKCR3")
    3039                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_PCLKCR3")
    3040                      .dwattr $C$DW$234, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3041                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3042                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3043              $C$DW$235       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3045                      .dwattr $C$DW$235, DW_AT_name("PCLKCR4")
    3046                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_PCLKCR4")
    3047                      .dwattr $C$DW$235, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3048                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3049                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3050              $C$DW$236       .dwtag  DW_TAG_member
    3051                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3052                      .dwattr $C$DW$236, DW_AT_name("PCLKCR5")
    3053                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_PCLKCR5")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   60

    3054                      .dwattr $C$DW$236, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3055                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3056                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3057              $C$DW$237       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3059                      .dwattr $C$DW$237, DW_AT_name("PCLKCR6")
    3060                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_PCLKCR6")
    3061                      .dwattr $C$DW$237, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3062                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$238       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3066                      .dwattr $C$DW$238, DW_AT_name("PCLKCR7")
    3067                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_PCLKCR7")
    3068                      .dwattr $C$DW$238, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3069                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3070                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3071              $C$DW$239       .dwtag  DW_TAG_member
    3072                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3073                      .dwattr $C$DW$239, DW_AT_name("PCLKCR8")
    3074                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_PCLKCR8")
    3075                      .dwattr $C$DW$239, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3076                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3077                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3078              $C$DW$240       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    3080                      .dwattr $C$DW$240, DW_AT_name("PCLKCR9")
    3081                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_PCLKCR9")
    3082                      .dwattr $C$DW$240, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3083                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3084                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3085              $C$DW$241       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3087                      .dwattr $C$DW$241, DW_AT_name("PCLKCR10")
    3088                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PCLKCR10")
    3089                      .dwattr $C$DW$241, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3090                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3091                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3092              $C$DW$242       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3094                      .dwattr $C$DW$242, DW_AT_name("PCLKCR11")
    3095                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCLKCR11")
    3096                      .dwattr $C$DW$242, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3097                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3098                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$243       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3101                      .dwattr $C$DW$243, DW_AT_name("PCLKCR12")
    3102                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PCLKCR12")
    3103                      .dwattr $C$DW$243, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3104                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$244       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3108                      .dwattr $C$DW$244, DW_AT_name("PCLKCR13")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_SysCtrl.asm                                                  PAGE   61

    3109                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PCLKCR13")
    3110                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3111                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3112                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$245       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3115                      .dwattr $C$DW$245, DW_AT_name("PCLKCR14")
    3116                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_PCLKCR14")
    3117                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3118                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3119                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$246       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3122                      .dwattr $C$DW$246, DW_AT_name("PCLKCR15")
    3123                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_PCLKCR15")
    3124                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3125                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3126                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3127              $C$DW$247       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3129                      .dwattr $C$DW$247, DW_AT_name("PCLKCR16")
    3130                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_PCLKCR16")
    3131                      .dwattr $C$DW$247, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3132                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3133                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$248       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3136                      .dwattr $C$DW$248, DW_AT_name("SECMSEL")
    3137                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_SECMSEL")
    3138                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3139                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3140                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$249       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3143                      .dwattr $C$DW$249, DW_AT_name("LPMCR")
    3144                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_LPMCR")
    3145                      .dwattr $C$DW$249, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
