TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:37:37 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("SDFM")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SDFM")

    1868                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_sdfm_drive
    1869              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   41

    1870                      .dwfde $C$DW$CIE, _Sdfm_clearFlagRegister
    1871              $C$DW$79        .dwtag  DW_TAG_formal_parameter, DW_AT_name("sdfmNumber")
    1872                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_sdfmNumber")
    1873                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$79, DW_AT_location[DW_OP_reg12]
    1875              $C$DW$80        .dwtag  DW_TAG_formal_parameter, DW_AT_name("sdfmReadFlagRegister")
    1876                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_sdfmReadFlagRegister")
    1877                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$55)
    1878                      .dwattr $C$DW$80, DW_AT_location[DW_OP_reg0]
    1879              
    1880              ;***************************************************************
    1881              ;* FNAME: _Sdfm_clearFlagRegister       FR SIZE:   4           *
    1882              ;*                                                             *
    1883              ;* FUNCTION ENVIRONMENT                                        *
    1884              ;*                                                             *
    1885              ;* FUNCTION PROPERTIES                                         *
    1886              ;*                            0 Parameter,  4 Auto,  0 SOE     *
    1887              ;***************************************************************
    1888              
    1889 0000050b       _Sdfm_clearFlagRegister:
    1890                      .dwcfi  cfa_offset, -2
    1891                      .dwcfi  save_reg_to_mem, 26, 0
    1892 0000050b FE04          ADDB      SP,#4                 ; [CPU_U] 
    1893                      .dwcfi  cfa_offset, -6
    1894              $C$DW$81        .dwtag  DW_TAG_variable, DW_AT_name("sdfmNumber")
    1895                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_sdfmNumber")
    1896                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$81, DW_AT_location[DW_OP_breg20 -1]
    1898              $C$DW$82        .dwtag  DW_TAG_variable, DW_AT_name("sdfmReadFlagRegister")
    1899                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_sdfmReadFlagRegister")
    1900                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$55)
    1901                      .dwattr $C$DW$82, DW_AT_location[DW_OP_breg20 -4]
    1902 0000050c 7C41          MOV       *-SP[1],AR4           ; [CPU_] |403| 
    1903 0000050d 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |403| 
    1904                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_sdfm_drive
    1905 0000050e 2901          CLRC      SXM                   ; [CPU_] 
    1906 0000050f 8F00!         MOVL      XAR4,#_SDFM           ; [CPU_U] |404| 
         00000510 0000 
    1907 00000511 5603          MOV       ACC,*-SP[1] << 1      ; [CPU_] |404| 
         00000512 0141 
    1908 00000513 5601          ADDL      XAR4,ACC              ; [CPU_] |404| 
         00000514 00A4 
    1909 00000515 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_] |404| 
    1910 00000516 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |404| 
    1911 00000517 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |404| 
    1912                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_sdfm_drive
    1913 00000518 FE84          SUBB      SP,#4                 ; [CPU_U] 
    1914                      .dwcfi  cfa_offset, -2
    1915              $C$DW$83        .dwtag  DW_TAG_TI_branch
    1916                      .dwattr $C$DW$83, DW_AT_low_pc(0x00)
    1917                      .dwattr $C$DW$83, DW_AT_TI_return
    1918 00000519 0006          LRETR     ; [CPU_] 
    1919                      ; return occurs ; [] 
    1920                      .dwattr $C$DW$78, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    1921                      .dwattr $C$DW$78, DW_AT_TI_end_line(0x195)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   42

    1922                      .dwattr $C$DW$78, DW_AT_TI_end_column(0x01)
    1923                      .dwendentry
    1924                      .dwendtag $C$DW$78
    1925              
    1926              ;**************************************************************
    1927              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1928              ;**************************************************************
    1929                      .global _SDFM
    1930              
    1931              ;***************************************************************
    1932              ;* TYPE INFORMATION                                            *
    1933              ;***************************************************************
    1934              
    1935              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1936                      .dwattr $C$DW$T$20, DW_AT_name("SDCMPH1_BITS")
    1937                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1938              $C$DW$84        .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$84, DW_AT_name("HLT")
    1941                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_HLT")
    1942                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    1943                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$85        .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
    1948                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
    1949                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1950                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1952                      .dwendtag $C$DW$T$20
    1953              
    1954              
    1955              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1956                      .dwattr $C$DW$T$21, DW_AT_name("SDCMPH1_REG")
    1957                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1958              $C$DW$86        .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$86, DW_AT_name("all")
    1961                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1962                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$87        .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1966                      .dwattr $C$DW$87, DW_AT_name("bit")
    1967                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1968                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1970                      .dwendtag $C$DW$T$21
    1971              
    1972              
    1973              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1974                      .dwattr $C$DW$T$22, DW_AT_name("SDCMPH2_BITS")
    1975                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1976              $C$DW$88        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   43

    1977                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$88, DW_AT_name("HLT")
    1979                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_HLT")
    1980                      .dwattr $C$DW$88, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    1981                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$89        .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
    1986                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
    1987                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1990                      .dwendtag $C$DW$T$22
    1991              
    1992              
    1993              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1994                      .dwattr $C$DW$T$23, DW_AT_name("SDCMPH2_REG")
    1995                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1996              $C$DW$90        .dwtag  DW_TAG_member
    1997                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1998                      .dwattr $C$DW$90, DW_AT_name("all")
    1999                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    2000                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2002              $C$DW$91        .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    2004                      .dwattr $C$DW$91, DW_AT_name("bit")
    2005                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    2006                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2008                      .dwendtag $C$DW$T$23
    2009              
    2010              
    2011              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2012                      .dwattr $C$DW$T$24, DW_AT_name("SDCMPH3_BITS")
    2013                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2014              $C$DW$92        .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2016                      .dwattr $C$DW$92, DW_AT_name("HLT")
    2017                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_HLT")
    2018                      .dwattr $C$DW$92, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    2019                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2020                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2021              $C$DW$93        .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    2024                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    2025                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2026                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2027                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2028                      .dwendtag $C$DW$T$24
    2029              
    2030              
    2031              $C$DW$T$25      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   44

    2032                      .dwattr $C$DW$T$25, DW_AT_name("SDCMPH3_REG")
    2033                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2034              $C$DW$94        .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$94, DW_AT_name("all")
    2037                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    2038                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$95        .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$24)
    2042                      .dwattr $C$DW$95, DW_AT_name("bit")
    2043                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    2044                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2046                      .dwendtag $C$DW$T$25
    2047              
    2048              
    2049              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2050                      .dwattr $C$DW$T$26, DW_AT_name("SDCMPH4_BITS")
    2051                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2052              $C$DW$96        .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2054                      .dwattr $C$DW$96, DW_AT_name("HLT")
    2055                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_HLT")
    2056                      .dwattr $C$DW$96, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    2057                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$97        .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2061                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2062                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2063                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2064                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2066                      .dwendtag $C$DW$T$26
    2067              
    2068              
    2069              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2070                      .dwattr $C$DW$T$27, DW_AT_name("SDCMPH4_REG")
    2071                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2072              $C$DW$98        .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2074                      .dwattr $C$DW$98, DW_AT_name("all")
    2075                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    2076                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2077                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2078              $C$DW$99        .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    2080                      .dwattr $C$DW$99, DW_AT_name("bit")
    2081                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    2082                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2083                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2084                      .dwendtag $C$DW$T$27
    2085              
    2086              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   45

    2087              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2088                      .dwattr $C$DW$T$28, DW_AT_name("SDCMPL1_BITS")
    2089                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2090              $C$DW$100       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2092                      .dwattr $C$DW$100, DW_AT_name("LLT")
    2093                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_LLT")
    2094                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    2095                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2097              $C$DW$101       .dwtag  DW_TAG_member
    2098                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2099                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    2100                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    2101                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2102                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2103                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2104                      .dwendtag $C$DW$T$28
    2105              
    2106              
    2107              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2108                      .dwattr $C$DW$T$29, DW_AT_name("SDCMPL1_REG")
    2109                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2110              $C$DW$102       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$102, DW_AT_name("all")
    2113                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    2114                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2116              $C$DW$103       .dwtag  DW_TAG_member
    2117                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    2118                      .dwattr $C$DW$103, DW_AT_name("bit")
    2119                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    2120                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2122                      .dwendtag $C$DW$T$29
    2123              
    2124              
    2125              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2126                      .dwattr $C$DW$T$30, DW_AT_name("SDCMPL2_BITS")
    2127                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2128              $C$DW$104       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$104, DW_AT_name("LLT")
    2131                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_LLT")
    2132                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    2133                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2135              $C$DW$105       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    2138                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    2139                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2140                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   46

    2142                      .dwendtag $C$DW$T$30
    2143              
    2144              
    2145              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2146                      .dwattr $C$DW$T$31, DW_AT_name("SDCMPL2_REG")
    2147                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2148              $C$DW$106       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$106, DW_AT_name("all")
    2151                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    2152                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$107       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$30)
    2156                      .dwattr $C$DW$107, DW_AT_name("bit")
    2157                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    2158                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2160                      .dwendtag $C$DW$T$31
    2161              
    2162              
    2163              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2164                      .dwattr $C$DW$T$32, DW_AT_name("SDCMPL3_BITS")
    2165                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2166              $C$DW$108       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$108, DW_AT_name("LLT")
    2169                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_LLT")
    2170                      .dwattr $C$DW$108, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    2171                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$109       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    2176                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    2177                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2178                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2179                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2180                      .dwendtag $C$DW$T$32
    2181              
    2182              
    2183              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2184                      .dwattr $C$DW$T$33, DW_AT_name("SDCMPL3_REG")
    2185                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2186              $C$DW$110       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2188                      .dwattr $C$DW$110, DW_AT_name("all")
    2189                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    2190                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$111       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$32)
    2194                      .dwattr $C$DW$111, DW_AT_name("bit")
    2195                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    2196                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   47

    2197                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2198                      .dwendtag $C$DW$T$33
    2199              
    2200              
    2201              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2202                      .dwattr $C$DW$T$34, DW_AT_name("SDCMPL4_BITS")
    2203                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2204              $C$DW$112       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2206                      .dwattr $C$DW$112, DW_AT_name("LLT")
    2207                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_LLT")
    2208                      .dwattr $C$DW$112, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0f)
    2209                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$113       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2213                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    2214                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    2215                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2216                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2217                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2218                      .dwendtag $C$DW$T$34
    2219              
    2220              
    2221              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2222                      .dwattr $C$DW$T$35, DW_AT_name("SDCMPL4_REG")
    2223                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2224              $C$DW$114       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$114, DW_AT_name("all")
    2227                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    2228                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$115       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$34)
    2232                      .dwattr $C$DW$115, DW_AT_name("bit")
    2233                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    2234                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2235                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2236                      .dwendtag $C$DW$T$35
    2237              
    2238              
    2239              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2240                      .dwattr $C$DW$T$36, DW_AT_name("SDCPARM1_BITS")
    2241                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2242              $C$DW$116       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$116, DW_AT_name("COSR")
    2245                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_COSR")
    2246                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    2247                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$117       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2251                      .dwattr $C$DW$117, DW_AT_name("IEH")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   48

    2252                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IEH")
    2253                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2254                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$118       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$118, DW_AT_name("IEL")
    2259                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IEL")
    2260                      .dwattr $C$DW$118, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2261                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$119       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$119, DW_AT_name("CS1_CS0")
    2266                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CS1_CS0")
    2267                      .dwattr $C$DW$119, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x02)
    2268                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2270              $C$DW$120       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2272                      .dwattr $C$DW$120, DW_AT_name("MFIE")
    2273                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_MFIE")
    2274                      .dwattr $C$DW$120, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2275                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$121       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    2280                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    2281                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2282                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2284                      .dwendtag $C$DW$T$36
    2285              
    2286              
    2287              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2288                      .dwattr $C$DW$T$37, DW_AT_name("SDCPARM1_REG")
    2289                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2290              $C$DW$122       .dwtag  DW_TAG_member
    2291                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2292                      .dwattr $C$DW$122, DW_AT_name("all")
    2293                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    2294                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2296              $C$DW$123       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$36)
    2298                      .dwattr $C$DW$123, DW_AT_name("bit")
    2299                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    2300                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2302                      .dwendtag $C$DW$T$37
    2303              
    2304              
    2305              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2306                      .dwattr $C$DW$T$38, DW_AT_name("SDCPARM2_BITS")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   49

    2307                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2308              $C$DW$124       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2310                      .dwattr $C$DW$124, DW_AT_name("COSR")
    2311                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_COSR")
    2312                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    2313                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$125       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2317                      .dwattr $C$DW$125, DW_AT_name("IEH")
    2318                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IEH")
    2319                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2320                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$126       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$126, DW_AT_name("IEL")
    2325                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IEL")
    2326                      .dwattr $C$DW$126, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2327                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$127       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2331                      .dwattr $C$DW$127, DW_AT_name("CS1_CS0")
    2332                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CS1_CS0")
    2333                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x02)
    2334                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2336              $C$DW$128       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2338                      .dwattr $C$DW$128, DW_AT_name("MFIE")
    2339                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_MFIE")
    2340                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2341                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2342                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$129       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    2346                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    2347                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2348                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2350                      .dwendtag $C$DW$T$38
    2351              
    2352              
    2353              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2354                      .dwattr $C$DW$T$39, DW_AT_name("SDCPARM2_REG")
    2355                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2356              $C$DW$130       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2358                      .dwattr $C$DW$130, DW_AT_name("all")
    2359                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_all")
    2360                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2361                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   50

    2362              $C$DW$131       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$38)
    2364                      .dwattr $C$DW$131, DW_AT_name("bit")
    2365                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_bit")
    2366                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2367                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2368                      .dwendtag $C$DW$T$39
    2369              
    2370              
    2371              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2372                      .dwattr $C$DW$T$40, DW_AT_name("SDCPARM3_BITS")
    2373                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2374              $C$DW$132       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2376                      .dwattr $C$DW$132, DW_AT_name("COSR")
    2377                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_COSR")
    2378                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    2379                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$133       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2383                      .dwattr $C$DW$133, DW_AT_name("IEH")
    2384                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IEH")
    2385                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2386                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2387                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2388              $C$DW$134       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2390                      .dwattr $C$DW$134, DW_AT_name("IEL")
    2391                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IEL")
    2392                      .dwattr $C$DW$134, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2393                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2395              $C$DW$135       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2397                      .dwattr $C$DW$135, DW_AT_name("CS1_CS0")
    2398                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_CS1_CS0")
    2399                      .dwattr $C$DW$135, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x02)
    2400                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2402              $C$DW$136       .dwtag  DW_TAG_member
    2403                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2404                      .dwattr $C$DW$136, DW_AT_name("MFIE")
    2405                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_MFIE")
    2406                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2407                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$137       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2411                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    2412                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    2413                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2414                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2415                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2416                      .dwendtag $C$DW$T$40
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   51

    2417              
    2418              
    2419              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2420                      .dwattr $C$DW$T$41, DW_AT_name("SDCPARM3_REG")
    2421                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2422              $C$DW$138       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2424                      .dwattr $C$DW$138, DW_AT_name("all")
    2425                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    2426                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$139       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$40)
    2430                      .dwattr $C$DW$139, DW_AT_name("bit")
    2431                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    2432                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2433                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2434                      .dwendtag $C$DW$T$41
    2435              
    2436              
    2437              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2438                      .dwattr $C$DW$T$42, DW_AT_name("SDCPARM4_BITS")
    2439                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2440              $C$DW$140       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2442                      .dwattr $C$DW$140, DW_AT_name("COSR")
    2443                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_COSR")
    2444                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    2445                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2446                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$141       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2449                      .dwattr $C$DW$141, DW_AT_name("IEH")
    2450                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IEH")
    2451                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2452                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$142       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$142, DW_AT_name("IEL")
    2457                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IEL")
    2458                      .dwattr $C$DW$142, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2459                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2460                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2461              $C$DW$143       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2463                      .dwattr $C$DW$143, DW_AT_name("CS1_CS0")
    2464                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CS1_CS0")
    2465                      .dwattr $C$DW$143, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x02)
    2466                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$144       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$144, DW_AT_name("MFIE")
    2471                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_MFIE")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   52

    2472                      .dwattr $C$DW$144, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2473                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2474                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$145       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    2478                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    2479                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2480                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2482                      .dwendtag $C$DW$T$42
    2483              
    2484              
    2485              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2486                      .dwattr $C$DW$T$43, DW_AT_name("SDCPARM4_REG")
    2487                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2488              $C$DW$146       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2490                      .dwattr $C$DW$146, DW_AT_name("all")
    2491                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_all")
    2492                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2494              $C$DW$147       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$42)
    2496                      .dwattr $C$DW$147, DW_AT_name("bit")
    2497                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_bit")
    2498                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2499                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2500                      .dwendtag $C$DW$T$43
    2501              
    2502              
    2503              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2504                      .dwattr $C$DW$T$44, DW_AT_name("SDCTLPARM1_BITS")
    2505                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2506              $C$DW$148       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2508                      .dwattr $C$DW$148, DW_AT_name("MOD")
    2509                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_MOD")
    2510                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2511                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2513              $C$DW$149       .dwtag  DW_TAG_member
    2514                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2515                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    2516                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    2517                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2518                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2519                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2520              $C$DW$150       .dwtag  DW_TAG_member
    2521                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2522                      .dwattr $C$DW$150, DW_AT_name("rsvd2")
    2523                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd2")
    2524                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2525                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2526                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   53

    2527              $C$DW$151       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2529                      .dwattr $C$DW$151, DW_AT_name("rsvd3")
    2530                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd3")
    2531                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2532                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$152       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$152, DW_AT_name("rsvd4")
    2537                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd4")
    2538                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    2539                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2540                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2541                      .dwendtag $C$DW$T$44
    2542              
    2543              
    2544              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2545                      .dwattr $C$DW$T$45, DW_AT_name("SDCTLPARM1_REG")
    2546                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2547              $C$DW$153       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$153, DW_AT_name("all")
    2550                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    2551                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2552                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2553              $C$DW$154       .dwtag  DW_TAG_member
    2554                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$44)
    2555                      .dwattr $C$DW$154, DW_AT_name("bit")
    2556                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    2557                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2559                      .dwendtag $C$DW$T$45
    2560              
    2561              
    2562              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2563                      .dwattr $C$DW$T$46, DW_AT_name("SDCTLPARM2_BITS")
    2564                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2565              $C$DW$155       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$155, DW_AT_name("MOD")
    2568                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_MOD")
    2569                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2570                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$156       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2574                      .dwattr $C$DW$156, DW_AT_name("rsvd1")
    2575                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd1")
    2576                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2577                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2578                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2579              $C$DW$157       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2581                      .dwattr $C$DW$157, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   54

    2582                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd2")
    2583                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2584                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2585                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2586              $C$DW$158       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2588                      .dwattr $C$DW$158, DW_AT_name("rsvd3")
    2589                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd3")
    2590                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2591                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2592                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2593              $C$DW$159       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2595                      .dwattr $C$DW$159, DW_AT_name("MS")
    2596                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_MS")
    2597                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    2598                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2600                      .dwendtag $C$DW$T$46
    2601              
    2602              
    2603              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2604                      .dwattr $C$DW$T$47, DW_AT_name("SDCTLPARM2_REG")
    2605                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2606              $C$DW$160       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2608                      .dwattr $C$DW$160, DW_AT_name("all")
    2609                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    2610                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2611                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2612              $C$DW$161       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$46)
    2614                      .dwattr $C$DW$161, DW_AT_name("bit")
    2615                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    2616                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2618                      .dwendtag $C$DW$T$47
    2619              
    2620              
    2621              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2622                      .dwattr $C$DW$T$48, DW_AT_name("SDCTLPARM3_BITS")
    2623                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2624              $C$DW$162       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2626                      .dwattr $C$DW$162, DW_AT_name("MOD")
    2627                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_MOD")
    2628                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2629                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2630                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2631              $C$DW$163       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2633                      .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2634                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd1")
    2635                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2636                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   55

    2637                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$164       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    2641                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
    2642                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2643                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2645              $C$DW$165       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2647                      .dwattr $C$DW$165, DW_AT_name("rsvd3")
    2648                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd3")
    2649                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2650                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$166       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2654                      .dwattr $C$DW$166, DW_AT_name("MS")
    2655                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_MS")
    2656                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    2657                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2658                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2659                      .dwendtag $C$DW$T$48
    2660              
    2661              
    2662              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2663                      .dwattr $C$DW$T$49, DW_AT_name("SDCTLPARM3_REG")
    2664                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2665              $C$DW$167       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2667                      .dwattr $C$DW$167, DW_AT_name("all")
    2668                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    2669                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2671              $C$DW$168       .dwtag  DW_TAG_member
    2672                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$48)
    2673                      .dwattr $C$DW$168, DW_AT_name("bit")
    2674                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    2675                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2676                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2677                      .dwendtag $C$DW$T$49
    2678              
    2679              
    2680              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2681                      .dwattr $C$DW$T$50, DW_AT_name("SDCTLPARM4_BITS")
    2682                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2683              $C$DW$169       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2685                      .dwattr $C$DW$169, DW_AT_name("MOD")
    2686                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_MOD")
    2687                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2688                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2689                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2690              $C$DW$170       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   56

    2692                      .dwattr $C$DW$170, DW_AT_name("rsvd1")
    2693                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd1")
    2694                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2695                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2696                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2697              $C$DW$171       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$171, DW_AT_name("rsvd2")
    2700                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd2")
    2701                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2702                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2703                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$172       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2706                      .dwattr $C$DW$172, DW_AT_name("rsvd3")
    2707                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd3")
    2708                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2709                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2710                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2711              $C$DW$173       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2713                      .dwattr $C$DW$173, DW_AT_name("MS")
    2714                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_MS")
    2715                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
    2716                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2717                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2718                      .dwendtag $C$DW$T$50
    2719              
    2720              
    2721              $C$DW$T$51      .dwtag  DW_TAG_union_type
    2722                      .dwattr $C$DW$T$51, DW_AT_name("SDCTLPARM4_REG")
    2723                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2724              $C$DW$174       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$174, DW_AT_name("all")
    2727                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_all")
    2728                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2729                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$175       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$50)
    2732                      .dwattr $C$DW$175, DW_AT_name("bit")
    2733                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_bit")
    2734                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2735                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2736                      .dwendtag $C$DW$T$51
    2737              
    2738              
    2739              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2740                      .dwattr $C$DW$T$52, DW_AT_name("SDCTL_BITS")
    2741                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2742              $C$DW$176       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2744                      .dwattr $C$DW$176, DW_AT_name("rsvd1")
    2745                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd1")
    2746                      .dwattr $C$DW$176, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x0d)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   57

    2747                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2749              $C$DW$177       .dwtag  DW_TAG_member
    2750                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2751                      .dwattr $C$DW$177, DW_AT_name("MIE")
    2752                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_MIE")
    2753                      .dwattr $C$DW$177, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2754                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2755                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$178       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2758                      .dwattr $C$DW$178, DW_AT_name("rsvd2")
    2759                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd2")
    2760                      .dwattr $C$DW$178, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2761                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2762                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2763              $C$DW$179       .dwtag  DW_TAG_member
    2764                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2765                      .dwattr $C$DW$179, DW_AT_name("rsvd3")
    2766                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd3")
    2767                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2768                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2769                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2770                      .dwendtag $C$DW$T$52
    2771              
    2772              
    2773              $C$DW$T$53      .dwtag  DW_TAG_union_type
    2774                      .dwattr $C$DW$T$53, DW_AT_name("SDCTL_REG")
    2775                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    2776              $C$DW$180       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2778                      .dwattr $C$DW$180, DW_AT_name("all")
    2779                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    2780                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$181       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$52)
    2784                      .dwattr $C$DW$181, DW_AT_name("bit")
    2785                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    2786                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2787                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2788                      .dwendtag $C$DW$T$53
    2789              
    2790              
    2791              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2792                      .dwattr $C$DW$T$54, DW_AT_name("SDDATA1_BITS")
    2793                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2794              $C$DW$182       .dwtag  DW_TAG_member
    2795                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2796                      .dwattr $C$DW$182, DW_AT_name("DATA16")
    2797                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_DATA16")
    2798                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2799                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2801              $C$DW$183       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   58

    2802                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2803                      .dwattr $C$DW$183, DW_AT_name("DATA32HI")
    2804                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DATA32HI")
    2805                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2806                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2807                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2808                      .dwendtag $C$DW$T$54
    2809              
    2810              
    2811              $C$DW$T$56      .dwtag  DW_TAG_union_type
    2812                      .dwattr $C$DW$T$56, DW_AT_name("SDDATA1_REG")
    2813                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    2814              $C$DW$184       .dwtag  DW_TAG_member
    2815                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$55)
    2816                      .dwattr $C$DW$184, DW_AT_name("all")
    2817                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    2818                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2820              $C$DW$185       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$54)
    2822                      .dwattr $C$DW$185, DW_AT_name("bit")
    2823                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    2824                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2825                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2826                      .dwendtag $C$DW$T$56
    2827              
    2828              
    2829              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2830                      .dwattr $C$DW$T$57, DW_AT_name("SDDATA2_BITS")
    2831                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
    2832              $C$DW$186       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2834                      .dwattr $C$DW$186, DW_AT_name("DATA16")
    2835                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_DATA16")
    2836                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2837                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2838                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2839              $C$DW$187       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2841                      .dwattr $C$DW$187, DW_AT_name("DATA32HI")
    2842                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DATA32HI")
    2843                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2844                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2845                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2846                      .dwendtag $C$DW$T$57
    2847              
    2848              
    2849              $C$DW$T$58      .dwtag  DW_TAG_union_type
    2850                      .dwattr $C$DW$T$58, DW_AT_name("SDDATA2_REG")
    2851                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    2852              $C$DW$188       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$55)
    2854                      .dwattr $C$DW$188, DW_AT_name("all")
    2855                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    2856                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   59

    2857                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$189       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$57)
    2860                      .dwattr $C$DW$189, DW_AT_name("bit")
    2861                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    2862                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2863                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2864                      .dwendtag $C$DW$T$58
    2865              
    2866              
    2867              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2868                      .dwattr $C$DW$T$59, DW_AT_name("SDDATA3_BITS")
    2869                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    2870              $C$DW$190       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2872                      .dwattr $C$DW$190, DW_AT_name("DATA16")
    2873                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DATA16")
    2874                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2875                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$191       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2879                      .dwattr $C$DW$191, DW_AT_name("DATA32HI")
    2880                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DATA32HI")
    2881                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2882                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2883                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2884                      .dwendtag $C$DW$T$59
    2885              
    2886              
    2887              $C$DW$T$60      .dwtag  DW_TAG_union_type
    2888                      .dwattr $C$DW$T$60, DW_AT_name("SDDATA3_REG")
    2889                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    2890              $C$DW$192       .dwtag  DW_TAG_member
    2891                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$55)
    2892                      .dwattr $C$DW$192, DW_AT_name("all")
    2893                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_all")
    2894                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2895                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2896              $C$DW$193       .dwtag  DW_TAG_member
    2897                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$59)
    2898                      .dwattr $C$DW$193, DW_AT_name("bit")
    2899                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_bit")
    2900                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2901                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2902                      .dwendtag $C$DW$T$60
    2903              
    2904              
    2905              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    2906                      .dwattr $C$DW$T$61, DW_AT_name("SDDATA4_BITS")
    2907                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
    2908              $C$DW$194       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2910                      .dwattr $C$DW$194, DW_AT_name("DATA16")
    2911                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DATA16")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   60

    2912                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2913                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2914                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2915              $C$DW$195       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2917                      .dwattr $C$DW$195, DW_AT_name("DATA32HI")
    2918                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DATA32HI")
    2919                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2920                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2921                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2922                      .dwendtag $C$DW$T$61
    2923              
    2924              
    2925              $C$DW$T$62      .dwtag  DW_TAG_union_type
    2926                      .dwattr $C$DW$T$62, DW_AT_name("SDDATA4_REG")
    2927                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    2928              $C$DW$196       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$55)
    2930                      .dwattr $C$DW$196, DW_AT_name("all")
    2931                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    2932                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2934              $C$DW$197       .dwtag  DW_TAG_member
    2935                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$61)
    2936                      .dwattr $C$DW$197, DW_AT_name("bit")
    2937                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    2938                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2939                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2940                      .dwendtag $C$DW$T$62
    2941              
    2942              
    2943              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    2944                      .dwattr $C$DW$T$63, DW_AT_name("SDDFPARM1_BITS")
    2945                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    2946              $C$DW$198       .dwtag  DW_TAG_member
    2947                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2948                      .dwattr $C$DW$198, DW_AT_name("DOSR")
    2949                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_DOSR")
    2950                      .dwattr $C$DW$198, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2951                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2953              $C$DW$199       .dwtag  DW_TAG_member
    2954                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2955                      .dwattr $C$DW$199, DW_AT_name("FEN")
    2956                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_FEN")
    2957                      .dwattr $C$DW$199, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2958                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2959                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2960              $C$DW$200       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2962                      .dwattr $C$DW$200, DW_AT_name("AE")
    2963                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_AE")
    2964                      .dwattr $C$DW$200, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2965                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   61

    2967              $C$DW$201       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2969                      .dwattr $C$DW$201, DW_AT_name("SST")
    2970                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SST")
    2971                      .dwattr $C$DW$201, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2972                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2973                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2974              $C$DW$202       .dwtag  DW_TAG_member
    2975                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2976                      .dwattr $C$DW$202, DW_AT_name("FILRESEN")
    2977                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_FILRESEN")
    2978                      .dwattr $C$DW$202, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2979                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2980                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2981              $C$DW$203       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2983                      .dwattr $C$DW$203, DW_AT_name("rsvd1")
    2984                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd1")
    2985                      .dwattr $C$DW$203, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    2986                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2987                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2988                      .dwendtag $C$DW$T$63
    2989              
    2990              
    2991              $C$DW$T$64      .dwtag  DW_TAG_union_type
    2992                      .dwattr $C$DW$T$64, DW_AT_name("SDDFPARM1_REG")
    2993                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    2994              $C$DW$204       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2996                      .dwattr $C$DW$204, DW_AT_name("all")
    2997                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_all")
    2998                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2999                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3000              $C$DW$205       .dwtag  DW_TAG_member
    3001                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$63)
    3002                      .dwattr $C$DW$205, DW_AT_name("bit")
    3003                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_bit")
    3004                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3005                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3006                      .dwendtag $C$DW$T$64
    3007              
    3008              
    3009              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3010                      .dwattr $C$DW$T$65, DW_AT_name("SDDFPARM2_BITS")
    3011                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3012              $C$DW$206       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3014                      .dwattr $C$DW$206, DW_AT_name("DOSR")
    3015                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_DOSR")
    3016                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3017                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3018                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3019              $C$DW$207       .dwtag  DW_TAG_member
    3020                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3021                      .dwattr $C$DW$207, DW_AT_name("FEN")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   62

    3022                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_FEN")
    3023                      .dwattr $C$DW$207, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3024                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$208       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3028                      .dwattr $C$DW$208, DW_AT_name("AE")
    3029                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AE")
    3030                      .dwattr $C$DW$208, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3031                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$209       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$209, DW_AT_name("SST")
    3036                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_SST")
    3037                      .dwattr $C$DW$209, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3038                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3039                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$210       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3042                      .dwattr $C$DW$210, DW_AT_name("FILRESEN")
    3043                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_FILRESEN")
    3044                      .dwattr $C$DW$210, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3045                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3046                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$211       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3049                      .dwattr $C$DW$211, DW_AT_name("rsvd1")
    3050                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd1")
    3051                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    3052                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3053                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3054                      .dwendtag $C$DW$T$65
    3055              
    3056              
    3057              $C$DW$T$66      .dwtag  DW_TAG_union_type
    3058                      .dwattr $C$DW$T$66, DW_AT_name("SDDFPARM2_REG")
    3059                      .dwattr $C$DW$T$66, DW_AT_byte_size(0x01)
    3060              $C$DW$212       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3062                      .dwattr $C$DW$212, DW_AT_name("all")
    3063                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_all")
    3064                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3065                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3066              $C$DW$213       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$65)
    3068                      .dwattr $C$DW$213, DW_AT_name("bit")
    3069                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_bit")
    3070                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3072                      .dwendtag $C$DW$T$66
    3073              
    3074              
    3075              $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3076                      .dwattr $C$DW$T$67, DW_AT_name("SDDFPARM3_BITS")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   63

    3077                      .dwattr $C$DW$T$67, DW_AT_byte_size(0x01)
    3078              $C$DW$214       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3080                      .dwattr $C$DW$214, DW_AT_name("DOSR")
    3081                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_DOSR")
    3082                      .dwattr $C$DW$214, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3083                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3084                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3085              $C$DW$215       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3087                      .dwattr $C$DW$215, DW_AT_name("FEN")
    3088                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_FEN")
    3089                      .dwattr $C$DW$215, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3090                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3091                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3092              $C$DW$216       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3094                      .dwattr $C$DW$216, DW_AT_name("AE")
    3095                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_AE")
    3096                      .dwattr $C$DW$216, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3097                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3098                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$217       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3101                      .dwattr $C$DW$217, DW_AT_name("SST")
    3102                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_SST")
    3103                      .dwattr $C$DW$217, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3104                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$218       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3108                      .dwattr $C$DW$218, DW_AT_name("FILRESEN")
    3109                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_FILRESEN")
    3110                      .dwattr $C$DW$218, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3111                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$219       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3115                      .dwattr $C$DW$219, DW_AT_name("rsvd1")
    3116                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd1")
    3117                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    3118                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3119                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3120                      .dwendtag $C$DW$T$67
    3121              
    3122              
    3123              $C$DW$T$68      .dwtag  DW_TAG_union_type
    3124                      .dwattr $C$DW$T$68, DW_AT_name("SDDFPARM3_REG")
    3125                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x01)
    3126              $C$DW$220       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3128                      .dwattr $C$DW$220, DW_AT_name("all")
    3129                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_all")
    3130                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3131                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:37 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_sdfm_drivers.asm                                             PAGE   64

    3132              $C$DW$221       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$67)
    3134                      .dwattr $C$DW$221, DW_AT_name("bit")
    3135                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_bit")
    3136                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3137                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3138                      .dwendtag $C$DW$T$68
    3139              
    3140              
    3141              $C$DW$T$69      .dwtag  DW_TAG_structure_type
    3142                      .dwattr $C$DW$T$69, DW_AT_name("SDDFPARM4_BITS")
    3143                      .dwattr $C$DW$T$69, DW_AT_byte_size(0x01)
    3144              $C$DW$222       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3146                      .dwattr $C$DW$222, DW_AT_name("DOSR")
    3147                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_DOSR")
    3148                      .dwattr $C$DW$222, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3149                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3150                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3151              $C$DW$223       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3153                      .dwattr $C$DW$223, DW_AT_name("FEN")
