TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:37:31 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CLA1_3_ISR")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CLA1_3_ISR")

    1108                      .global _FLASH_CORRECTABLE_ERROR_ISR
    1109                      .global _RAM_CORRECTABLE_ERROR_ISR
    1110                      .global _SYS_PLL_SLIP_ISR
    1111                      .global _RAM_ACCESS_VIOLATION_ISR
    1112                      .global _EPWM11_TZ_ISR
    1113                      .global _EPWM10_TZ_ISR
    1114                      .global _EPWM9_ISR
    1115                      .global _EPWM12_TZ_ISR
    1116                      .global _IPC2_ISR
    1117                      .global _IPC1_ISR
    1118                      .global _EPWM9_TZ_ISR
    1119                      .global _IPC3_ISR
    1120                      .global _EPWM10_ISR
    1121                      .global _SPIC_TX_ISR
    1122                      .global _SPIC_RX_ISR
    1123                      .global _USBA_ISR
    1124                      .global _UPPA_ISR
    1125                      .global _EPWM12_ISR
    1126                      .global _EPWM11_ISR
    1127                      .global _SD2_ISR
    1128                      .global _SD1_ISR
    1129                      .global _XINT1_ISR
    1130                      .global _ADCC1_ISR
    1131                      .global _ADCD1_ISR
    1132                      .global _XINT2_ISR
    1133                      .global _USER12_ISR
    1134                      .global _USER11_ISR
    1135                      .global _ADCB1_ISR
    1136                      .global _ADCA1_ISR
    1137                      .global _TIMER0_ISR
    1138                      .global _EPWM5_TZ_ISR
    1139                      .global _EPWM4_TZ_ISR
    1140                      .global _EPWM7_TZ_ISR
    1141                      .global _EPWM6_TZ_ISR
    1142                      .global _EPWM1_TZ_ISR
    1143                      .global _WAKE_ISR
    1144                      .global _EPWM3_TZ_ISR
    1145                      .global _EPWM2_TZ_ISR
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   26

    1146                      .global _NMI_ISR
    1147                      .global _EMU_ISR
    1148                      .global _USER1_ISR
    1149                      .global _ILLEGAL_ISR
    1150                      .global _TIMER2_ISR
    1151                      .global _TIMER1_ISR
    1152                      .global _RTOS_ISR
    1153                      .global _DATALOG_ISR
    1154                      .global _USER2_ISR
    1155                      .global _USER8_ISR
    1156                      .global _USER7_ISR
    1157                      .global _USER10_ISR
    1158                      .global _USER9_ISR
    1159                      .global _USER4_ISR
    1160                      .global _USER3_ISR
    1161                      .global _USER6_ISR
    1162                      .global _USER5_ISR
    1163                      .global _EPWM8_TZ_ISR
    1164                      .global _MCBSPA_TX_ISR
    1165                      .global _MCBSPA_RX_ISR
    1166                      .global _MCBSPB_TX_ISR
    1167                      .global _MCBSPB_RX_ISR
    1168                      .global _SPIA_TX_ISR
    1169                      .global _SPIA_RX_ISR
    1170                      .global _SPIB_TX_ISR
    1171                      .global _SPIB_RX_ISR
    1172                      .global _DMA_CH1_ISR
    1173                      .global _I2CA_ISR
    1174                      .global _DMA_CH6_ISR
    1175                      .global _I2CB_ISR
    1176                      .global _I2CA_FIFO_ISR
    1177                      .global _DMA_CH3_ISR
    1178                      .global _DMA_CH2_ISR
    1179                      .global _DMA_CH5_ISR
    1180                      .global _DMA_CH4_ISR
    1181                      .global _EPWM6_ISR
    1182                      .global _EPWM5_ISR
    1183                      .global _EPWM8_ISR
    1184                      .global _EPWM7_ISR
    1185                      .global _EPWM2_ISR
    1186                      .global _EPWM1_ISR
    1187                      .global _EPWM4_ISR
    1188                      .global _EPWM3_ISR
    1189                      .global _ECAP1_ISR
    1190                      .global _EQEP1_ISR
    1191                      .global _ECAP6_ISR
    1192                      .global _EQEP3_ISR
    1193                      .global _EQEP2_ISR
    1194                      .global _ECAP3_ISR
    1195                      .global _ECAP2_ISR
    1196                      .global _ECAP5_ISR
    1197                      .global _ECAP4_ISR
    1198                      .global _I2CB_FIFO_ISR
    1199                      .global _PieCtrlRegs
    1200                      .global _PieVectTable
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   27

    1201              
    1202              ;***************************************************************
    1203              ;* TYPE INFORMATION                                            *
    1204              ;***************************************************************
    1205              
    1206              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1207                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1208                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1209              $C$DW$148       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$148, DW_AT_name("ACK1")
    1212                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ACK1")
    1213                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$149       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$149, DW_AT_name("ACK2")
    1219                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ACK2")
    1220                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1221                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$150       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$150, DW_AT_name("ACK3")
    1226                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ACK3")
    1227                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1228                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$151       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$151, DW_AT_name("ACK4")
    1233                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK4")
    1234                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1235                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$152       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$152, DW_AT_name("ACK5")
    1240                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK5")
    1241                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1242                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$153       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$153, DW_AT_name("ACK6")
    1247                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK6")
    1248                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1251              $C$DW$154       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$154, DW_AT_name("ACK7")
    1254                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK7")
    1255                      .dwattr $C$DW$154, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   28

    1256                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$155       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$155, DW_AT_name("ACK8")
    1261                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK8")
    1262                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$156       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$156, DW_AT_name("ACK9")
    1268                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK9")
    1269                      .dwattr $C$DW$156, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1270                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$157       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$157, DW_AT_name("ACK10")
    1275                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK10")
    1276                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$158       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$158, DW_AT_name("ACK11")
    1282                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK11")
    1283                      .dwattr $C$DW$158, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$159       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$159, DW_AT_name("ACK12")
    1289                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ACK12")
    1290                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1291                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$160       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    1296                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    1297                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1298                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1300                      .dwendtag $C$DW$T$20
    1301              
    1302              
    1303              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1304                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1305                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1306              $C$DW$161       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$161, DW_AT_name("all")
    1309                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    1310                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   29

    1311                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$162       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1314                      .dwattr $C$DW$162, DW_AT_name("bit")
    1315                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    1316                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1318                      .dwendtag $C$DW$T$21
    1319              
    1320              
    1321              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1322                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1323                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1324              $C$DW$163       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$163, DW_AT_name("ENPIE")
    1327                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ENPIE")
    1328                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$164       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$164, DW_AT_name("PIEVECT")
    1334                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PIEVECT")
    1335                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1336                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1338                      .dwendtag $C$DW$T$22
    1339              
    1340              
    1341              $C$DW$T$23      .dwtag  DW_TAG_union_type
    1342                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1343                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1344              $C$DW$165       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$165, DW_AT_name("all")
    1347                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1348                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$166       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1352                      .dwattr $C$DW$166, DW_AT_name("bit")
    1353                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1354                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1356                      .dwendtag $C$DW$T$23
    1357              
    1358              
    1359              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1360                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1361                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1362              $C$DW$167       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$167, DW_AT_name("INTx1")
    1365                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   30

    1366                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1367                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$168       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$168, DW_AT_name("INTx2")
    1372                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx2")
    1373                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1374                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$169       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$169, DW_AT_name("INTx3")
    1379                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx3")
    1380                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$170       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$170, DW_AT_name("INTx4")
    1386                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx4")
    1387                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1388                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$171       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$171, DW_AT_name("INTx5")
    1393                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx5")
    1394                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1395                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$172       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$172, DW_AT_name("INTx6")
    1400                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx6")
    1401                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1402                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$173       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1406                      .dwattr $C$DW$173, DW_AT_name("INTx7")
    1407                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_INTx7")
    1408                      .dwattr $C$DW$173, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$174       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1413                      .dwattr $C$DW$174, DW_AT_name("INTx8")
    1414                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTx8")
    1415                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1416                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$175       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1420                      .dwattr $C$DW$175, DW_AT_name("INTx9")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   31

    1421                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx9")
    1422                      .dwattr $C$DW$175, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1423                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$176       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$176, DW_AT_name("INTx10")
    1428                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx10")
    1429                      .dwattr $C$DW$176, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1430                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$177       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$177, DW_AT_name("INTx11")
    1435                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx11")
    1436                      .dwattr $C$DW$177, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$178       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$178, DW_AT_name("INTx12")
    1442                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx12")
    1443                      .dwattr $C$DW$178, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1444                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1446              $C$DW$179       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1448                      .dwattr $C$DW$179, DW_AT_name("INTx13")
    1449                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx13")
    1450                      .dwattr $C$DW$179, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1451                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$180       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1455                      .dwattr $C$DW$180, DW_AT_name("INTx14")
    1456                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx14")
    1457                      .dwattr $C$DW$180, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1458                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$181       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1462                      .dwattr $C$DW$181, DW_AT_name("INTx15")
    1463                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx15")
    1464                      .dwattr $C$DW$181, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1465                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1467              $C$DW$182       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1469                      .dwattr $C$DW$182, DW_AT_name("INTx16")
    1470                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx16")
    1471                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1472                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1474                      .dwendtag $C$DW$T$24
    1475              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   32

    1476              
    1477              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1478                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1479                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1480              $C$DW$183       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$183, DW_AT_name("all")
    1483                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    1484                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1486              $C$DW$184       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$24)
    1488                      .dwattr $C$DW$184, DW_AT_name("bit")
    1489                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    1490                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1492                      .dwendtag $C$DW$T$25
    1493              
    1494              
    1495              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1496                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1497                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1498              $C$DW$185       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$185, DW_AT_name("INTx1")
    1501                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx1")
    1502                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1503                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1505              $C$DW$186       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$186, DW_AT_name("INTx2")
    1508                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx2")
    1509                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1510                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1512              $C$DW$187       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$187, DW_AT_name("INTx3")
    1515                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx3")
    1516                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1517                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1519              $C$DW$188       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1521                      .dwattr $C$DW$188, DW_AT_name("INTx4")
    1522                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx4")
    1523                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1524                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1526              $C$DW$189       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1528                      .dwattr $C$DW$189, DW_AT_name("INTx5")
    1529                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx5")
    1530                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   33

    1531                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1532                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$190       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$190, DW_AT_name("INTx6")
    1536                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx6")
    1537                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1538                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$191       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$191, DW_AT_name("INTx7")
    1543                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTx7")
    1544                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1545                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$192       .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$192, DW_AT_name("INTx8")
    1550                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_INTx8")
    1551                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1552                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1554              $C$DW$193       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1556                      .dwattr $C$DW$193, DW_AT_name("INTx9")
    1557                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx9")
    1558                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1559                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1561              $C$DW$194       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1563                      .dwattr $C$DW$194, DW_AT_name("INTx10")
    1564                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx10")
    1565                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1566                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1567                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$195       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1570                      .dwattr $C$DW$195, DW_AT_name("INTx11")
    1571                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx11")
    1572                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1573                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1575              $C$DW$196       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1577                      .dwattr $C$DW$196, DW_AT_name("INTx12")
    1578                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx12")
    1579                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1580                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1582              $C$DW$197       .dwtag  DW_TAG_member
    1583                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1584                      .dwattr $C$DW$197, DW_AT_name("INTx13")
    1585                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx13")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   34

    1586                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1587                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$198       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1591                      .dwattr $C$DW$198, DW_AT_name("INTx14")
    1592                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx14")
    1593                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1594                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1596              $C$DW$199       .dwtag  DW_TAG_member
    1597                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1598                      .dwattr $C$DW$199, DW_AT_name("INTx15")
    1599                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx15")
    1600                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1601                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1603              $C$DW$200       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1605                      .dwattr $C$DW$200, DW_AT_name("INTx16")
    1606                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx16")
    1607                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1608                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1610                      .dwendtag $C$DW$T$26
    1611              
    1612              
    1613              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1614                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    1615                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1616              $C$DW$201       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$201, DW_AT_name("all")
    1619                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    1620                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$202       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    1624                      .dwattr $C$DW$202, DW_AT_name("bit")
    1625                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    1626                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1628                      .dwendtag $C$DW$T$27
    1629              
    1630              
    1631              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1632                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    1633                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1634              $C$DW$203       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    1636                      .dwattr $C$DW$203, DW_AT_name("INTx1")
    1637                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_INTx1")
    1638                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1639                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   35

    1641              $C$DW$204       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$204, DW_AT_name("INTx2")
    1644                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx2")
    1645                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1646                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1647                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1648              $C$DW$205       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1650                      .dwattr $C$DW$205, DW_AT_name("INTx3")
    1651                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx3")
    1652                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1653                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$206       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    1657                      .dwattr $C$DW$206, DW_AT_name("INTx4")
    1658                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx4")
    1659                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1660                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1662              $C$DW$207       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$207, DW_AT_name("INTx5")
    1665                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx5")
    1666                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1667                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$208       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$208, DW_AT_name("INTx6")
    1672                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx6")
    1673                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1674                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1676              $C$DW$209       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    1678                      .dwattr $C$DW$209, DW_AT_name("INTx7")
    1679                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx7")
    1680                      .dwattr $C$DW$209, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1681                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$210       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    1685                      .dwattr $C$DW$210, DW_AT_name("INTx8")
    1686                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx8")
    1687                      .dwattr $C$DW$210, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1688                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$211       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$211, DW_AT_name("INTx9")
    1693                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx9")
    1694                      .dwattr $C$DW$211, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1695                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   36

    1696                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1697              $C$DW$212       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    1699                      .dwattr $C$DW$212, DW_AT_name("INTx10")
    1700                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_INTx10")
    1701                      .dwattr $C$DW$212, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1702                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1703                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1704              $C$DW$213       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$213, DW_AT_name("INTx11")
    1707                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_INTx11")
    1708                      .dwattr $C$DW$213, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1709                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$214       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    1713                      .dwattr $C$DW$214, DW_AT_name("INTx12")
    1714                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_INTx12")
    1715                      .dwattr $C$DW$214, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1716                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1718              $C$DW$215       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    1720                      .dwattr $C$DW$215, DW_AT_name("INTx13")
    1721                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_INTx13")
    1722                      .dwattr $C$DW$215, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1723                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1724                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$216       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$216, DW_AT_name("INTx14")
    1728                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_INTx14")
    1729                      .dwattr $C$DW$216, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1730                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1731                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1732              $C$DW$217       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    1734                      .dwattr $C$DW$217, DW_AT_name("INTx15")
    1735                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_INTx15")
    1736                      .dwattr $C$DW$217, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1737                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1739              $C$DW$218       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    1741                      .dwattr $C$DW$218, DW_AT_name("INTx16")
    1742                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_INTx16")
    1743                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1744                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1746                      .dwendtag $C$DW$T$28
    1747              
    1748              
    1749              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1750                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   37

    1751                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1752              $C$DW$219       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$219, DW_AT_name("all")
    1755                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    1756                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$220       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$28)
    1760                      .dwattr $C$DW$220, DW_AT_name("bit")
    1761                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    1762                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1764                      .dwendtag $C$DW$T$29
    1765              
    1766              
    1767              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1768                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    1769                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1770              $C$DW$221       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$221, DW_AT_name("INTx1")
    1773                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_INTx1")
    1774                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1775                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$222       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$222, DW_AT_name("INTx2")
    1780                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_INTx2")
    1781                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1782                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1784              $C$DW$223       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$223, DW_AT_name("INTx3")
    1787                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_INTx3")
    1788                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1789                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1790                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$224       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    1793                      .dwattr $C$DW$224, DW_AT_name("INTx4")
    1794                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_INTx4")
    1795                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1796                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1797                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1798              $C$DW$225       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    1800                      .dwattr $C$DW$225, DW_AT_name("INTx5")
    1801                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_INTx5")
    1802                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1804                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1805              $C$DW$226       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   38

    1806                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    1807                      .dwattr $C$DW$226, DW_AT_name("INTx6")
    1808                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_INTx6")
    1809                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1810                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1811                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1812              $C$DW$227       .dwtag  DW_TAG_member
    1813                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    1814                      .dwattr $C$DW$227, DW_AT_name("INTx7")
    1815                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_INTx7")
    1816                      .dwattr $C$DW$227, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1817                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$228       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    1821                      .dwattr $C$DW$228, DW_AT_name("INTx8")
    1822                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_INTx8")
    1823                      .dwattr $C$DW$228, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1824                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1825                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1826              $C$DW$229       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    1828                      .dwattr $C$DW$229, DW_AT_name("INTx9")
    1829                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_INTx9")
    1830                      .dwattr $C$DW$229, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1831                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1833              $C$DW$230       .dwtag  DW_TAG_member
    1834                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    1835                      .dwattr $C$DW$230, DW_AT_name("INTx10")
    1836                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_INTx10")
    1837                      .dwattr $C$DW$230, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1838                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1839                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1840              $C$DW$231       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    1842                      .dwattr $C$DW$231, DW_AT_name("INTx11")
    1843                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_INTx11")
    1844                      .dwattr $C$DW$231, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1845                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1847              $C$DW$232       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$232, DW_AT_name("INTx12")
    1850                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_INTx12")
    1851                      .dwattr $C$DW$232, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1854              $C$DW$233       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    1856                      .dwattr $C$DW$233, DW_AT_name("INTx13")
    1857                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_INTx13")
    1858                      .dwattr $C$DW$233, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1859                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   39

    1861              $C$DW$234       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    1863                      .dwattr $C$DW$234, DW_AT_name("INTx14")
    1864                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_INTx14")
    1865                      .dwattr $C$DW$234, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1868              $C$DW$235       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$235, DW_AT_name("INTx15")
    1871                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_INTx15")
    1872                      .dwattr $C$DW$235, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1873                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$236       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$236, DW_AT_name("INTx16")
    1878                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_INTx16")
    1879                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1880                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1882                      .dwendtag $C$DW$T$30
    1883              
    1884              
    1885              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1886                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    1887                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1888              $C$DW$237       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    1890                      .dwattr $C$DW$237, DW_AT_name("all")
    1891                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_all")
    1892                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1894              $C$DW$238       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$30)
    1896                      .dwattr $C$DW$238, DW_AT_name("bit")
    1897                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_bit")
    1898                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1900                      .dwendtag $C$DW$T$31
    1901              
    1902              
    1903              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1904                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    1905                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1906              $C$DW$239       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    1908                      .dwattr $C$DW$239, DW_AT_name("INTx1")
    1909                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_INTx1")
    1910                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1913              $C$DW$240       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$240, DW_AT_name("INTx2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   40

    1916                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_INTx2")
    1917                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1918                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$241       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    1922                      .dwattr $C$DW$241, DW_AT_name("INTx3")
    1923                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INTx3")
    1924                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1926                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$242       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$242, DW_AT_name("INTx4")
    1930                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_INTx4")
    1931                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1932                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1934              $C$DW$243       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    1936                      .dwattr $C$DW$243, DW_AT_name("INTx5")
    1937                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_INTx5")
    1938                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1939                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$244       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    1943                      .dwattr $C$DW$244, DW_AT_name("INTx6")
    1944                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTx6")
    1945                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1946                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1948              $C$DW$245       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    1950                      .dwattr $C$DW$245, DW_AT_name("INTx7")
    1951                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_INTx7")
    1952                      .dwattr $C$DW$245, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1953                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1955              $C$DW$246       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    1957                      .dwattr $C$DW$246, DW_AT_name("INTx8")
    1958                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_INTx8")
    1959                      .dwattr $C$DW$246, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1960                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$247       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$247, DW_AT_name("INTx9")
    1965                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_INTx9")
    1966                      .dwattr $C$DW$247, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1967                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$248       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   41

    1971                      .dwattr $C$DW$248, DW_AT_name("INTx10")
    1972                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INTx10")
    1973                      .dwattr $C$DW$248, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1974                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$249       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$249, DW_AT_name("INTx11")
    1979                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_INTx11")
    1980                      .dwattr $C$DW$249, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1981                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$250       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$250, DW_AT_name("INTx12")
    1986                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_INTx12")
    1987                      .dwattr $C$DW$250, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1990              $C$DW$251       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    1992                      .dwattr $C$DW$251, DW_AT_name("INTx13")
    1993                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_INTx13")
    1994                      .dwattr $C$DW$251, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1995                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1997              $C$DW$252       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$252, DW_AT_name("INTx14")
    2000                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_INTx14")
    2001                      .dwattr $C$DW$252, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2002                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$253       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2006                      .dwattr $C$DW$253, DW_AT_name("INTx15")
    2007                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_INTx15")
    2008                      .dwattr $C$DW$253, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$254       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2013                      .dwattr $C$DW$254, DW_AT_name("INTx16")
    2014                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_INTx16")
    2015                      .dwattr $C$DW$254, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2016                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2018                      .dwendtag $C$DW$T$32
    2019              
    2020              
    2021              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2022                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    2023                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2024              $C$DW$255       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   42

    2026                      .dwattr $C$DW$255, DW_AT_name("all")
    2027                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_all")
    2028                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2029                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$256       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$32)
    2032                      .dwattr $C$DW$256, DW_AT_name("bit")
    2033                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_bit")
    2034                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2036                      .dwendtag $C$DW$T$33
    2037              
    2038              
    2039              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2040                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    2041                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2042              $C$DW$257       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$257, DW_AT_name("INTx1")
    2045                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_INTx1")
    2046                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2047                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$258       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2051                      .dwattr $C$DW$258, DW_AT_name("INTx2")
    2052                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_INTx2")
    2053                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2054                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$259       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2058                      .dwattr $C$DW$259, DW_AT_name("INTx3")
    2059                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_INTx3")
    2060                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2061                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2063              $C$DW$260       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2065                      .dwattr $C$DW$260, DW_AT_name("INTx4")
    2066                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_INTx4")
    2067                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2068                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$261       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$261, DW_AT_name("INTx5")
    2073                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_INTx5")
    2074                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$262       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$262, DW_AT_name("INTx6")
    2080                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_INTx6")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   43

    2081                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2082                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2083                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2084              $C$DW$263       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$263, DW_AT_name("INTx7")
    2087                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_INTx7")
    2088                      .dwattr $C$DW$263, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2089                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2090                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$264       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2093                      .dwattr $C$DW$264, DW_AT_name("INTx8")
    2094                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_INTx8")
    2095                      .dwattr $C$DW$264, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2096                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2097                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2098              $C$DW$265       .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2100                      .dwattr $C$DW$265, DW_AT_name("INTx9")
    2101                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_INTx9")
    2102                      .dwattr $C$DW$265, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2103                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2105              $C$DW$266       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2107                      .dwattr $C$DW$266, DW_AT_name("INTx10")
    2108                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTx10")
    2109                      .dwattr $C$DW$266, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2110                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2112              $C$DW$267       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2114                      .dwattr $C$DW$267, DW_AT_name("INTx11")
    2115                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_INTx11")
    2116                      .dwattr $C$DW$267, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2117                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2118                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2119              $C$DW$268       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    2121                      .dwattr $C$DW$268, DW_AT_name("INTx12")
    2122                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_INTx12")
    2123                      .dwattr $C$DW$268, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2124                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$269       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    2128                      .dwattr $C$DW$269, DW_AT_name("INTx13")
    2129                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_INTx13")
    2130                      .dwattr $C$DW$269, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2131                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$270       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2135                      .dwattr $C$DW$270, DW_AT_name("INTx14")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   44

    2136                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_INTx14")
    2137                      .dwattr $C$DW$270, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2138                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$271       .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$271, DW_AT_name("INTx15")
    2143                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_INTx15")
    2144                      .dwattr $C$DW$271, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2145                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2146                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2147              $C$DW$272       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$272, DW_AT_name("INTx16")
    2150                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_INTx16")
    2151                      .dwattr $C$DW$272, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2152                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2154                      .dwendtag $C$DW$T$34
    2155              
    2156              
    2157              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2158                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2159                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2160              $C$DW$273       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2162                      .dwattr $C$DW$273, DW_AT_name("all")
    2163                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_all")
    2164                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$274       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    2168                      .dwattr $C$DW$274, DW_AT_name("bit")
    2169                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_bit")
    2170                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2171                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2172                      .dwendtag $C$DW$T$35
    2173              
    2174              
    2175              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2176                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2177                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2178              $C$DW$275       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2180                      .dwattr $C$DW$275, DW_AT_name("INTx1")
    2181                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_INTx1")
    2182                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2183                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2185              $C$DW$276       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$276, DW_AT_name("INTx2")
    2188                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_INTx2")
    2189                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2190                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   45

    2191                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$277       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$277, DW_AT_name("INTx3")
    2195                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_INTx3")
    2196                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$278       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$278, DW_AT_name("INTx4")
    2202                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_INTx4")
    2203                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2204                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$279       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$279, DW_AT_name("INTx5")
    2209                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_INTx5")
    2210                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2211                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$280       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$280, DW_AT_name("INTx6")
    2216                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTx6")
    2217                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2218                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2219                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$281       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$281, DW_AT_name("INTx7")
    2223                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_INTx7")
    2224                      .dwattr $C$DW$281, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2225                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2226                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2227              $C$DW$282       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$282, DW_AT_name("INTx8")
    2230                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_INTx8")
    2231                      .dwattr $C$DW$282, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2232                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2234              $C$DW$283       .dwtag  DW_TAG_member
    2235                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    2236                      .dwattr $C$DW$283, DW_AT_name("INTx9")
    2237                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_INTx9")
    2238                      .dwattr $C$DW$283, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2239                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2241              $C$DW$284       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    2243                      .dwattr $C$DW$284, DW_AT_name("INTx10")
    2244                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_INTx10")
    2245                      .dwattr $C$DW$284, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   46

    2246                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$285       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    2250                      .dwattr $C$DW$285, DW_AT_name("INTx11")
    2251                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_INTx11")
    2252                      .dwattr $C$DW$285, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2253                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2255              $C$DW$286       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    2257                      .dwattr $C$DW$286, DW_AT_name("INTx12")
    2258                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_INTx12")
    2259                      .dwattr $C$DW$286, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2260                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$287       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    2264                      .dwattr $C$DW$287, DW_AT_name("INTx13")
    2265                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_INTx13")
    2266                      .dwattr $C$DW$287, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2267                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2268                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2269              $C$DW$288       .dwtag  DW_TAG_member
    2270                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    2271                      .dwattr $C$DW$288, DW_AT_name("INTx14")
    2272                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_INTx14")
    2273                      .dwattr $C$DW$288, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2274                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2276              $C$DW$289       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    2278                      .dwattr $C$DW$289, DW_AT_name("INTx15")
    2279                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_INTx15")
    2280                      .dwattr $C$DW$289, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2281                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2282                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2283              $C$DW$290       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    2285                      .dwattr $C$DW$290, DW_AT_name("INTx16")
    2286                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_INTx16")
    2287                      .dwattr $C$DW$290, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2288                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2289                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2290                      .dwendtag $C$DW$T$36
    2291              
    2292              
    2293              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2294                      .dwattr $C$DW$T$37, DW_AT_name("PIEIER4_REG")
    2295                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2296              $C$DW$291       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    2298                      .dwattr $C$DW$291, DW_AT_name("all")
    2299                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_all")
    2300                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieVect.asm                                                  PAGE   47

    2301                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$292       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$36)
    2304                      .dwattr $C$DW$292, DW_AT_name("bit")
    2305                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_bit")
    2306                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2307                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2308                      .dwendtag $C$DW$T$37
    2309              
    2310              
    2311              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2312                      .dwattr $C$DW$T$38, DW_AT_name("PIEIER5_BITS")
    2313                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2314              $C$DW$293       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    2316                      .dwattr $C$DW$293, DW_AT_name("INTx1")
    2317                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_INTx1")
    2318                      .dwattr $C$DW$293, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2319                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$294       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    2323                      .dwattr $C$DW$294, DW_AT_name("INTx2")
    2324                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_INTx2")
    2325                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2326                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$295       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    2330                      .dwattr $C$DW$295, DW_AT_name("INTx3")
    2331                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_INTx3")
    2332                      .dwattr $C$DW$295, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2333                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$296       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    2337                      .dwattr $C$DW$296, DW_AT_name("INTx4")
    2338                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_INTx4")
    2339                      .dwattr $C$DW$296, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2342              $C$DW$297       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    2344                      .dwattr $C$DW$297, DW_AT_name("INTx5")
    2345                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_INTx5")
    2346                      .dwattr $C$DW$297, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2347                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$298       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    2351                      .dwattr $C$DW$298, DW_AT_name("INTx6")
    2352                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_INTx6")
    2353                      .dwattr $C$DW$298, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2354                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:32 2017

