TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:36:58 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("AdccRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_AdccRegs")

     399 000000c3 76C7          MOVL      XAR7,#459696          ; [CPU_U] |126| 
         000000c4 03B0 
     400              $C$DW$22        .dwtag  DW_TAG_TI_branch
     401                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     402                      .dwattr $C$DW$22, DW_AT_TI_call
     403                      .dwattr $C$DW$22, DW_AT_TI_indirect
     404 000000c5 3E67          LCR       *XAR7                 ; [CPU_] |126| 
     405                      ; call occurs [XAR7] ; [] |126| 
     406                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     407 000000c6 6F15          B         $C$L13,UNC            ; [CPU_] |127| 
     408                      ; branch occurs ; [] |127| 
     409 000000c7       $C$L11:    
     410                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     411 000000c7 8F07          MOVL      XAR4,#459694          ; [CPU_U] |133| 
         000000c8 03AE 
     412 000000c9 0EC4          MOVU      ACC,*+XAR4[0]         ; [CPU_] |133| 
     413 000000ca 8F00          MOVL      XAR4,#65535           ; [CPU_U] |133| 
         000000cb FFFF 
     414 000000cc 0FA4          CMPL      ACC,XAR4              ; [CPU_] |133| 
     415 000000cd EC0E          BF        $C$L13,EQ             ; [CPU_] |133| 
     416                      ; branchcc occurs ; [] |133| 
     417                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     418 000000ce 76C7          MOVL      XAR7,#459694          ; [CPU_U] |135| 
         000000cf 03AE 
     419              $C$DW$23        .dwtag  DW_TAG_TI_branch
     420                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     421                      .dwattr $C$DW$23, DW_AT_TI_call
     422                      .dwattr $C$DW$23, DW_AT_TI_indirect
     423 000000d0 3E67          LCR       *XAR7                 ; [CPU_] |135| 
     424                      ; call occurs [XAR7] ; [] |135| 
     425                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     426 000000d1 6F0A          B         $C$L13,UNC            ; [CPU_] |136| 
     427                      ; branch occurs ; [] |136| 
     428 000000d2       $C$L12:    
     429                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Adc.c",lin
     430 000000d2 5200          CMPB      AL,#0                 ; [CPU_] |104| 
     431 000000d3 ECD3          BF        $C$L8,EQ              ; [CPU_] |104| 
     432                      ; branchcc occurs ; [] |104| 
     433 000000d4 5201          CMPB      AL,#1                 ; [CPU_] |104| 
     434 000000d5 ECDC          BF        $C$L9,EQ              ; [CPU_] |104| 
     435                      ; branchcc occurs ; [] |104| 
     436 000000d6 5202          CMPB      AL,#2                 ; [CPU_] |104| 
     437 000000d7 ECE5          BF        $C$L10,EQ             ; [CPU_] |104| 
     438                      ; branchcc occurs ; [] |104| 
     439 000000d8 5203          CMPB      AL,#3                 ; [CPU_] |104| 
     440 000000d9 ECEE          BF        $C$L11,EQ             ; [CPU_] |104| 
     441                      ; branchcc occurs ; [] |104| 
     442 000000da 6F01          B         $C$L13,UNC            ; [CPU_] |104| 
     443                      ; branch occurs ; [] |104| 
     444 000000db       $C$L13:    
     445 000000db FE82          SUBB      SP,#2                 ; [CPU_U] 
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   10

     446                      .dwcfi  cfa_offset, -2
     447              $C$DW$24        .dwtag  DW_TAG_TI_branch
     448                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     449                      .dwattr $C$DW$24, DW_AT_TI_return
     450 000000dc 0006          LRETR     ; [CPU_] 
     451                      ; return occurs ; [] 
     452                      .dwattr $C$DW$17, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
     453                      .dwattr $C$DW$17, DW_AT_TI_end_line(0x8e)
     454                      .dwattr $C$DW$17, DW_AT_TI_end_column(0x01)
     455                      .dwendentry
     456                      .dwendtag $C$DW$17
     457              
     458              ;**************************************************************
     459              ;* UNDEFINED EXTERNAL REFERENCES                              *
     460              ;**************************************************************
     461                      .global _AdccRegs
     462                      .global _AdcdRegs
     463                      .global _AdcaRegs
     464                      .global _AdcbRegs
     465              
     466              ;***************************************************************
     467              ;* TYPE INFORMATION                                            *
     468              ;***************************************************************
     469              
     470              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     471                      .dwattr $C$DW$T$20, DW_AT_name("ADCBURSTCTL_BITS")
     472                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     473              $C$DW$25        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$25, DW_AT_name("BURSTTRIGSEL")
     476                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
     477                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
     478                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     479                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     480              $C$DW$26        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$26, DW_AT_name("rsvd1")
     483                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_rsvd1")
     484                      .dwattr $C$DW$26, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     485                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     486                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     487              $C$DW$27        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$27, DW_AT_name("BURSTSIZE")
     490                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_BURSTSIZE")
     491                      .dwattr $C$DW$27, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     492                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     493                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     494              $C$DW$28        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$28, DW_AT_name("rsvd2")
     497                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd2")
     498                      .dwattr $C$DW$28, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x03)
     499                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     500                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   11

     501              $C$DW$29        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     503                      .dwattr $C$DW$29, DW_AT_name("BURSTEN")
     504                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_BURSTEN")
     505                      .dwattr $C$DW$29, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     506                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     508                      .dwendtag $C$DW$T$20
     509              
     510              
     511              $C$DW$T$21      .dwtag  DW_TAG_union_type
     512                      .dwattr $C$DW$T$21, DW_AT_name("ADCBURSTCTL_REG")
     513                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     514              $C$DW$30        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     516                      .dwattr $C$DW$30, DW_AT_name("all")
     517                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_all")
     518                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     520              $C$DW$31        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     522                      .dwattr $C$DW$31, DW_AT_name("bit")
     523                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_bit")
     524                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     526                      .dwendtag $C$DW$T$21
     527              
     528              
     529              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     530                      .dwattr $C$DW$T$22, DW_AT_name("ADCCOUNTER_BITS")
     531                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     532              $C$DW$32        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$32, DW_AT_name("FREECOUNT")
     535                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_FREECOUNT")
     536                      .dwattr $C$DW$32, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
     537                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     538                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     539              $C$DW$33        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$33, DW_AT_name("rsvd1")
     542                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd1")
     543                      .dwattr $C$DW$33, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     544                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     545                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     546                      .dwendtag $C$DW$T$22
     547              
     548              
     549              $C$DW$T$23      .dwtag  DW_TAG_union_type
     550                      .dwattr $C$DW$T$23, DW_AT_name("ADCCOUNTER_REG")
     551                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     552              $C$DW$34        .dwtag  DW_TAG_member
     553                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     554                      .dwattr $C$DW$34, DW_AT_name("all")
     555                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   12

     556                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     558              $C$DW$35        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$22)
     560                      .dwattr $C$DW$35, DW_AT_name("bit")
     561                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_bit")
     562                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     564                      .dwendtag $C$DW$T$23
     565              
     566              
     567              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     568                      .dwattr $C$DW$T$24, DW_AT_name("ADCCTL1_BITS")
     569                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     570              $C$DW$36        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$36, DW_AT_name("rsvd1")
     573                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd1")
     574                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     575                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$37        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$37, DW_AT_name("INTPULSEPOS")
     580                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTPULSEPOS")
     581                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     584              $C$DW$38        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     586                      .dwattr $C$DW$38, DW_AT_name("rsvd2")
     587                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd2")
     588                      .dwattr $C$DW$38, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x04)
     589                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$39        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$39, DW_AT_name("ADCPWDNZ")
     594                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_ADCPWDNZ")
     595                      .dwattr $C$DW$39, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     598              $C$DW$40        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$40, DW_AT_name("ADCBSYCHN")
     601                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ADCBSYCHN")
     602                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     603                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$41        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$41, DW_AT_name("rsvd3")
     608                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd3")
     609                      .dwattr $C$DW$41, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   13

     611                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$42        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$42, DW_AT_name("ADCBSY")
     615                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_ADCBSY")
     616                      .dwattr $C$DW$42, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     617                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$43        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$43, DW_AT_name("rsvd4")
     622                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd4")
     623                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     624                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     626                      .dwendtag $C$DW$T$24
     627              
     628              
     629              $C$DW$T$25      .dwtag  DW_TAG_union_type
     630                      .dwattr $C$DW$T$25, DW_AT_name("ADCCTL1_REG")
     631                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     632              $C$DW$44        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     634                      .dwattr $C$DW$44, DW_AT_name("all")
     635                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_all")
     636                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$45        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$24)
     640                      .dwattr $C$DW$45, DW_AT_name("bit")
     641                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bit")
     642                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     644                      .dwendtag $C$DW$T$25
     645              
     646              
     647              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     648                      .dwattr $C$DW$T$26, DW_AT_name("ADCCTL2_BITS")
     649                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     650              $C$DW$46        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     652                      .dwattr $C$DW$46, DW_AT_name("PRESCALE")
     653                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_PRESCALE")
     654                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     655                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     656                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     657              $C$DW$47        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     659                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     660                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     661                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     662                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     664              $C$DW$48        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   14

     666                      .dwattr $C$DW$48, DW_AT_name("RESOLUTION")
     667                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_RESOLUTION")
     668                      .dwattr $C$DW$48, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     669                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     671              $C$DW$49        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$49, DW_AT_name("SIGNALMODE")
     674                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_SIGNALMODE")
     675                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     676                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     678              $C$DW$50        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     680                      .dwattr $C$DW$50, DW_AT_name("rsvd2")
     681                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd2")
     682                      .dwattr $C$DW$50, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
     683                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$51        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$51, DW_AT_name("rsvd3")
     688                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd3")
     689                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
     690                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     692                      .dwendtag $C$DW$T$26
     693              
     694              
     695              $C$DW$T$27      .dwtag  DW_TAG_union_type
     696                      .dwattr $C$DW$T$27, DW_AT_name("ADCCTL2_REG")
     697                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     698              $C$DW$52        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$52, DW_AT_name("all")
     701                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     702                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$53        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$26)
     706                      .dwattr $C$DW$53, DW_AT_name("bit")
     707                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     708                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     710                      .dwendtag $C$DW$T$27
     711              
     712              
     713              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     714                      .dwattr $C$DW$T$28, DW_AT_name("ADCEVTCLR_BITS")
     715                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     716              $C$DW$54        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     718                      .dwattr $C$DW$54, DW_AT_name("PPB1TRIPHI")
     719                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     720                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   15

     721                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     723              $C$DW$55        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$55, DW_AT_name("PPB1TRIPLO")
     726                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     727                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     728                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     730              $C$DW$56        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$56, DW_AT_name("PPB1ZERO")
     733                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PPB1ZERO")
     734                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     735                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     737              $C$DW$57        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$57, DW_AT_name("rsvd1")
     740                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd1")
     741                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     742                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     744              $C$DW$58        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$58, DW_AT_name("PPB2TRIPHI")
     747                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     748                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     749                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$59        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$59, DW_AT_name("PPB2TRIPLO")
     754                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     755                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     756                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     758              $C$DW$60        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$60, DW_AT_name("PPB2ZERO")
     761                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PPB2ZERO")
     762                      .dwattr $C$DW$60, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     763                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$61        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$61, DW_AT_name("rsvd2")
     768                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd2")
     769                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     770                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     772              $C$DW$62        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$62, DW_AT_name("PPB3TRIPHI")
     775                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PPB3TRIPHI")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   16

     776                      .dwattr $C$DW$62, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     777                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     779              $C$DW$63        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$63, DW_AT_name("PPB3TRIPLO")
     782                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     783                      .dwattr $C$DW$63, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     784                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     786              $C$DW$64        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$64, DW_AT_name("PPB3ZERO")
     789                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PPB3ZERO")
     790                      .dwattr $C$DW$64, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     791                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$65        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$65, DW_AT_name("rsvd3")
     796                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd3")
     797                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     798                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     800              $C$DW$66        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$66, DW_AT_name("PPB4TRIPHI")
     803                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     804                      .dwattr $C$DW$66, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     805                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     807              $C$DW$67        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$67, DW_AT_name("PPB4TRIPLO")
     810                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     811                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     812                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     814              $C$DW$68        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     816                      .dwattr $C$DW$68, DW_AT_name("PPB4ZERO")
     817                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PPB4ZERO")
     818                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     819                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     820                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     821              $C$DW$69        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     823                      .dwattr $C$DW$69, DW_AT_name("rsvd4")
     824                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd4")
     825                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     826                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     828                      .dwendtag $C$DW$T$28
     829              
     830              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   17

     831              $C$DW$T$29      .dwtag  DW_TAG_union_type
     832                      .dwattr $C$DW$T$29, DW_AT_name("ADCEVTCLR_REG")
     833                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     834              $C$DW$70        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     836                      .dwattr $C$DW$70, DW_AT_name("all")
     837                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     838                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     840              $C$DW$71        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$28)
     842                      .dwattr $C$DW$71, DW_AT_name("bit")
     843                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
     844                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     846                      .dwendtag $C$DW$T$29
     847              
     848              
     849              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     850                      .dwattr $C$DW$T$30, DW_AT_name("ADCEVTINTSEL_BITS")
     851                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     852              $C$DW$72        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$72, DW_AT_name("PPB1TRIPHI")
     855                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     856                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     857                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$73        .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     861                      .dwattr $C$DW$73, DW_AT_name("PPB1TRIPLO")
     862                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     863                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     866              $C$DW$74        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$74, DW_AT_name("PPB1ZERO")
     869                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PPB1ZERO")
     870                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$75        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
     876                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
     877                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     878                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     880              $C$DW$76        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     882                      .dwattr $C$DW$76, DW_AT_name("PPB2TRIPHI")
     883                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PPB2TRIPHI")
     884                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     885                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   18

     886                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$77        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$77, DW_AT_name("PPB2TRIPLO")
     890                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_PPB2TRIPLO")
     891                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     892                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$78        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$78, DW_AT_name("PPB2ZERO")
     897                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PPB2ZERO")
     898                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     899                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$79        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$79, DW_AT_name("rsvd2")
     904                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd2")
     905                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     906                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$80        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$80, DW_AT_name("PPB3TRIPHI")
     911                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PPB3TRIPHI")
     912                      .dwattr $C$DW$80, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$81        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$81, DW_AT_name("PPB3TRIPLO")
     918                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PPB3TRIPLO")
     919                      .dwattr $C$DW$81, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     920                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$82        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$82, DW_AT_name("PPB3ZERO")
     925                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PPB3ZERO")
     926                      .dwattr $C$DW$82, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     927                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$83        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$83, DW_AT_name("rsvd3")
     932                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd3")
     933                      .dwattr $C$DW$83, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     934                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     936              $C$DW$84        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$84, DW_AT_name("PPB4TRIPHI")
     939                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PPB4TRIPHI")
     940                      .dwattr $C$DW$84, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   19

     941                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$85        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$85, DW_AT_name("PPB4TRIPLO")
     946                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PPB4TRIPLO")
     947                      .dwattr $C$DW$85, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     948                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     950              $C$DW$86        .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$86, DW_AT_name("PPB4ZERO")
     953                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PPB4ZERO")
     954                      .dwattr $C$DW$86, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     955                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     957              $C$DW$87        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$87, DW_AT_name("rsvd4")
     960                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd4")
     961                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     962                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     964                      .dwendtag $C$DW$T$30
     965              
     966              
     967              $C$DW$T$31      .dwtag  DW_TAG_union_type
     968                      .dwattr $C$DW$T$31, DW_AT_name("ADCEVTINTSEL_REG")
     969                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     970              $C$DW$88        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     972                      .dwattr $C$DW$88, DW_AT_name("all")
     973                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
     974                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     976              $C$DW$89        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$30)
     978                      .dwattr $C$DW$89, DW_AT_name("bit")
     979                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
     980                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     982                      .dwendtag $C$DW$T$31
     983              
     984              
     985              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     986                      .dwattr $C$DW$T$32, DW_AT_name("ADCEVTSEL_BITS")
     987                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     988              $C$DW$90        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$90, DW_AT_name("PPB1TRIPHI")
     991                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PPB1TRIPHI")
     992                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     993                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   20

     996                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$91, DW_AT_name("PPB1TRIPLO")
     998                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PPB1TRIPLO")
     999                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1000                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1002              $C$DW$92        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$92, DW_AT_name("PPB1ZERO")
    1005                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PPB1ZERO")
    1006                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$93        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    1012                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1013                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1016              $C$DW$94        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$94, DW_AT_name("PPB2TRIPHI")
    1019                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1020                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1021                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$95        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$95, DW_AT_name("PPB2TRIPLO")
    1026                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1027                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1028                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$96        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$96, DW_AT_name("PPB2ZERO")
    1033                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PPB2ZERO")
    1034                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1035                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1037              $C$DW$97        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
    1040                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
    1041                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1042                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1044              $C$DW$98        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1046                      .dwattr $C$DW$98, DW_AT_name("PPB3TRIPHI")
    1047                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1048                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1049                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   21

    1051              $C$DW$99        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$99, DW_AT_name("PPB3TRIPLO")
    1054                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1055                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1056                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$100       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$100, DW_AT_name("PPB3ZERO")
    1061                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PPB3ZERO")
    1062                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$101       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$101, DW_AT_name("rsvd3")
    1068                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd3")
    1069                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$102       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$102, DW_AT_name("PPB4TRIPHI")
    1075                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1076                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$103       .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$103, DW_AT_name("PPB4TRIPLO")
    1082                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1083                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$104       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$104, DW_AT_name("PPB4ZERO")
    1089                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PPB4ZERO")
    1090                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1091                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$105       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$105, DW_AT_name("rsvd4")
    1096                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd4")
    1097                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1100                      .dwendtag $C$DW$T$32
    1101              
    1102              
    1103              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1104                      .dwattr $C$DW$T$33, DW_AT_name("ADCEVTSEL_REG")
    1105                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   22

    1106              $C$DW$106       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$106, DW_AT_name("all")
    1109                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1110                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1112              $C$DW$107       .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$32)
    1114                      .dwattr $C$DW$107, DW_AT_name("bit")
    1115                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1116                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1117                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1118                      .dwendtag $C$DW$T$33
    1119              
    1120              
    1121              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1122                      .dwattr $C$DW$T$34, DW_AT_name("ADCEVTSTAT_BITS")
    1123                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1124              $C$DW$108       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$108, DW_AT_name("PPB1TRIPHI")
    1127                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PPB1TRIPHI")
    1128                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1129                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$109       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$109, DW_AT_name("PPB1TRIPLO")
    1134                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PPB1TRIPLO")
    1135                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1136                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$110       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$110, DW_AT_name("PPB1ZERO")
    1141                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PPB1ZERO")
    1142                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1143                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1145              $C$DW$111       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1148                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1149                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$112       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$112, DW_AT_name("PPB2TRIPHI")
    1155                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PPB2TRIPHI")
    1156                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$113       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   23

    1161                      .dwattr $C$DW$113, DW_AT_name("PPB2TRIPLO")
    1162                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PPB2TRIPLO")
    1163                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1164                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1166              $C$DW$114       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$114, DW_AT_name("PPB2ZERO")
    1169                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PPB2ZERO")
    1170                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1171                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$115       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    1176                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    1177                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1178                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1180              $C$DW$116       .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$116, DW_AT_name("PPB3TRIPHI")
    1183                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PPB3TRIPHI")
    1184                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1185                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$117       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$117, DW_AT_name("PPB3TRIPLO")
    1190                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PPB3TRIPLO")
    1191                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1192                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$118       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$118, DW_AT_name("PPB3ZERO")
    1197                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PPB3ZERO")
    1198                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1199                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$119       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$119, DW_AT_name("rsvd3")
    1204                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd3")
    1205                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1208              $C$DW$120       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$120, DW_AT_name("PPB4TRIPHI")
    1211                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PPB4TRIPHI")
    1212                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$121       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   24

    1216                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$121, DW_AT_name("PPB4TRIPLO")
    1218                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PPB4TRIPLO")
    1219                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$122       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$122, DW_AT_name("PPB4ZERO")
    1225                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PPB4ZERO")
    1226                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$123       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$123, DW_AT_name("rsvd4")
    1232                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd4")
    1233                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1236                      .dwendtag $C$DW$T$34
    1237              
    1238              
    1239              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1240                      .dwattr $C$DW$T$35, DW_AT_name("ADCEVTSTAT_REG")
    1241                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1242              $C$DW$124       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$124, DW_AT_name("all")
    1245                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1246                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1248              $C$DW$125       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$34)
    1250                      .dwattr $C$DW$125, DW_AT_name("bit")
    1251                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1252                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1254                      .dwendtag $C$DW$T$35
    1255              
    1256              
    1257              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1258                      .dwattr $C$DW$T$36, DW_AT_name("ADCINTFLGCLR_BITS")
    1259                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1260              $C$DW$126       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$126, DW_AT_name("ADCINT1")
    1263                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCINT1")
    1264                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1265                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$127       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$127, DW_AT_name("ADCINT2")
    1270                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCINT2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   25

    1271                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1274              $C$DW$128       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$128, DW_AT_name("ADCINT3")
    1277                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ADCINT3")
    1278                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1279                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1281              $C$DW$129       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$129, DW_AT_name("ADCINT4")
    1284                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCINT4")
    1285                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1286                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$130       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1291                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1292                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1293                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1295                      .dwendtag $C$DW$T$36
    1296              
    1297              
    1298              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1299                      .dwattr $C$DW$T$37, DW_AT_name("ADCINTFLGCLR_REG")
    1300                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1301              $C$DW$131       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$131, DW_AT_name("all")
    1304                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1305                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$132       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$36)
    1309                      .dwattr $C$DW$132, DW_AT_name("bit")
    1310                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1311                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1313                      .dwendtag $C$DW$T$37
    1314              
    1315              
    1316              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1317                      .dwattr $C$DW$T$38, DW_AT_name("ADCINTFLG_BITS")
    1318                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1319              $C$DW$133       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$133, DW_AT_name("ADCINT1")
    1322                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCINT1")
    1323                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   26

    1326              $C$DW$134       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$134, DW_AT_name("ADCINT2")
    1329                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCINT2")
    1330                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1331                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$135       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$135, DW_AT_name("ADCINT3")
    1336                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCINT3")
    1337                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$136       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$136, DW_AT_name("ADCINT4")
    1343                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCINT4")
    1344                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$137       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$137, DW_AT_name("rsvd1")
    1350                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd1")
    1351                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1352                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1354                      .dwendtag $C$DW$T$38
    1355              
    1356              
    1357              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1358                      .dwattr $C$DW$T$39, DW_AT_name("ADCINTFLG_REG")
    1359                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1360              $C$DW$138       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$138, DW_AT_name("all")
    1363                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1364                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$139       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$38)
    1368                      .dwattr $C$DW$139, DW_AT_name("bit")
    1369                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1370                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1371                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1372                      .dwendtag $C$DW$T$39
    1373              
    1374              
    1375              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1376                      .dwattr $C$DW$T$40, DW_AT_name("ADCINTOVFCLR_BITS")
    1377                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1378              $C$DW$140       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$140, DW_AT_name("ADCINT1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   27

    1381                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCINT1")
    1382                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$141       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$141, DW_AT_name("ADCINT2")
    1388                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCINT2")
    1389                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$142       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$142, DW_AT_name("ADCINT3")
    1395                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCINT3")
    1396                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1397                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$143       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$143, DW_AT_name("ADCINT4")
    1402                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCINT4")
    1403                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1404                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$144       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$144, DW_AT_name("rsvd1")
    1409                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1")
    1410                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1411                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1413                      .dwendtag $C$DW$T$40
    1414              
    1415              
    1416              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1417                      .dwattr $C$DW$T$41, DW_AT_name("ADCINTOVFCLR_REG")
    1418                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1419              $C$DW$145       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1421                      .dwattr $C$DW$145, DW_AT_name("all")
    1422                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    1423                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$146       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$40)
    1427                      .dwattr $C$DW$146, DW_AT_name("bit")
    1428                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    1429                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1431                      .dwendtag $C$DW$T$41
    1432              
    1433              
    1434              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1435                      .dwattr $C$DW$T$42, DW_AT_name("ADCINTOVF_BITS")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   28

    1436                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1437              $C$DW$147       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$147, DW_AT_name("ADCINT1")
    1440                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINT1")
    1441                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1442                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$148       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$148, DW_AT_name("ADCINT2")
    1447                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCINT2")
    1448                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$149       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$149, DW_AT_name("ADCINT3")
    1454                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCINT3")
    1455                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1456                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$150       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$150, DW_AT_name("ADCINT4")
    1461                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCINT4")
    1462                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1463                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$151       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    1468                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    1469                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1470                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1472                      .dwendtag $C$DW$T$42
    1473              
    1474              
    1475              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1476                      .dwattr $C$DW$T$43, DW_AT_name("ADCINTOVF_REG")
    1477                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1478              $C$DW$152       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$152, DW_AT_name("all")
    1481                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    1482                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$153       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$42)
    1486                      .dwattr $C$DW$153, DW_AT_name("bit")
    1487                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    1488                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1490                      .dwendtag $C$DW$T$43
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   29

    1491              
    1492              
    1493              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1494                      .dwattr $C$DW$T$44, DW_AT_name("ADCINTSEL1N2_BITS")
    1495                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1496              $C$DW$154       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$154, DW_AT_name("INT1SEL")
    1499                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INT1SEL")
    1500                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1501                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$155       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$155, DW_AT_name("rsvd1")
    1506                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd1")
    1507                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$156       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$156, DW_AT_name("INT1E")
    1513                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_INT1E")
    1514                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$157       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$157, DW_AT_name("INT1CONT")
    1520                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_INT1CONT")
    1521                      .dwattr $C$DW$157, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$158       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    1527                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    1528                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1529                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$159       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$159, DW_AT_name("INT2SEL")
    1534                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_INT2SEL")
    1535                      .dwattr $C$DW$159, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1536                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$160       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$160, DW_AT_name("rsvd3")
    1541                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd3")
    1542                      .dwattr $C$DW$160, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$161       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   30

    1546                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$161, DW_AT_name("INT2E")
    1548                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_INT2E")
    1549                      .dwattr $C$DW$161, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1550                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$162       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$162, DW_AT_name("INT2CONT")
    1555                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_INT2CONT")
    1556                      .dwattr $C$DW$162, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$163       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$163, DW_AT_name("rsvd4")
    1562                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd4")
    1563                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1566                      .dwendtag $C$DW$T$44
    1567              
    1568              
    1569              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1570                      .dwattr $C$DW$T$45, DW_AT_name("ADCINTSEL1N2_REG")
    1571                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1572              $C$DW$164       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1574                      .dwattr $C$DW$164, DW_AT_name("all")
    1575                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    1576                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1578              $C$DW$165       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$44)
    1580                      .dwattr $C$DW$165, DW_AT_name("bit")
    1581                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    1582                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1583                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1584                      .dwendtag $C$DW$T$45
    1585              
    1586              
    1587              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1588                      .dwattr $C$DW$T$46, DW_AT_name("ADCINTSEL3N4_BITS")
    1589                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1590              $C$DW$166       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$166, DW_AT_name("INT3SEL")
    1593                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_INT3SEL")
    1594                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1595                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1597              $C$DW$167       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$167, DW_AT_name("rsvd1")
    1600                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:59 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Adc.asm                                                      PAGE   31

    1601                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1602                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$168       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$168, DW_AT_name("INT3E")
    1607                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INT3E")
    1608                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1609                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$169       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$169, DW_AT_name("INT3CONT")
    1614                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INT3CONT")
    1615                      .dwattr $C$DW$169, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$170       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$170, DW_AT_name("rsvd2")
    1621                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd2")
    1622                      .dwattr $C$DW$170, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1623                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1625              $C$DW$171       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$171, DW_AT_name("INT4SEL")
    1628                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INT4SEL")
    1629                      .dwattr $C$DW$171, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1630                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$172       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$172, DW_AT_name("rsvd3")
    1635                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd3")
    1636                      .dwattr $C$DW$172, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
