TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:26:39 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("PieCtrlRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")

     102 0000001d FF69          SPM       #0                    ; [CPU_] 
     103              $C$DW$3 .dwtag  DW_TAG_TI_branch
     104                      .dwattr $C$DW$3, DW_AT_low_pc(0x00)
     105                      .dwattr $C$DW$3, DW_AT_TI_return
     106 0000001e 0006          LRETR     ; [CPU_] 
     107                      ; return occurs ; [] 
     108                      .dwattr $C$DW$2, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/sou
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    3

     109                      .dwattr $C$DW$2, DW_AT_TI_end_line(0x3a)
     110                      .dwattr $C$DW$2, DW_AT_TI_end_column(0x01)
     111                      .dwendentry
     112                      .dwendtag $C$DW$2
     113              
     114 0000001f               .sect   ".text"
     115                      .clink
     116                      .global _EnableInterrupts
     117              
     118              $C$DW$4 .dwtag  DW_TAG_subprogram, DW_AT_name("EnableInterrupts")
     119                      .dwattr $C$DW$4, DW_AT_low_pc(_EnableInterrupts)
     120                      .dwattr $C$DW$4, DW_AT_high_pc(0x00)
     121                      .dwattr $C$DW$4, DW_AT_TI_symbol_name("_EnableInterrupts")
     122                      .dwattr $C$DW$4, DW_AT_external
     123                      .dwattr $C$DW$4, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/s
     124                      .dwattr $C$DW$4, DW_AT_TI_begin_line(0x41)
     125                      .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
     126                      .dwattr $C$DW$4, DW_AT_TI_max_frame_size(-2)
     127                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_PieCtrl.c"
     128              
     129                      .dwfde $C$DW$CIE, _EnableInterrupts
     130              
     131              ;***************************************************************
     132              ;* FNAME: _EnableInterrupts             FR SIZE:   0           *
     133              ;*                                                             *
     134              ;* FUNCTION ENVIRONMENT                                        *
     135              ;*                                                             *
     136              ;* FUNCTION PROPERTIES                                         *
     137              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     138              ;***************************************************************
     139              
     140 0000001f       _EnableInterrupts:
     141                      .dwcfi  cfa_offset, -2
     142                      .dwcfi  save_reg_to_mem, 26, 0
     143                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_PieCtrl.c"
     144 0000001f 761F!         MOVW      DP,#_PieCtrlRegs      ; [CPU_U] 
         00000020 0000 
     145 00000021 1A00!         OR        @_PieCtrlRegs,#0x0001 ; [CPU_] |69| 
         00000022 0001 
     146                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_PieCtrl.c"
     147 00000023 2801!         MOV       @_PieCtrlRegs+1,#65535 ; [CPU_] |72| 
         00000024 FFFF 
     148                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_PieCtrl.c"
     149 00000025 2910   clrc INTM
     150                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_PieCtrl.c"
     151 00000026 FF69          SPM       #0                    ; [CPU_] 
     152              $C$DW$5 .dwtag  DW_TAG_TI_branch
     153                      .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     154                      .dwattr $C$DW$5, DW_AT_TI_return
     155 00000027 0006          LRETR     ; [CPU_] 
     156                      ; return occurs ; [] 
     157                      .dwattr $C$DW$4, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/sou
     158                      .dwattr $C$DW$4, DW_AT_TI_end_line(0x4d)
     159                      .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     160                      .dwendentry
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    4

     161                      .dwendtag $C$DW$4
     162              
     163              ;**************************************************************
     164              ;* UNDEFINED EXTERNAL REFERENCES                              *
     165              ;**************************************************************
     166                      .global _PieCtrlRegs
     167              
     168              ;***************************************************************
     169              ;* TYPE INFORMATION                                            *
     170              ;***************************************************************
     171              
     172              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     173                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
     174                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     175              $C$DW$6 .dwtag  DW_TAG_member
     176                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     177                      .dwattr $C$DW$6, DW_AT_name("ACK1")
     178                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_ACK1")
     179                      .dwattr $C$DW$6, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     180                      .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     181                      .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     182              $C$DW$7 .dwtag  DW_TAG_member
     183                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     184                      .dwattr $C$DW$7, DW_AT_name("ACK2")
     185                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_ACK2")
     186                      .dwattr $C$DW$7, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     187                      .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     188                      .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     189              $C$DW$8 .dwtag  DW_TAG_member
     190                      .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     191                      .dwattr $C$DW$8, DW_AT_name("ACK3")
     192                      .dwattr $C$DW$8, DW_AT_TI_symbol_name("_ACK3")
     193                      .dwattr $C$DW$8, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     194                      .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     195                      .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     196              $C$DW$9 .dwtag  DW_TAG_member
     197                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     198                      .dwattr $C$DW$9, DW_AT_name("ACK4")
     199                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_ACK4")
     200                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     201                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     202                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     203              $C$DW$10        .dwtag  DW_TAG_member
     204                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     205                      .dwattr $C$DW$10, DW_AT_name("ACK5")
     206                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_ACK5")
     207                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     208                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     209                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     210              $C$DW$11        .dwtag  DW_TAG_member
     211                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     212                      .dwattr $C$DW$11, DW_AT_name("ACK6")
     213                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_ACK6")
     214                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     215                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    5

     216                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     217              $C$DW$12        .dwtag  DW_TAG_member
     218                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     219                      .dwattr $C$DW$12, DW_AT_name("ACK7")
     220                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_ACK7")
     221                      .dwattr $C$DW$12, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     222                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     223                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     224              $C$DW$13        .dwtag  DW_TAG_member
     225                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     226                      .dwattr $C$DW$13, DW_AT_name("ACK8")
     227                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_ACK8")
     228                      .dwattr $C$DW$13, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     229                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     230                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     231              $C$DW$14        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     233                      .dwattr $C$DW$14, DW_AT_name("ACK9")
     234                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_ACK9")
     235                      .dwattr $C$DW$14, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     236                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     237                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     238              $C$DW$15        .dwtag  DW_TAG_member
     239                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     240                      .dwattr $C$DW$15, DW_AT_name("ACK10")
     241                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_ACK10")
     242                      .dwattr $C$DW$15, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     243                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     244                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     245              $C$DW$16        .dwtag  DW_TAG_member
     246                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     247                      .dwattr $C$DW$16, DW_AT_name("ACK11")
     248                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_ACK11")
     249                      .dwattr $C$DW$16, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     250                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     252              $C$DW$17        .dwtag  DW_TAG_member
     253                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     254                      .dwattr $C$DW$17, DW_AT_name("ACK12")
     255                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_ACK12")
     256                      .dwattr $C$DW$17, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     257                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     258                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     259              $C$DW$18        .dwtag  DW_TAG_member
     260                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     261                      .dwattr $C$DW$18, DW_AT_name("rsvd1")
     262                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_rsvd1")
     263                      .dwattr $C$DW$18, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     264                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     266                      .dwendtag $C$DW$T$20
     267              
     268              
     269              $C$DW$T$21      .dwtag  DW_TAG_union_type
     270                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    6

     271                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     272              $C$DW$19        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     274                      .dwattr $C$DW$19, DW_AT_name("all")
     275                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_all")
     276                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     277                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     278              $C$DW$20        .dwtag  DW_TAG_member
     279                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$20)
     280                      .dwattr $C$DW$20, DW_AT_name("bit")
     281                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_bit")
     282                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     283                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     284                      .dwendtag $C$DW$T$21
     285              
     286              
     287              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     288                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
     289                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     290              $C$DW$21        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     292                      .dwattr $C$DW$21, DW_AT_name("ENPIE")
     293                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_ENPIE")
     294                      .dwattr $C$DW$21, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     295                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     297              $C$DW$22        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     299                      .dwattr $C$DW$22, DW_AT_name("PIEVECT")
     300                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_PIEVECT")
     301                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     302                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     303                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     304                      .dwendtag $C$DW$T$22
     305              
     306              
     307              $C$DW$T$23      .dwtag  DW_TAG_union_type
     308                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
     309                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     310              $C$DW$23        .dwtag  DW_TAG_member
     311                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     312                      .dwattr $C$DW$23, DW_AT_name("all")
     313                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_all")
     314                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     315                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     316              $C$DW$24        .dwtag  DW_TAG_member
     317                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     318                      .dwattr $C$DW$24, DW_AT_name("bit")
     319                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_bit")
     320                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     321                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     322                      .dwendtag $C$DW$T$23
     323              
     324              
     325              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    7

     326                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
     327                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     328              $C$DW$25        .dwtag  DW_TAG_member
     329                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     330                      .dwattr $C$DW$25, DW_AT_name("INTx1")
     331                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_INTx1")
     332                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     333                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     334                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     335              $C$DW$26        .dwtag  DW_TAG_member
     336                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     337                      .dwattr $C$DW$26, DW_AT_name("INTx2")
     338                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_INTx2")
     339                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     340                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     341                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     342              $C$DW$27        .dwtag  DW_TAG_member
     343                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     344                      .dwattr $C$DW$27, DW_AT_name("INTx3")
     345                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_INTx3")
     346                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     347                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     348                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     349              $C$DW$28        .dwtag  DW_TAG_member
     350                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     351                      .dwattr $C$DW$28, DW_AT_name("INTx4")
     352                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_INTx4")
     353                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     354                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     355                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     356              $C$DW$29        .dwtag  DW_TAG_member
     357                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     358                      .dwattr $C$DW$29, DW_AT_name("INTx5")
     359                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_INTx5")
     360                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     361                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     362                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     363              $C$DW$30        .dwtag  DW_TAG_member
     364                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     365                      .dwattr $C$DW$30, DW_AT_name("INTx6")
     366                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_INTx6")
     367                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     368                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     370              $C$DW$31        .dwtag  DW_TAG_member
     371                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     372                      .dwattr $C$DW$31, DW_AT_name("INTx7")
     373                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_INTx7")
     374                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     375                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     377              $C$DW$32        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     379                      .dwattr $C$DW$32, DW_AT_name("INTx8")
     380                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_INTx8")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    8

     381                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     382                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     384              $C$DW$33        .dwtag  DW_TAG_member
     385                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     386                      .dwattr $C$DW$33, DW_AT_name("INTx9")
     387                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_INTx9")
     388                      .dwattr $C$DW$33, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     389                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     390                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     391              $C$DW$34        .dwtag  DW_TAG_member
     392                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     393                      .dwattr $C$DW$34, DW_AT_name("INTx10")
     394                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_INTx10")
     395                      .dwattr $C$DW$34, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     396                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     397                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     398              $C$DW$35        .dwtag  DW_TAG_member
     399                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     400                      .dwattr $C$DW$35, DW_AT_name("INTx11")
     401                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_INTx11")
     402                      .dwattr $C$DW$35, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     403                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     404                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     405              $C$DW$36        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     407                      .dwattr $C$DW$36, DW_AT_name("INTx12")
     408                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_INTx12")
     409                      .dwattr $C$DW$36, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     410                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     412              $C$DW$37        .dwtag  DW_TAG_member
     413                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     414                      .dwattr $C$DW$37, DW_AT_name("INTx13")
     415                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_INTx13")
     416                      .dwattr $C$DW$37, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     417                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     418                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     419              $C$DW$38        .dwtag  DW_TAG_member
     420                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     421                      .dwattr $C$DW$38, DW_AT_name("INTx14")
     422                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_INTx14")
     423                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     424                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     425                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     426              $C$DW$39        .dwtag  DW_TAG_member
     427                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     428                      .dwattr $C$DW$39, DW_AT_name("INTx15")
     429                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_INTx15")
     430                      .dwattr $C$DW$39, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     431                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     432                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     433              $C$DW$40        .dwtag  DW_TAG_member
     434                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     435                      .dwattr $C$DW$40, DW_AT_name("INTx16")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE    9

     436                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_INTx16")
     437                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     438                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     439                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     440                      .dwendtag $C$DW$T$24
     441              
     442              
     443              $C$DW$T$25      .dwtag  DW_TAG_union_type
     444                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
     445                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     446              $C$DW$41        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     448                      .dwattr $C$DW$41, DW_AT_name("all")
     449                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     450                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     452              $C$DW$42        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
     454                      .dwattr $C$DW$42, DW_AT_name("bit")
     455                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
     456                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     457                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     458                      .dwendtag $C$DW$T$25
     459              
     460              
     461              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     462                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
     463                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     464              $C$DW$43        .dwtag  DW_TAG_member
     465                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     466                      .dwattr $C$DW$43, DW_AT_name("INTx1")
     467                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_INTx1")
     468                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     469                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     470                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     471              $C$DW$44        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     473                      .dwattr $C$DW$44, DW_AT_name("INTx2")
     474                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_INTx2")
     475                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     476                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     477                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     478              $C$DW$45        .dwtag  DW_TAG_member
     479                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     480                      .dwattr $C$DW$45, DW_AT_name("INTx3")
     481                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_INTx3")
     482                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     483                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     485              $C$DW$46        .dwtag  DW_TAG_member
     486                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     487                      .dwattr $C$DW$46, DW_AT_name("INTx4")
     488                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_INTx4")
     489                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     490                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   10

     491                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     492              $C$DW$47        .dwtag  DW_TAG_member
     493                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     494                      .dwattr $C$DW$47, DW_AT_name("INTx5")
     495                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_INTx5")
     496                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     497                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     498                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     499              $C$DW$48        .dwtag  DW_TAG_member
     500                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     501                      .dwattr $C$DW$48, DW_AT_name("INTx6")
     502                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_INTx6")
     503                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     504                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     506              $C$DW$49        .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     508                      .dwattr $C$DW$49, DW_AT_name("INTx7")
     509                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_INTx7")
     510                      .dwattr $C$DW$49, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     511                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     513              $C$DW$50        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     515                      .dwattr $C$DW$50, DW_AT_name("INTx8")
     516                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_INTx8")
     517                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     518                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     520              $C$DW$51        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$51, DW_AT_name("INTx9")
     523                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_INTx9")
     524                      .dwattr $C$DW$51, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     525                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     526                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     527              $C$DW$52        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     529                      .dwattr $C$DW$52, DW_AT_name("INTx10")
     530                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_INTx10")
     531                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     532                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     533                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     534              $C$DW$53        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     536                      .dwattr $C$DW$53, DW_AT_name("INTx11")
     537                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_INTx11")
     538                      .dwattr $C$DW$53, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     539                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     541              $C$DW$54        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$54, DW_AT_name("INTx12")
     544                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_INTx12")
     545                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   11

     546                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     548              $C$DW$55        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     550                      .dwattr $C$DW$55, DW_AT_name("INTx13")
     551                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_INTx13")
     552                      .dwattr $C$DW$55, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     553                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$56        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     557                      .dwattr $C$DW$56, DW_AT_name("INTx14")
     558                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_INTx14")
     559                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     560                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     561                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     562              $C$DW$57        .dwtag  DW_TAG_member
     563                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     564                      .dwattr $C$DW$57, DW_AT_name("INTx15")
     565                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_INTx15")
     566                      .dwattr $C$DW$57, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     567                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     569              $C$DW$58        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     571                      .dwattr $C$DW$58, DW_AT_name("INTx16")
     572                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_INTx16")
     573                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     574                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     575                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     576                      .dwendtag $C$DW$T$26
     577              
     578              
     579              $C$DW$T$27      .dwtag  DW_TAG_union_type
     580                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
     581                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     582              $C$DW$59        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$59, DW_AT_name("all")
     585                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     586                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     588              $C$DW$60        .dwtag  DW_TAG_member
     589                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$26)
     590                      .dwattr $C$DW$60, DW_AT_name("bit")
     591                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     592                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     594                      .dwendtag $C$DW$T$27
     595              
     596              
     597              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     598                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
     599                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     600              $C$DW$61        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   12

     601                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$61, DW_AT_name("INTx1")
     603                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_INTx1")
     604                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     605                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     606                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     607              $C$DW$62        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$62, DW_AT_name("INTx2")
     610                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_INTx2")
     611                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     612                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     613                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     614              $C$DW$63        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$63, DW_AT_name("INTx3")
     617                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_INTx3")
     618                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     619                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     621              $C$DW$64        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     623                      .dwattr $C$DW$64, DW_AT_name("INTx4")
     624                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_INTx4")
     625                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     626                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     627                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     628              $C$DW$65        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$65, DW_AT_name("INTx5")
     631                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_INTx5")
     632                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     633                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     635              $C$DW$66        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$66, DW_AT_name("INTx6")
     638                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_INTx6")
     639                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     640                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     642              $C$DW$67        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     644                      .dwattr $C$DW$67, DW_AT_name("INTx7")
     645                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_INTx7")
     646                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     647                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$68        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     651                      .dwattr $C$DW$68, DW_AT_name("INTx8")
     652                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_INTx8")
     653                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     654                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   13

     656              $C$DW$69        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$69, DW_AT_name("INTx9")
     659                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_INTx9")
     660                      .dwattr $C$DW$69, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     661                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     663              $C$DW$70        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$70, DW_AT_name("INTx10")
     666                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_INTx10")
     667                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     668                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     670              $C$DW$71        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$71, DW_AT_name("INTx11")
     673                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_INTx11")
     674                      .dwattr $C$DW$71, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     675                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     677              $C$DW$72        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     679                      .dwattr $C$DW$72, DW_AT_name("INTx12")
     680                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_INTx12")
     681                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$73        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$73, DW_AT_name("INTx13")
     687                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_INTx13")
     688                      .dwattr $C$DW$73, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$74        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$74, DW_AT_name("INTx14")
     694                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_INTx14")
     695                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$75        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$75, DW_AT_name("INTx15")
     701                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_INTx15")
     702                      .dwattr $C$DW$75, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     703                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     705              $C$DW$76        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$76, DW_AT_name("INTx16")
     708                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_INTx16")
     709                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     710                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   14

     711                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     712                      .dwendtag $C$DW$T$28
     713              
     714              
     715              $C$DW$T$29      .dwtag  DW_TAG_union_type
     716                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
     717                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     718              $C$DW$77        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$77, DW_AT_name("all")
     721                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     722                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     724              $C$DW$78        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$28)
     726                      .dwattr $C$DW$78, DW_AT_name("bit")
     727                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     728                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     730                      .dwendtag $C$DW$T$29
     731              
     732              
     733              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     734                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
     735                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     736              $C$DW$79        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$79, DW_AT_name("INTx1")
     739                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INTx1")
     740                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     741                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     743              $C$DW$80        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$80, DW_AT_name("INTx2")
     746                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INTx2")
     747                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     748                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     750              $C$DW$81        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$81, DW_AT_name("INTx3")
     753                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTx3")
     754                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     755                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     756                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     757              $C$DW$82        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$82, DW_AT_name("INTx4")
     760                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTx4")
     761                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     762                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     763                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     764              $C$DW$83        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   15

     766                      .dwattr $C$DW$83, DW_AT_name("INTx5")
     767                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_INTx5")
     768                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     769                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     771              $C$DW$84        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$84, DW_AT_name("INTx6")
     774                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_INTx6")
     775                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     776                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     778              $C$DW$85        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     780                      .dwattr $C$DW$85, DW_AT_name("INTx7")
     781                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTx7")
     782                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     783                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     785              $C$DW$86        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$86, DW_AT_name("INTx8")
     788                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INTx8")
     789                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     790                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$87        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$87, DW_AT_name("INTx9")
     795                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_INTx9")
     796                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     797                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$88        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$88, DW_AT_name("INTx10")
     802                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_INTx10")
     803                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     804                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     806              $C$DW$89        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     808                      .dwattr $C$DW$89, DW_AT_name("INTx11")
     809                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INTx11")
     810                      .dwattr $C$DW$89, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     811                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     813              $C$DW$90        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$90, DW_AT_name("INTx12")
     816                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTx12")
     817                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     818                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     819                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     820              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   16

     821                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$91, DW_AT_name("INTx13")
     823                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_INTx13")
     824                      .dwattr $C$DW$91, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     825                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     826                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     827              $C$DW$92        .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     829                      .dwattr $C$DW$92, DW_AT_name("INTx14")
     830                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_INTx14")
     831                      .dwattr $C$DW$92, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     832                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     833                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     834              $C$DW$93        .dwtag  DW_TAG_member
     835                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     836                      .dwattr $C$DW$93, DW_AT_name("INTx15")
     837                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_INTx15")
     838                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     839                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$94        .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     843                      .dwattr $C$DW$94, DW_AT_name("INTx16")
     844                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_INTx16")
     845                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     846                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     848                      .dwendtag $C$DW$T$30
     849              
     850              
     851              $C$DW$T$31      .dwtag  DW_TAG_union_type
     852                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
     853                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     854              $C$DW$95        .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     856                      .dwattr $C$DW$95, DW_AT_name("all")
     857                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
     858                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     860              $C$DW$96        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$30)
     862                      .dwattr $C$DW$96, DW_AT_name("bit")
     863                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
     864                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     866                      .dwendtag $C$DW$T$31
     867              
     868              
     869              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     870                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
     871                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     872              $C$DW$97        .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     874                      .dwattr $C$DW$97, DW_AT_name("INTx1")
     875                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_INTx1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   17

     876                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     877                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$98        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$98, DW_AT_name("INTx2")
     882                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTx2")
     883                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     884                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     886              $C$DW$99        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     888                      .dwattr $C$DW$99, DW_AT_name("INTx3")
     889                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTx3")
     890                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$100       .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$100, DW_AT_name("INTx4")
     896                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx4")
     897                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     898                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     900              $C$DW$101       .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$101, DW_AT_name("INTx5")
     903                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTx5")
     904                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     905                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$102       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     909                      .dwattr $C$DW$102, DW_AT_name("INTx6")
     910                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTx6")
     911                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     912                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     914              $C$DW$103       .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$103, DW_AT_name("INTx7")
     917                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx7")
     918                      .dwattr $C$DW$103, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     919                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$104       .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$104, DW_AT_name("INTx8")
     924                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx8")
     925                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$105       .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$105, DW_AT_name("INTx9")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   18

     931                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx9")
     932                      .dwattr $C$DW$105, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$106       .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$106, DW_AT_name("INTx10")
     938                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx10")
     939                      .dwattr $C$DW$106, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     940                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$107       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$107, DW_AT_name("INTx11")
     945                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx11")
     946                      .dwattr $C$DW$107, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$108       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$108, DW_AT_name("INTx12")
     952                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx12")
     953                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     954                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$109       .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$109, DW_AT_name("INTx13")
     959                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx13")
     960                      .dwattr $C$DW$109, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     961                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$110       .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$110, DW_AT_name("INTx14")
     966                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx14")
     967                      .dwattr $C$DW$110, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     968                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     970              $C$DW$111       .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     972                      .dwattr $C$DW$111, DW_AT_name("INTx15")
     973                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx15")
     974                      .dwattr $C$DW$111, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     975                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     977              $C$DW$112       .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$112, DW_AT_name("INTx16")
     980                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx16")
     981                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     982                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     984                      .dwendtag $C$DW$T$32
     985              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   19

     986              
     987              $C$DW$T$33      .dwtag  DW_TAG_union_type
     988                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
     989                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     990              $C$DW$113       .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$113, DW_AT_name("all")
     993                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
     994                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$114       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$32)
     998                      .dwattr $C$DW$114, DW_AT_name("bit")
     999                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1000                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1002                      .dwendtag $C$DW$T$33
    1003              
    1004              
    1005              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1006                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    1007                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1008              $C$DW$115       .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$115, DW_AT_name("INTx1")
    1011                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx1")
    1012                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$116       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$116, DW_AT_name("INTx2")
    1018                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx2")
    1019                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1020                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$117       .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$117, DW_AT_name("INTx3")
    1025                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx3")
    1026                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$118       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$118, DW_AT_name("INTx4")
    1032                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx4")
    1033                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$119       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$119, DW_AT_name("INTx5")
    1039                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INTx5")
    1040                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   20

    1041                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$120       .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$120, DW_AT_name("INTx6")
    1046                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INTx6")
    1047                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$121       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$121, DW_AT_name("INTx7")
    1053                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTx7")
    1054                      .dwattr $C$DW$121, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1055                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$122       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$122, DW_AT_name("INTx8")
    1060                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_INTx8")
    1061                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$123       .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$123, DW_AT_name("INTx9")
    1067                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx9")
    1068                      .dwattr $C$DW$123, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$124       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$124, DW_AT_name("INTx10")
    1074                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx10")
    1075                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1076                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$125       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$125, DW_AT_name("INTx11")
    1081                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTx11")
    1082                      .dwattr $C$DW$125, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1083                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$126       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$126, DW_AT_name("INTx12")
    1088                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_INTx12")
    1089                      .dwattr $C$DW$126, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1090                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$127       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$127, DW_AT_name("INTx13")
    1095                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INTx13")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   21

    1096                      .dwattr $C$DW$127, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$128       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$128, DW_AT_name("INTx14")
    1102                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTx14")
    1103                      .dwattr $C$DW$128, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1106              $C$DW$129       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$129, DW_AT_name("INTx15")
    1109                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTx15")
    1110                      .dwattr $C$DW$129, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1111                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$130       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$130, DW_AT_name("INTx16")
    1116                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTx16")
    1117                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1118                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1120                      .dwendtag $C$DW$T$34
    1121              
    1122              
    1123              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1124                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    1125                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1126              $C$DW$131       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$131, DW_AT_name("all")
    1129                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1130                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1132              $C$DW$132       .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$34)
    1134                      .dwattr $C$DW$132, DW_AT_name("bit")
    1135                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1136                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1138                      .dwendtag $C$DW$T$35
    1139              
    1140              
    1141              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1142                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    1143                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1144              $C$DW$133       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$133, DW_AT_name("INTx1")
    1147                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_INTx1")
    1148                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1149                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1150                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   22

    1151              $C$DW$134       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$134, DW_AT_name("INTx2")
    1154                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INTx2")
    1155                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1156                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1158              $C$DW$135       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$135, DW_AT_name("INTx3")
    1161                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INTx3")
    1162                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1163                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$136       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$136, DW_AT_name("INTx4")
    1168                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_INTx4")
    1169                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1172              $C$DW$137       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$137, DW_AT_name("INTx5")
    1175                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_INTx5")
    1176                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1177                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$138       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$138, DW_AT_name("INTx6")
    1182                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_INTx6")
    1183                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1184                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1186              $C$DW$139       .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$139, DW_AT_name("INTx7")
    1189                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_INTx7")
    1190                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1191                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$140       .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$140, DW_AT_name("INTx8")
    1196                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_INTx8")
    1197                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1198                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$141       .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$141, DW_AT_name("INTx9")
    1203                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_INTx9")
    1204                      .dwattr $C$DW$141, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1205                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   23

    1206                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$142       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$142, DW_AT_name("INTx10")
    1210                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_INTx10")
    1211                      .dwattr $C$DW$142, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1212                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$143       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$143, DW_AT_name("INTx11")
    1217                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_INTx11")
    1218                      .dwattr $C$DW$143, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1219                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$144       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$144, DW_AT_name("INTx12")
    1224                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_INTx12")
    1225                      .dwattr $C$DW$144, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1226                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$145       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$145, DW_AT_name("INTx13")
    1231                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_INTx13")
    1232                      .dwattr $C$DW$145, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$146       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$146, DW_AT_name("INTx14")
    1238                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_INTx14")
    1239                      .dwattr $C$DW$146, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$147       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$147, DW_AT_name("INTx15")
    1245                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_INTx15")
    1246                      .dwattr $C$DW$147, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1247                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$148       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$148, DW_AT_name("INTx16")
    1252                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_INTx16")
    1253                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1256                      .dwendtag $C$DW$T$36
    1257              
    1258              
    1259              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1260                      .dwattr $C$DW$T$37, DW_AT_name("PIEIER4_REG")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   24

    1261                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1262              $C$DW$149       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$149, DW_AT_name("all")
    1265                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1266                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$150       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$36)
    1270                      .dwattr $C$DW$150, DW_AT_name("bit")
    1271                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1272                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1274                      .dwendtag $C$DW$T$37
    1275              
    1276              
    1277              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1278                      .dwattr $C$DW$T$38, DW_AT_name("PIEIER5_BITS")
    1279                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1280              $C$DW$151       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$151, DW_AT_name("INTx1")
    1283                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_INTx1")
    1284                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1287              $C$DW$152       .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1289                      .dwattr $C$DW$152, DW_AT_name("INTx2")
    1290                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INTx2")
    1291                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1292                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$153       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$153, DW_AT_name("INTx3")
    1297                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_INTx3")
    1298                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1299                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$154       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$154, DW_AT_name("INTx4")
    1304                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INTx4")
    1305                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1306                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$155       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$155, DW_AT_name("INTx5")
    1311                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_INTx5")
    1312                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1313                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$156       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:40 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_PieCtrl.asm                                                  PAGE   25

    1316                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$156, DW_AT_name("INTx6")
    1318                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_INTx6")
    1319                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1320                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$157       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$157, DW_AT_name("INTx7")
    1325                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_INTx7")
    1326                      .dwattr $C$DW$157, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1327                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
