TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:37:23 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("InputXbarRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_InputXbarRegs")

    1501              $C$DW$92        .dwtag  DW_TAG_variable, DW_AT_name("gpioDataReg")
    1502                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_gpioDataReg")
    1503                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$382)
    1504                      .dwattr $C$DW$92, DW_AT_location[DW_OP_breg20 -4]
    1505              $C$DW$93        .dwtag  DW_TAG_variable, DW_AT_name("pinMask")
    1506                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_pinMask")
    1507                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1508                      .dwattr $C$DW$93, DW_AT_location[DW_OP_breg20 -6]
    1509 0000022d 9742          MOV       *-SP[2],AH            ; [CPU_] |354| 
    1510 0000022e 9641          MOV       *-SP[1],AL            ; [CPU_] |354| 
    1511                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1512 0000022f FFC4          LSR       AL,5                  ; [CPU_] |358| 
    1513 00000230 2901          CLRC      SXM                   ; [CPU_] 
    1514 00000231 8F00!         MOVL      XAR4,#_GpioDataRegs   ; [CPU_U] |358| 
         00000232 0000 
    1515 00000233 FF81          LSL       AL,2                  ; [CPU_] |358| 
    1516 00000234 5603          MOV       ACC,AL << 1           ; [CPU_] |358| 
         00000235 01A9 
    1517 00000236 5601          ADDL      XAR4,ACC              ; [CPU_] |358| 
         00000237 00A4 
    1518 00000238 A844          MOVL      *-SP[4],XAR4          ; [CPU_] |358| 
    1519                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1520 00000239 0201          MOVB      ACC,#1                ; [CPU_] |359| 
    1521 0000023a 1EA6          MOVL      XAR6,ACC              ; [CPU_] |359| 
    1522 0000023b 9241          MOV       AL,*-SP[1]            ; [CPU_] |359| 
    1523 0000023c 901F          ANDB      AL,#0x1f              ; [CPU_] |359| 
    1524 0000023d 2DA9          MOV       T,AL                  ; [CPU_] |359| 
    1525 0000023e 06A6          MOVL      ACC,XAR6              ; [CPU_] |359| 
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   30

    1526 0000023f 563B          LSLL      ACC,T                 ; [CPU_] |359| 
    1527 00000240 1E46          MOVL      *-SP[6],ACC           ; [CPU_] |359| 
    1528                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1529 00000241 9242          MOV       AL,*-SP[2]            ; [CPU_] |361| 
    1530 00000242 ED04          BF        $C$L21,NEQ            ; [CPU_] |361| 
    1531                      ; branchcc occurs ; [] |361| 
    1532                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1533 00000243 0646          MOVL      ACC,*-SP[6]           ; [CPU_] |362| 
    1534 00000244 1EE4          MOVL      *+XAR4[4],ACC         ; [CPU_] |362| 
    1535 00000245 6F03          B         $C$L22,UNC            ; [CPU_] |362| 
    1536                      ; branch occurs ; [] |362| 
    1537 00000246       $C$L21:    
    1538                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1539 00000246 0646          MOVL      ACC,*-SP[6]           ; [CPU_] |364| 
    1540 00000247 1ED4          MOVL      *+XAR4[2],ACC         ; [CPU_] |364| 
    1541                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/source/F2837xS_Gpio.c",li
    1542 00000248       $C$L22:    
    1543 00000248 FE86          SUBB      SP,#6                 ; [CPU_U] 
    1544                      .dwcfi  cfa_offset, -2
    1545              $C$DW$94        .dwtag  DW_TAG_TI_branch
    1546                      .dwattr $C$DW$94, DW_AT_low_pc(0x00)
    1547                      .dwattr $C$DW$94, DW_AT_TI_return
    1548 00000249 0006          LRETR     ; [CPU_] 
    1549                      ; return occurs ; [] 
    1550                      .dwattr $C$DW$87, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xS/v170/F2837xS_common/so
    1551                      .dwattr $C$DW$87, DW_AT_TI_end_line(0x16d)
    1552                      .dwattr $C$DW$87, DW_AT_TI_end_column(0x01)
    1553                      .dwendentry
    1554                      .dwendtag $C$DW$87
    1555              
    1556              ;**************************************************************
    1557              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1558              ;**************************************************************
    1559                      .global _InputXbarRegs
    1560                      .global _GpioDataRegs
    1561                      .global _DevCfgRegs
    1562                      .global _GpioCtrlRegs
    1563              
    1564              ;***************************************************************
    1565              ;* TYPE INFORMATION                                            *
    1566              ;***************************************************************
    1567              
    1568              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1569                      .dwattr $C$DW$T$20, DW_AT_name("DC0_BITS")
    1570                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1571              $C$DW$95        .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$95, DW_AT_name("SINGLE_CORE")
    1574                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SINGLE_CORE")
    1575                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1576                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1578              $C$DW$96        .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   31

    1581                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1582                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1583                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1585              $C$DW$97        .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1587                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
    1588                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
    1589                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1590                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1591                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1592                      .dwendtag $C$DW$T$20
    1593              
    1594              
    1595              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1596                      .dwattr $C$DW$T$22, DW_AT_name("DC0_REG")
    1597                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1598              $C$DW$98        .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1600                      .dwattr $C$DW$98, DW_AT_name("all")
    1601                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    1602                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$99        .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1606                      .dwattr $C$DW$99, DW_AT_name("bit")
    1607                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    1608                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1610                      .dwendtag $C$DW$T$22
    1611              
    1612              
    1613              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1614                      .dwattr $C$DW$T$23, DW_AT_name("DC10_BITS")
    1615                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1616              $C$DW$100       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$100, DW_AT_name("I2C_A")
    1619                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_I2C_A")
    1620                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$101       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$101, DW_AT_name("I2C_B")
    1626                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_I2C_B")
    1627                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1628                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$102       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1633                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    1634                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1635                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   32

    1636                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$103       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$103, DW_AT_name("rsvd2")
    1640                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd2")
    1641                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1642                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1643                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$104       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$104, DW_AT_name("rsvd3")
    1647                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd3")
    1648                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1649                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1650                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$105       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$105, DW_AT_name("rsvd4")
    1654                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd4")
    1655                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1656                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1657                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1658                      .dwendtag $C$DW$T$23
    1659              
    1660              
    1661              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1662                      .dwattr $C$DW$T$24, DW_AT_name("DC10_REG")
    1663                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1664              $C$DW$106       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1666                      .dwattr $C$DW$106, DW_AT_name("all")
    1667                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1668                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$107       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$23)
    1672                      .dwattr $C$DW$107, DW_AT_name("bit")
    1673                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1674                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1676                      .dwendtag $C$DW$T$24
    1677              
    1678              
    1679              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1680                      .dwattr $C$DW$T$25, DW_AT_name("DC11_BITS")
    1681                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1682              $C$DW$108       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1684                      .dwattr $C$DW$108, DW_AT_name("CAN_A")
    1685                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CAN_A")
    1686                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$109       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   33

    1691                      .dwattr $C$DW$109, DW_AT_name("CAN_B")
    1692                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CAN_B")
    1693                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1694                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$110       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1699                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1700                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1703              $C$DW$111       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1706                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1707                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1708                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$112       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$112, DW_AT_name("rsvd3")
    1713                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd3")
    1714                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1715                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$113       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$113, DW_AT_name("rsvd4")
    1720                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd4")
    1721                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1722                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1723                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1724                      .dwendtag $C$DW$T$25
    1725              
    1726              
    1727              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1728                      .dwattr $C$DW$T$26, DW_AT_name("DC11_REG")
    1729                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1730              $C$DW$114       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1732                      .dwattr $C$DW$114, DW_AT_name("all")
    1733                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    1734                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1736              $C$DW$115       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$25)
    1738                      .dwattr $C$DW$115, DW_AT_name("bit")
    1739                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    1740                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1742                      .dwendtag $C$DW$T$26
    1743              
    1744              
    1745              $C$DW$T$27      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   34

    1746                      .dwattr $C$DW$T$27, DW_AT_name("DC12_BITS")
    1747                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1748              $C$DW$116       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$116, DW_AT_name("McBSP_A")
    1751                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_McBSP_A")
    1752                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1753                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1754                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$117       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1757                      .dwattr $C$DW$117, DW_AT_name("McBSP_B")
    1758                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_McBSP_B")
    1759                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1760                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1761                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$118       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1764                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1765                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1766                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1767                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$119       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$119, DW_AT_name("USB_A")
    1772                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_USB_A")
    1773                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1774                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1775                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1776              $C$DW$120       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1778                      .dwattr $C$DW$120, DW_AT_name("rsvd2")
    1779                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd2")
    1780                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1781                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1782                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$121       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$121, DW_AT_name("rsvd3")
    1786                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd3")
    1787                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1788                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1789                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1790                      .dwendtag $C$DW$T$27
    1791              
    1792              
    1793              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1794                      .dwattr $C$DW$T$28, DW_AT_name("DC12_REG")
    1795                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1796              $C$DW$122       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1798                      .dwattr $C$DW$122, DW_AT_name("all")
    1799                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1800                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   35

    1801                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1802              $C$DW$123       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    1804                      .dwattr $C$DW$123, DW_AT_name("bit")
    1805                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1806                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1808                      .dwendtag $C$DW$T$28
    1809              
    1810              
    1811              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1812                      .dwattr $C$DW$T$29, DW_AT_name("DC13_BITS")
    1813                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1814              $C$DW$124       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$124, DW_AT_name("uPP_A")
    1817                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_uPP_A")
    1818                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1819                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1820                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$125       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1824                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1825                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1826                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$126       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1831                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1832                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1833                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$127       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$127, DW_AT_name("rsvd3")
    1838                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd3")
    1839                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1840                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1841                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1842                      .dwendtag $C$DW$T$29
    1843              
    1844              
    1845              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1846                      .dwattr $C$DW$T$30, DW_AT_name("DC13_REG")
    1847                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1848              $C$DW$128       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    1850                      .dwattr $C$DW$128, DW_AT_name("all")
    1851                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    1852                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1854              $C$DW$129       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   36

    1856                      .dwattr $C$DW$129, DW_AT_name("bit")
    1857                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    1858                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1859                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1860                      .dwendtag $C$DW$T$30
    1861              
    1862              
    1863              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1864                      .dwattr $C$DW$T$31, DW_AT_name("DC14_BITS")
    1865                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1866              $C$DW$130       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1868                      .dwattr $C$DW$130, DW_AT_name("ADC_A")
    1869                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADC_A")
    1870                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1871                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$131       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$131, DW_AT_name("ADC_B")
    1876                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADC_B")
    1877                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1878                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1880              $C$DW$132       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$132, DW_AT_name("ADC_C")
    1883                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADC_C")
    1884                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1885                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$133       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$133, DW_AT_name("ADC_D")
    1890                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADC_D")
    1891                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1892                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1894              $C$DW$134       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1897                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1898                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1899                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1901              $C$DW$135       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$135, DW_AT_name("rsvd2")
    1904                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd2")
    1905                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1906                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1907                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1908                      .dwendtag $C$DW$T$31
    1909              
    1910              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   37

    1911              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1912                      .dwattr $C$DW$T$32, DW_AT_name("DC14_REG")
    1913                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1914              $C$DW$136       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1916                      .dwattr $C$DW$136, DW_AT_name("all")
    1917                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1918                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$137       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$31)
    1922                      .dwattr $C$DW$137, DW_AT_name("bit")
    1923                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1924                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1926                      .dwendtag $C$DW$T$32
    1927              
    1928              
    1929              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1930                      .dwattr $C$DW$T$33, DW_AT_name("DC15_BITS")
    1931                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1932              $C$DW$138       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1934                      .dwattr $C$DW$138, DW_AT_name("CMPSS1")
    1935                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CMPSS1")
    1936                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$139       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$139, DW_AT_name("CMPSS2")
    1942                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CMPSS2")
    1943                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1944                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1946              $C$DW$140       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$140, DW_AT_name("CMPSS3")
    1949                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CMPSS3")
    1950                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1951                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$141       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$141, DW_AT_name("CMPSS4")
    1956                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CMPSS4")
    1957                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1958                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1960              $C$DW$142       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1962                      .dwattr $C$DW$142, DW_AT_name("CMPSS5")
    1963                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CMPSS5")
    1964                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1965                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   38

    1966                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1967              $C$DW$143       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$143, DW_AT_name("CMPSS6")
    1970                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CMPSS6")
    1971                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1972                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$144       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$144, DW_AT_name("CMPSS7")
    1977                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CMPSS7")
    1978                      .dwattr $C$DW$144, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1979                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1980                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$145       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1983                      .dwattr $C$DW$145, DW_AT_name("CMPSS8")
    1984                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_CMPSS8")
    1985                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1986                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$146       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1990                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    1991                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    1992                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1993                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$147       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1997                      .dwattr $C$DW$147, DW_AT_name("rsvd2")
    1998                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd2")
    1999                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2000                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2001                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2002                      .dwendtag $C$DW$T$33
    2003              
    2004              
    2005              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2006                      .dwattr $C$DW$T$34, DW_AT_name("DC15_REG")
    2007                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2008              $C$DW$148       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    2010                      .dwattr $C$DW$148, DW_AT_name("all")
    2011                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_all")
    2012                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2014              $C$DW$149       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$33)
    2016                      .dwattr $C$DW$149, DW_AT_name("bit")
    2017                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_bit")
    2018                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2020                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   39

    2021              
    2022              
    2023              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2024                      .dwattr $C$DW$T$35, DW_AT_name("DC17_BITS")
    2025                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2026              $C$DW$150       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2028                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    2029                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    2030                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2033              $C$DW$151       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    2036                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    2037                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2038                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$152       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2042                      .dwattr $C$DW$152, DW_AT_name("rsvd3")
    2043                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd3")
    2044                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2045                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$153       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2049                      .dwattr $C$DW$153, DW_AT_name("rsvd4")
    2050                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd4")
    2051                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2052                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$154       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2056                      .dwattr $C$DW$154, DW_AT_name("rsvd5")
    2057                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd5")
    2058                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2059                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2061              $C$DW$155       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2063                      .dwattr $C$DW$155, DW_AT_name("DAC_A")
    2064                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DAC_A")
    2065                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2066                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2067                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$156       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2070                      .dwattr $C$DW$156, DW_AT_name("DAC_B")
    2071                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_DAC_B")
    2072                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2073                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2074                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2075              $C$DW$157       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   40

    2076                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$157, DW_AT_name("DAC_C")
    2078                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_DAC_C")
    2079                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2080                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2081                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$158       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2084                      .dwattr $C$DW$158, DW_AT_name("rsvd6")
    2085                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd6")
    2086                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2087                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2088                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$159       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$159, DW_AT_name("rsvd7")
    2092                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd7")
    2093                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2094                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2095                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2096                      .dwendtag $C$DW$T$35
    2097              
    2098              
    2099              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2100                      .dwattr $C$DW$T$36, DW_AT_name("DC17_REG")
    2101                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2102              $C$DW$160       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2104                      .dwattr $C$DW$160, DW_AT_name("all")
    2105                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    2106                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$161       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$35)
    2110                      .dwattr $C$DW$161, DW_AT_name("bit")
    2111                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    2112                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2114                      .dwendtag $C$DW$T$36
    2115              
    2116              
    2117              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2118                      .dwattr $C$DW$T$37, DW_AT_name("DC18_BITS")
    2119                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2120              $C$DW$162       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$162, DW_AT_name("LS0_1")
    2123                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_LS0_1")
    2124                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2125                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2126                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2127              $C$DW$163       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2129                      .dwattr $C$DW$163, DW_AT_name("LS1_1")
    2130                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_LS1_1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   41

    2131                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2132                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2134              $C$DW$164       .dwtag  DW_TAG_member
    2135                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2136                      .dwattr $C$DW$164, DW_AT_name("LS2_1")
    2137                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_LS2_1")
    2138                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2139                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2141              $C$DW$165       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2143                      .dwattr $C$DW$165, DW_AT_name("LS3_1")
    2144                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_LS3_1")
    2145                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2146                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2147                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$166       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$166, DW_AT_name("LS4_1")
    2151                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_LS4_1")
    2152                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2153                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2154                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2155              $C$DW$167       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2157                      .dwattr $C$DW$167, DW_AT_name("LS5_1")
    2158                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_LS5_1")
    2159                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2160                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2161                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2162              $C$DW$168       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2164                      .dwattr $C$DW$168, DW_AT_name("rsvd1")
    2165                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd1")
    2166                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2167                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2168                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2169              $C$DW$169       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2171                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    2172                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    2173                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2174                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2175                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2176                      .dwendtag $C$DW$T$37
    2177              
    2178              
    2179              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2180                      .dwattr $C$DW$T$38, DW_AT_name("DC18_REG")
    2181                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2182              $C$DW$170       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2184                      .dwattr $C$DW$170, DW_AT_name("all")
    2185                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   42

    2186                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$171       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$37)
    2190                      .dwattr $C$DW$171, DW_AT_name("bit")
    2191                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2192                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2194                      .dwendtag $C$DW$T$38
    2195              
    2196              
    2197              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2198                      .dwattr $C$DW$T$39, DW_AT_name("DC1_BITS")
    2199                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2200              $C$DW$172       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$172, DW_AT_name("CPU1_FPU_TMU")
    2203                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_CPU1_FPU_TMU")
    2204                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2205                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2206                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2207              $C$DW$173       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2209                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    2210                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    2211                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2212                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2214              $C$DW$174       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2216                      .dwattr $C$DW$174, DW_AT_name("CPU1_VCU")
    2217                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CPU1_VCU")
    2218                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2219                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$175       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2224                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2225                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2226                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2228              $C$DW$176       .dwtag  DW_TAG_member
    2229                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2230                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    2231                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    2232                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2233                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2235              $C$DW$177       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2237                      .dwattr $C$DW$177, DW_AT_name("CPU1_CLA1")
    2238                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_CPU1_CLA1")
    2239                      .dwattr $C$DW$177, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2240                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   43

    2241                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$178       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$178, DW_AT_name("rsvd4")
    2245                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd4")
    2246                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2247                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$179       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2251                      .dwattr $C$DW$179, DW_AT_name("rsvd5")
    2252                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd5")
    2253                      .dwattr $C$DW$179, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2254                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$180       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$180, DW_AT_name("rsvd6")
    2259                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd6")
    2260                      .dwattr $C$DW$180, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2261                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$181       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$181, DW_AT_name("rsvd7")
    2266                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd7")
    2267                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2268                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2270              $C$DW$182       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2272                      .dwattr $C$DW$182, DW_AT_name("rsvd8")
    2273                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd8")
    2274                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2275                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2276                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2277                      .dwendtag $C$DW$T$39
    2278              
    2279              
    2280              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2281                      .dwattr $C$DW$T$40, DW_AT_name("DC1_REG")
    2282                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2283              $C$DW$183       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    2285                      .dwattr $C$DW$183, DW_AT_name("all")
    2286                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    2287                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$184       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$39)
    2291                      .dwattr $C$DW$184, DW_AT_name("bit")
    2292                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    2293                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2295                      .dwendtag $C$DW$T$40
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   44

    2296              
    2297              
    2298              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2299                      .dwattr $C$DW$T$41, DW_AT_name("DC20_BITS")
    2300                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2301              $C$DW$185       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2303                      .dwattr $C$DW$185, DW_AT_name("GS0")
    2304                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GS0")
    2305                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2306                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2307                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2308              $C$DW$186       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2310                      .dwattr $C$DW$186, DW_AT_name("GS1")
    2311                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GS1")
    2312                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2313                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$187       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2317                      .dwattr $C$DW$187, DW_AT_name("GS2")
    2318                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GS2")
    2319                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2320                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$188       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$188, DW_AT_name("GS3")
    2325                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GS3")
    2326                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2327                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$189       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2331                      .dwattr $C$DW$189, DW_AT_name("GS4")
    2332                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GS4")
    2333                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2334                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2336              $C$DW$190       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2338                      .dwattr $C$DW$190, DW_AT_name("GS5")
    2339                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GS5")
    2340                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2341                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2342                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$191       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$191, DW_AT_name("GS6")
    2346                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GS6")
    2347                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2348                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2350              $C$DW$192       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   45

    2351                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2352                      .dwattr $C$DW$192, DW_AT_name("GS7")
    2353                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GS7")
    2354                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2355                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$193       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$193, DW_AT_name("GS8")
    2360                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GS8")
    2361                      .dwattr $C$DW$193, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2362                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2364              $C$DW$194       .dwtag  DW_TAG_member
    2365                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2366                      .dwattr $C$DW$194, DW_AT_name("GS9")
    2367                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GS9")
    2368                      .dwattr $C$DW$194, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2369                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2370                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2371              $C$DW$195       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2373                      .dwattr $C$DW$195, DW_AT_name("GS10")
    2374                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GS10")
    2375                      .dwattr $C$DW$195, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2376                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2377                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2378              $C$DW$196       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2380                      .dwattr $C$DW$196, DW_AT_name("GS11")
    2381                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GS11")
    2382                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2383                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2384                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$197       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2387                      .dwattr $C$DW$197, DW_AT_name("GS12")
    2388                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GS12")
    2389                      .dwattr $C$DW$197, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2390                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2391                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2392              $C$DW$198       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$198, DW_AT_name("GS13")
    2395                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GS13")
    2396                      .dwattr $C$DW$198, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2397                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2398                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2399              $C$DW$199       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2401                      .dwattr $C$DW$199, DW_AT_name("GS14")
    2402                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GS14")
    2403                      .dwattr $C$DW$199, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2404                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   46

    2406              $C$DW$200       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2408                      .dwattr $C$DW$200, DW_AT_name("GS15")
    2409                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GS15")
    2410                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2411                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2412                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2413              $C$DW$201       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2415                      .dwattr $C$DW$201, DW_AT_name("rsvd1")
    2416                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd1")
    2417                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2418                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2419                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2420                      .dwendtag $C$DW$T$41
    2421              
    2422              
    2423              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2424                      .dwattr $C$DW$T$42, DW_AT_name("DC20_REG")
    2425                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2426              $C$DW$202       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2428                      .dwattr $C$DW$202, DW_AT_name("all")
    2429                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    2430                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2431                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2432              $C$DW$203       .dwtag  DW_TAG_member
    2433                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$41)
    2434                      .dwattr $C$DW$203, DW_AT_name("bit")
    2435                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    2436                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2438                      .dwendtag $C$DW$T$42
    2439              
    2440              
    2441              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2442                      .dwattr $C$DW$T$43, DW_AT_name("DC2_BITS")
    2443                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2444              $C$DW$204       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2446                      .dwattr $C$DW$204, DW_AT_name("EMIF1")
    2447                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EMIF1")
    2448                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2449                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2450                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2451              $C$DW$205       .dwtag  DW_TAG_member
    2452                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2453                      .dwattr $C$DW$205, DW_AT_name("EMIF2")
    2454                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EMIF2")
    2455                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2456                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2457                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2458              $C$DW$206       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2460                      .dwattr $C$DW$206, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   47

    2461                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd1")
    2462                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2463                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2465              $C$DW$207       .dwtag  DW_TAG_member
    2466                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2467                      .dwattr $C$DW$207, DW_AT_name("rsvd2")
    2468                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd2")
    2469                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2470                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2471                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2472                      .dwendtag $C$DW$T$43
    2473              
    2474              
    2475              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2476                      .dwattr $C$DW$T$44, DW_AT_name("DC2_REG")
    2477                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2478              $C$DW$208       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2480                      .dwattr $C$DW$208, DW_AT_name("all")
    2481                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    2482                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2483                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$209       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$43)
    2486                      .dwattr $C$DW$209, DW_AT_name("bit")
    2487                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    2488                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2489                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2490                      .dwendtag $C$DW$T$44
    2491              
    2492              
    2493              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2494                      .dwattr $C$DW$T$45, DW_AT_name("DC3_BITS")
    2495                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2496              $C$DW$210       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$210, DW_AT_name("EPWM1")
    2499                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_EPWM1")
    2500                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2501                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2503              $C$DW$211       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$211, DW_AT_name("EPWM2")
    2506                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_EPWM2")
    2507                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2508                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$212       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2512                      .dwattr $C$DW$212, DW_AT_name("EPWM3")
    2513                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_EPWM3")
    2514                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2515                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   48

    2516                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$213       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$213, DW_AT_name("EPWM4")
    2520                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_EPWM4")
    2521                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2522                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$214       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2526                      .dwattr $C$DW$214, DW_AT_name("EPWM5")
    2527                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_EPWM5")
    2528                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2529                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2531              $C$DW$215       .dwtag  DW_TAG_member
    2532                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2533                      .dwattr $C$DW$215, DW_AT_name("EPWM6")
    2534                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_EPWM6")
    2535                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2536                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2537                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$216       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$216, DW_AT_name("EPWM7")
    2541                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_EPWM7")
    2542                      .dwattr $C$DW$216, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2545              $C$DW$217       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2547                      .dwattr $C$DW$217, DW_AT_name("EPWM8")
    2548                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_EPWM8")
    2549                      .dwattr $C$DW$217, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2550                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2551                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2552              $C$DW$218       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2554                      .dwattr $C$DW$218, DW_AT_name("EPWM9")
    2555                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_EPWM9")
    2556                      .dwattr $C$DW$218, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2557                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2558                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$219       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2561                      .dwattr $C$DW$219, DW_AT_name("EPWM10")
    2562                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_EPWM10")
    2563                      .dwattr $C$DW$219, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2564                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2565                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$220       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2568                      .dwattr $C$DW$220, DW_AT_name("EPWM11")
    2569                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_EPWM11")
    2570                      .dwattr $C$DW$220, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   49

    2571                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2573              $C$DW$221       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$221, DW_AT_name("EPWM12")
    2576                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_EPWM12")
    2577                      .dwattr $C$DW$221, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2578                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$222       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2582                      .dwattr $C$DW$222, DW_AT_name("rsvd1")
    2583                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd1")
    2584                      .dwattr $C$DW$222, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2585                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2586                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2587              $C$DW$223       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2589                      .dwattr $C$DW$223, DW_AT_name("rsvd2")
    2590                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd2")
    2591                      .dwattr $C$DW$223, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2592                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2593                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2594              $C$DW$224       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2596                      .dwattr $C$DW$224, DW_AT_name("rsvd3")
    2597                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd3")
    2598                      .dwattr $C$DW$224, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2599                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2601              $C$DW$225       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2603                      .dwattr $C$DW$225, DW_AT_name("rsvd4")
    2604                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd4")
    2605                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2606                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2607                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2608              $C$DW$226       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2610                      .dwattr $C$DW$226, DW_AT_name("rsvd5")
    2611                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd5")
    2612                      .dwattr $C$DW$226, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2613                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2614                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2615                      .dwendtag $C$DW$T$45
    2616              
    2617              
    2618              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2619                      .dwattr $C$DW$T$46, DW_AT_name("DC3_REG")
    2620                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2621              $C$DW$227       .dwtag  DW_TAG_member
    2622                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$21)
    2623                      .dwattr $C$DW$227, DW_AT_name("all")
    2624                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_all")
    2625                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   50

    2626                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2627              $C$DW$228       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$45)
    2629                      .dwattr $C$DW$228, DW_AT_name("bit")
    2630                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_bit")
    2631                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2632                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2633                      .dwendtag $C$DW$T$46
    2634              
    2635              
    2636              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2637                      .dwattr $C$DW$T$47, DW_AT_name("DC4_BITS")
    2638                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2639              $C$DW$229       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2641                      .dwattr $C$DW$229, DW_AT_name("ECAP1")
    2642                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_ECAP1")
    2643                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$230       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2648                      .dwattr $C$DW$230, DW_AT_name("ECAP2")
    2649                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_ECAP2")
    2650                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2651                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$231       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$231, DW_AT_name("ECAP3")
    2656                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_ECAP3")
    2657                      .dwattr $C$DW$231, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2658                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$232       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2662                      .dwattr $C$DW$232, DW_AT_name("ECAP4")
    2663                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_ECAP4")
    2664                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2665                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2667              $C$DW$233       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$233, DW_AT_name("ECAP5")
    2670                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_ECAP5")
    2671                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2672                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$234       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2676                      .dwattr $C$DW$234, DW_AT_name("ECAP6")
    2677                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_ECAP6")
    2678                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2679                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   51

    2681              $C$DW$235       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2683                      .dwattr $C$DW$235, DW_AT_name("rsvd1")
    2684                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd1")
    2685                      .dwattr $C$DW$235, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$236       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$236, DW_AT_name("rsvd2")
    2691                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd2")
    2692                      .dwattr $C$DW$236, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$237       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$237, DW_AT_name("rsvd3")
    2698                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd3")
    2699                      .dwattr $C$DW$237, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2700                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$238       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2704                      .dwattr $C$DW$238, DW_AT_name("rsvd4")
    2705                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd4")
    2706                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2707                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2708                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2709                      .dwendtag $C$DW$T$47
    2710              
    2711              
    2712              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2713                      .dwattr $C$DW$T$48, DW_AT_name("DC4_REG")
    2714                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2715              $C$DW$239       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$21)
    2717                      .dwattr $C$DW$239, DW_AT_name("all")
    2718                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
    2719                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2720                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2721              $C$DW$240       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$47)
    2723                      .dwattr $C$DW$240, DW_AT_name("bit")
    2724                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
    2725                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2726                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2727                      .dwendtag $C$DW$T$48
    2728              
    2729              
    2730              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2731                      .dwattr $C$DW$T$49, DW_AT_name("DC5_BITS")
    2732                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    2733              $C$DW$241       .dwtag  DW_TAG_member
    2734                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2735                      .dwattr $C$DW$241, DW_AT_name("EQEP1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:25 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
F2837xS_Gpio.asm                                                     PAGE   52

    2736                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_EQEP1")
    2737                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2738                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2739                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
