TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:27:01 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/flash.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     859              $C$DW$89        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_InvalidCpu"), DW_AT_const_value(0x1f9)
     860              $C$DW$90        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_InvalidBank"), DW_AT_const_value(0x1fa)
     861              $C$DW$91        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_InvalidAddress"), DW_AT_const_value(0x1fb)
     862              $C$DW$92        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_InvalidReadMode"), DW_AT_const_value(0x1fc)
     863              $C$DW$93        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_AsyncIncorrectDataBufferLength"), DW_AT_con
     864              $C$DW$94        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_AsyncIncorrectEccBufferLength"), DW_AT_cons
     865              $C$DW$95        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_AsyncDataEccBufferLengthMismatch"), DW_AT_c
     866              $C$DW$96        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_Error_FeatureNotAvailable"), DW_AT_const_value(0x
     867                      .dwendtag $C$DW$T$358
     868              
     869              $C$DW$T$359     .dwtag  DW_TAG_typedef, DW_AT_name("Fapi_StatusType")
     870                      .dwattr $C$DW$T$359, DW_AT_type(*$C$DW$T$358)
     871                      .dwattr $C$DW$T$359, DW_AT_language(DW_LANG_C)
     872              
     873              $C$DW$T$362     .dwtag  DW_TAG_enumeration_type
     874                      .dwattr $C$DW$T$362, DW_AT_byte_size(0x01)
     875              $C$DW$97        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank0"), DW_AT_const_value(0x00)
     876              $C$DW$98        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank1"), DW_AT_const_value(0x01)
     877              $C$DW$99        .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank2"), DW_AT_const_value(0x02)
     878              $C$DW$100       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank3"), DW_AT_const_value(0x03)
     879              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank4"), DW_AT_const_value(0x04)
     880              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank5"), DW_AT_const_value(0x05)
     881              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank6"), DW_AT_const_value(0x06)
     882              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_FlashBank7"), DW_AT_const_value(0x07)
     883                      .dwendtag $C$DW$T$362
     884              
     885              $C$DW$T$363     .dwtag  DW_TAG_typedef, DW_AT_name("Fapi_FlashBankType")
     886                      .dwattr $C$DW$T$363, DW_AT_type(*$C$DW$T$362)
     887                      .dwattr $C$DW$T$363, DW_AT_language(DW_LANG_C)
     888              
     889              $C$DW$T$366     .dwtag  DW_TAG_enumeration_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   18

     890                      .dwattr $C$DW$T$366, DW_AT_byte_size(0x01)
     891              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_ProgramData"), DW_AT_const_value(0x02)
     892              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_EraseSector"), DW_AT_const_value(0x06)
     893              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_EraseBank"), DW_AT_const_value(0x08)
     894              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_ValidateSector"), DW_AT_const_value(0x0e)
     895              $C$DW$109       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_ClearStatus"), DW_AT_const_value(0x10)
     896              $C$DW$110       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_ProgramResume"), DW_AT_const_value(0x14)
     897              $C$DW$111       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_EraseResume"), DW_AT_const_value(0x16)
     898              $C$DW$112       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_ClearMore"), DW_AT_const_value(0x18)
     899                      .dwendtag $C$DW$T$366
     900              
     901              $C$DW$T$367     .dwtag  DW_TAG_typedef, DW_AT_name("Fapi_FlashStateCommandsType")
     902                      .dwattr $C$DW$T$367, DW_AT_type(*$C$DW$T$366)
     903                      .dwattr $C$DW$T$367, DW_AT_language(DW_LANG_C)
     904              
     905              $C$DW$T$383     .dwtag  DW_TAG_enumeration_type
     906                      .dwattr $C$DW$T$383, DW_AT_byte_size(0x01)
     907              $C$DW$113       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_AutoEccGeneration"), DW_AT_const_value(0x00)
     908              $C$DW$114       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_DataOnly"), DW_AT_const_value(0x01)
     909              $C$DW$115       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_EccOnly"), DW_AT_const_value(0x02)
     910              $C$DW$116       .dwtag  DW_TAG_enumerator, DW_AT_name("Fapi_DataAndEcc"), DW_AT_const_value(0x03)
     911                      .dwendtag $C$DW$T$383
     912              
     913              $C$DW$T$384     .dwtag  DW_TAG_typedef, DW_AT_name("Fapi_FlashProgrammingCommandsType")
     914                      .dwattr $C$DW$T$384, DW_AT_type(*$C$DW$T$383)
     915                      .dwattr $C$DW$T$384, DW_AT_language(DW_LANG_C)
     916              
     917              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     918                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     919              $C$DW$117       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$117, DW_AT_name("RM")
     922                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RM")
     923                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     924                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     925                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     926              $C$DW$118       .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$118, DW_AT_name("_FRDCNTL_Reserved_03_01")
     929                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("__FRDCNTL_Reserved_03_01")
     930                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x03)
     931                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     933              $C$DW$119       .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     935                      .dwattr $C$DW$119, DW_AT_name("ASWSTEN")
     936                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_ASWSTEN")
     937                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     938                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$120       .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$120, DW_AT_name("_FRDCNTL_Reserved_07_05")
     943                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("__FRDCNTL_Reserved_07_05")
     944                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x03)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   19

     945                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$121       .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$121, DW_AT_name("RWAIT")
     950                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_RWAIT")
     951                      .dwattr $C$DW$121, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     952                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$122       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$122, DW_AT_name("_FRDCNTL_Reserved_15_12")
     957                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("__FRDCNTL_Reserved_15_12")
     958                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     959                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$123       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$123, DW_AT_name("IDLEN")
     964                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IDLEN")
     965                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     966                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     967                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$124       .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$124, DW_AT_name("_FRDCNTL_Reserved_23_17")
     971                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("__FRDCNTL_Reserved_23_17")
     972                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x07)
     973                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     974                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$125       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$125, DW_AT_name("IFLUSH_HOLD")
     978                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IFLUSH_HOLD")
     979                      .dwattr $C$DW$125, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     980                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     981                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$126       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$126, DW_AT_name("_FRDCNTL_Reserved_31_28")
     985                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("__FRDCNTL_Reserved_31_28")
     986                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     987                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     988                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     989                      .dwendtag $C$DW$T$20
     990              
     991              
     992              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     993                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
     994              $C$DW$127       .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
     996                      .dwattr $C$DW$127, DW_AT_name("RM0")
     997                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_RM0")
     998                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     999                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   20

    1000                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1001              $C$DW$128       .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$128, DW_AT_name("RM1")
    1004                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_RM1")
    1005                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1006                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1008              $C$DW$129       .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$129, DW_AT_name("_FSPRD_Reserved_07_02")
    1011                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("__FSPRD_Reserved_07_02")
    1012                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    1013                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$130       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$130, DW_AT_name("RMBSEM")
    1018                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_RMBSEM")
    1019                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1020                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$131       .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$131, DW_AT_name("DIS_PREEMPT")
    1025                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_DIS_PREEMPT")
    1026                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1028                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$132       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$132, DW_AT_name("_FSPRD_Reserved_31_17")
    1032                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("__FSPRD_Reserved_31_17")
    1033                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1034                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1035                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1036                      .dwendtag $C$DW$T$21
    1037              
    1038              
    1039              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1040                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1041              $C$DW$133       .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1043                      .dwattr $C$DW$133, DW_AT_name("EDACEN")
    1044                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_EDACEN")
    1045                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1046                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1048              $C$DW$134       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$134, DW_AT_name("EZCV")
    1051                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_EZCV")
    1052                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1053                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   21

    1055              $C$DW$135       .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$135, DW_AT_name("EOCV")
    1058                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_EOCV")
    1059                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1060                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$136       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$136, DW_AT_name("_FEDACCTRL1_Reserved_07_06")
    1065                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("__FEDACCTRL1_Reserved_07_06")
    1066                      .dwattr $C$DW$136, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1067                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$137       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$137, DW_AT_name("EPEN")
    1072                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_EPEN")
    1073                      .dwattr $C$DW$137, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1074                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1076              $C$DW$138       .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$138, DW_AT_name("EZFEN")
    1079                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_EZFEN")
    1080                      .dwattr $C$DW$138, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$139       .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$139, DW_AT_name("EOFEN")
    1086                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_EOFEN")
    1087                      .dwattr $C$DW$139, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$140       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$140, DW_AT_name("_FEDACCTRL1_Reserved_15_11")
    1093                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("__FEDACCTRL1_Reserved_15_11")
    1094                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    1095                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$141       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$141, DW_AT_name("EDACMODE")
    1100                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_EDACMODE")
    1101                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1102                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1103                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$142       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$142, DW_AT_name("_FEDACCTRL1_Reserved_23_20")
    1107                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("__FEDACCTRL1_Reserved_23_20")
    1108                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1109                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   22

    1110                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$143       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$143, DW_AT_name("SUSP_IGNR")
    1114                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_SUSP_IGNR")
    1115                      .dwattr $C$DW$143, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1116                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1117                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1118              $C$DW$144       .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$144, DW_AT_name("_FEDACCTRL1_Reserved_31_25")
    1121                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("__FEDACCTRL1_Reserved_31_25")
    1122                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    1123                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1124                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1125                      .dwendtag $C$DW$T$22
    1126              
    1127              
    1128              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1129                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1130              $C$DW$145       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$145, DW_AT_name("SEC_THRESHOLD")
    1133                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SEC_THRESHOLD")
    1134                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1135                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$146       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$146, DW_AT_name("_FEDACCTRL2_Reserved_31_16")
    1140                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("__FEDACCTRL2_Reserved_31_16")
    1141                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1142                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1143                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1144                      .dwendtag $C$DW$T$23
    1145              
    1146              
    1147              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1148                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1149              $C$DW$147       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$147, DW_AT_name("COR_ERR_CNT")
    1152                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_COR_ERR_CNT")
    1153                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1154                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$148       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$148, DW_AT_name("_FCOR_ERR_CNT_Reserved_31_16")
    1159                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("__FCOR_ERR_CNT_Reserved_31_16")
    1160                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1161                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1162                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1163                      .dwendtag $C$DW$T$24
    1164              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   23

    1165              
    1166              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1167                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1168              $C$DW$149       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$149, DW_AT_name("SERR_POS")
    1171                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SERR_POS")
    1172                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1173                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$150       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$150, DW_AT_name("ECC_ERR")
    1178                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ECC_ERR")
    1179                      .dwattr $C$DW$150, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1180                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$151       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$151, DW_AT_name("B2_ERR")
    1185                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_B2_ERR")
    1186                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$152       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$152, DW_AT_name("_FCOR_ERR_POS_Reserved_15_10")
    1192                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("__FCOR_ERR_POS_Reserved_15_10")
    1193                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1194                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1196              $C$DW$153       .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$153, DW_AT_name("_FCOR_ERR_POS_Reserved_31_16")
    1199                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("__FCOR_ERR_POS_Reserved_31_16")
    1200                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1201                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1202                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1203                      .dwendtag $C$DW$T$25
    1204              
    1205              
    1206              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1207                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1208              $C$DW$154       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$154, DW_AT_name("ERR_PRF_FLG")
    1211                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ERR_PRF_FLG")
    1212                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$155       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$155, DW_AT_name("ERR_ZERO_FLG")
    1218                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ERR_ZERO_FLG")
    1219                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   24

    1220                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$156       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$156, DW_AT_name("ERR_ONE_FLG")
    1225                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ERR_ONE_FLG")
    1226                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$157       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$157, DW_AT_name("D_COR_ERR")
    1232                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_D_COR_ERR")
    1233                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1236              $C$DW$158       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$158, DW_AT_name("ECC0_MAL_ERR")
    1239                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ECC0_MAL_ERR")
    1240                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$159       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$159, DW_AT_name("ECC1_MAL_ERR")
    1246                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ECC1_MAL_ERR")
    1247                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1248                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$160       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$160, DW_AT_name("COM0_MAL_GOOD")
    1253                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_COM0_MAL_GOOD")
    1254                      .dwattr $C$DW$160, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1255                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1257              $C$DW$161       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$161, DW_AT_name("COM1_MAL_GOOD")
    1260                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_COM1_MAL_GOOD")
    1261                      .dwattr $C$DW$161, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1262                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$162       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$162, DW_AT_name("ECC_MUL_ERR")
    1267                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ECC_MUL_ERR")
    1268                      .dwattr $C$DW$162, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$163       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$163, DW_AT_name("BUF_PAR_ERR")
    1274                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_BUF_PAR_ERR")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   25

    1275                      .dwattr $C$DW$163, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$164       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$164, DW_AT_name("ADD_PAR_ERR")
    1281                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ADD_PAR_ERR")
    1282                      .dwattr $C$DW$164, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1283                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$165       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$165, DW_AT_name("ADD_TAG_ERR")
    1288                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ADD_TAG_ERR")
    1289                      .dwattr $C$DW$165, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$166       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$166, DW_AT_name("D_UNC_ERR")
    1295                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_D_UNC_ERR")
    1296                      .dwattr $C$DW$166, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$167       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$167, DW_AT_name("B2_ERR_IS_EE")
    1302                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_B2_ERR_IS_EE")
    1303                      .dwattr $C$DW$167, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$168       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$168, DW_AT_name("_FEDACSTATUS_Reserved_15_14")
    1309                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("__FEDACSTATUS_Reserved_15_14")
    1310                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1311                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$169       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$169, DW_AT_name("B2_COR_ERR")
    1316                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_B2_COR_ERR")
    1317                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$170       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$170, DW_AT_name("B2_UNC_ERR")
    1323                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_B2_UNC_ERR")
    1324                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1325                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1326                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$171       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$171, DW_AT_name("ECCB2_MAL_ERR")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   26

    1330                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ECCB2_MAL_ERR")
    1331                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$172       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$172, DW_AT_name("COMB2_BUS_MAL_GOOD")
    1337                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_COMB2_BUS_MAL_GOOD")
    1338                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$173       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$173, DW_AT_name("ECC2_MAL_ERR")
    1344                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ECC2_MAL_ERR")
    1345                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1346                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$174       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$174, DW_AT_name("ECC3_MAL_ERR")
    1351                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ECC3_MAL_ERR")
    1352                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1353                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$175       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$175, DW_AT_name("COM2_MAL_GOOD")
    1358                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_COM2_MAL_GOOD")
    1359                      .dwattr $C$DW$175, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1360                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1361                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$176       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$176, DW_AT_name("COM3_MAL_GOOD")
    1365                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_COM3_MAL_GOOD")
    1366                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1367                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1368                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$177       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$177, DW_AT_name("FSM_DONE")
    1372                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_FSM_DONE")
    1373                      .dwattr $C$DW$177, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1374                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1375                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$178       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$178, DW_AT_name("RVF_INT")
    1379                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RVF_INT")
    1380                      .dwattr $C$DW$178, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1382                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$179       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   27

    1385                      .dwattr $C$DW$179, DW_AT_name("_FEDACSTATUS_Reserved_31_26")
    1386                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("__FEDACSTATUS_Reserved_31_26")
    1387                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1388                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1389                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1390                      .dwendtag $C$DW$T$26
    1391              
    1392              
    1393              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1394                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1395              $C$DW$180       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$180, DW_AT_name("SectorID0")
    1398                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_SectorID0")
    1399                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1400                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$181       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$181, DW_AT_name("_FEDACSDIS_Reserved_04")
    1405                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("__FEDACSDIS_Reserved_04")
    1406                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1407                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$182       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$182, DW_AT_name("BankID0")
    1412                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_BankID0")
    1413                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x03)
    1414                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$183       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$183, DW_AT_name("SectorID0_inverse")
    1419                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SectorID0_inverse")
    1420                      .dwattr $C$DW$183, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1421                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1423              $C$DW$184       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$184, DW_AT_name("_FEDACSDIS_Reserved_12")
    1426                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("__FEDACSDIS_Reserved_12")
    1427                      .dwattr $C$DW$184, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$185       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$185, DW_AT_name("BankID0_inverse")
    1433                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_BankID0_inverse")
    1434                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    1435                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1437              $C$DW$186       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$186, DW_AT_name("SectorID1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   28

    1440                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_SectorID1")
    1441                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1442                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1443                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$187       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$187, DW_AT_name("_FEDACSDIS_Reserved_20")
    1447                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("__FEDACSDIS_Reserved_20")
    1448                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1450                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$188       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$188, DW_AT_name("BankID1")
    1454                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_BankID1")
    1455                      .dwattr $C$DW$188, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x03)
    1456                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1457                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$189       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$189, DW_AT_name("SectorID1_inverse")
    1461                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SectorID1_inverse")
    1462                      .dwattr $C$DW$189, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1463                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1464                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$190       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$190, DW_AT_name("_FEDACSDIS_Reserved_28")
    1468                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("__FEDACSDIS_Reserved_28")
    1469                      .dwattr $C$DW$190, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1470                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1471                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$191       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1474                      .dwattr $C$DW$191, DW_AT_name("BankID1_inverse")
    1475                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_BankID1_inverse")
    1476                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
    1477                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1478                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1479                      .dwendtag $C$DW$T$27
    1480              
    1481              
    1482              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1483                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1484              $C$DW$192       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$192, DW_AT_name("PRIM_ADD_TAG_0_15")
    1487                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PRIM_ADD_TAG_0_15")
    1488                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1489                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$193       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$193, DW_AT_name("PRIM_ADD_TAG_16_22")
    1494                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PRIM_ADD_TAG_16_22")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   29

    1495                      .dwattr $C$DW$193, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    1496                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1497                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$194       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$194, DW_AT_name("_FPRIM_ADD_TAG_Reserved_31_23")
    1501                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("__FPRIM_ADD_TAG_Reserved_31_23")
    1502                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    1503                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1504                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwendtag $C$DW$T$28
    1506              
    1507              
    1508              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1509                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1510              $C$DW$195       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$195, DW_AT_name("REDU_ADD_TAG_0_15")
    1513                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_REDU_ADD_TAG_0_15")
    1514                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1515                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$196       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$196, DW_AT_name("REDU_ADD_TAG_16_22")
    1520                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_REDU_ADD_TAG_16_22")
    1521                      .dwattr $C$DW$196, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    1522                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1523                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$197       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$197, DW_AT_name("_FREDU_ADD_TAG_Reserved_31_23")
    1527                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("__FREDU_ADD_TAG_Reserved_31_23")
    1528                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    1529                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1530                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1531                      .dwendtag $C$DW$T$29
    1532              
    1533              
    1534              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1535                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1536              $C$DW$198       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$198, DW_AT_name("PROTL1DIS")
    1539                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PROTL1DIS")
    1540                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1541                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$199       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$199, DW_AT_name("_FBPROT_Reserved_15_02")
    1546                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("__FBPROT_Reserved_15_02")
    1547                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1548                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   30

    1550              $C$DW$200       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$200, DW_AT_name("_FBPROT_Reserved_31_16")
    1553                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("__FBPROT_Reserved_31_16")
    1554                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1555                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1556                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1557                      .dwendtag $C$DW$T$30
    1558              
    1559              
    1560              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1561                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1562              $C$DW$201       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$201, DW_AT_name("BSE")
    1565                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_BSE")
    1566                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1567                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$202       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$202, DW_AT_name("_FBSE_Reserved_31_16")
    1572                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("__FBSE_Reserved_31_16")
    1573                      .dwattr $C$DW$202, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1574                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1575                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1576                      .dwendtag $C$DW$T$31
    1577              
    1578              
    1579              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1580                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1581              $C$DW$203       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    1583                      .dwattr $C$DW$203, DW_AT_name("BUSY")
    1584                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_BUSY")
    1585                      .dwattr $C$DW$203, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1586                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$204       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1590                      .dwattr $C$DW$204, DW_AT_name("_FBBUSY_Reserved_15_08")
    1591                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("__FBBUSY_Reserved_15_08")
    1592                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1593                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$205       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1597                      .dwattr $C$DW$205, DW_AT_name("_FBBUSY_Reserved_31_06")
    1598                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("__FBBUSY_Reserved_31_06")
    1599                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1600                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1601                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1602                      .dwendtag $C$DW$T$32
    1603              
    1604              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   31

    1605              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1606                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1607              $C$DW$206       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    1609                      .dwattr $C$DW$206, DW_AT_name("VREADS")
    1610                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_VREADS")
    1611                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1612                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1614              $C$DW$207       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$207, DW_AT_name("BAGP")
    1617                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_BAGP")
    1618                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1619                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1620                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$208       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    1623                      .dwattr $C$DW$208, DW_AT_name("OTPPROTDIS")
    1624                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_OTPPROTDIS")
    1625                      .dwattr $C$DW$208, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1626                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1627                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$209       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    1630                      .dwattr $C$DW$209, DW_AT_name("_FBAC_Reserved_31_24")
    1631                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("__FBAC_Reserved_31_24")
    1632                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1633                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1634                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1635                      .dwendtag $C$DW$T$33
    1636              
    1637              
    1638              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1639                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1640              $C$DW$210       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    1642                      .dwattr $C$DW$210, DW_AT_name("BANKPWR0")
    1643                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_BANKPWR0")
    1644                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1645                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1646                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1647              $C$DW$211       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    1649                      .dwattr $C$DW$211, DW_AT_name("BANKPWR1")
    1650                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_BANKPWR1")
    1651                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1652                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1653                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    1654              $C$DW$212       .dwtag  DW_TAG_member
    1655                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    1656                      .dwattr $C$DW$212, DW_AT_name("BANKPWR2")
    1657                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_BANKPWR2")
    1658                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1659                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   32

    1660                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    1661              $C$DW$213       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    1663                      .dwattr $C$DW$213, DW_AT_name("BANKPWR3")
    1664                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_BANKPWR3")
    1665                      .dwattr $C$DW$213, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1666                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    1668              $C$DW$214       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    1670                      .dwattr $C$DW$214, DW_AT_name("BANKPWR4")
    1671                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_BANKPWR4")
    1672                      .dwattr $C$DW$214, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1673                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1674                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$215       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    1677                      .dwattr $C$DW$215, DW_AT_name("BANKPWR5")
    1678                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_BANKPWR5")
    1679                      .dwattr $C$DW$215, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1680                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1682              $C$DW$216       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    1684                      .dwattr $C$DW$216, DW_AT_name("BANKPWR6")
    1685                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_BANKPWR6")
    1686                      .dwattr $C$DW$216, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1687                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$217       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$217, DW_AT_name("BANKPWR7")
    1692                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_BANKPWR7")
    1693                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1694                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$218       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$218, DW_AT_name("REG_PWRSAV")
    1699                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_REG_PWRSAV")
    1700                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1701                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1702                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1703              $C$DW$219       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$219, DW_AT_name("_FBAC_Reserved_23_20")
    1706                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("__FBAC_Reserved_23_20")
    1707                      .dwattr $C$DW$219, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1708                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1709                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$220       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$220, DW_AT_name("FSM_PWRSAV")
    1713                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_FSM_PWRSAV")
    1714                      .dwattr $C$DW$220, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   33

    1715                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1716                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$221       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$221, DW_AT_name("_FBAC_Reserved_31_28")
    1720                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("__FBAC_Reserved_31_28")
    1721                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1722                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1723                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    1724                      .dwendtag $C$DW$T$34
    1725              
    1726              
    1727              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1728                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1729              $C$DW$222       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    1731                      .dwattr $C$DW$222, DW_AT_name("BANKRDY")
    1732                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_BANKRDY")
    1733                      .dwattr $C$DW$222, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1734                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    1736              $C$DW$223       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$223, DW_AT_name("_FBPRDY_Reserved_14_08")
    1739                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("__FBPRDY_Reserved_14_08")
    1740                      .dwattr $C$DW$223, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1741                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$224       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$224, DW_AT_name("PUMPRDY")
    1746                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PUMPRDY")
    1747                      .dwattr $C$DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$225       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$225, DW_AT_name("BANKBUSY")
    1753                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_BANKBUSY")
    1754                      .dwattr $C$DW$225, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1755                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1756                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$226       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$226, DW_AT_name("_FBPRDY_Reserved_31_24")
    1760                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("__FBPRDY_Reserved_31_24")
    1761                      .dwattr $C$DW$226, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1762                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1763                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1764                      .dwendtag $C$DW$T$35
    1765              
    1766              
    1767              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1768                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1769              $C$DW$227       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   34

    1770                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$227, DW_AT_name("PUMPPWR")
    1772                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_PUMPPWR")
    1773                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1774                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1776              $C$DW$228       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    1778                      .dwattr $C$DW$228, DW_AT_name("_FBAC1_Reserved_15_01")
    1779                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("__FBAC1_Reserved_15_01")
    1780                      .dwattr $C$DW$228, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1781                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$229       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$229, DW_AT_name("PSLEEPTDIS")
    1786                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PSLEEPTDIS")
    1787                      .dwattr $C$DW$229, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x0b)
    1788                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1789                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1790              $C$DW$230       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    1792                      .dwattr $C$DW$230, DW_AT_name("_FBAC1_Reserved_31_27")
    1793                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("__FBAC1_Reserved_31_27")
    1794                      .dwattr $C$DW$230, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    1795                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1796                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1797                      .dwendtag $C$DW$T$36
    1798              
    1799              
    1800              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1801                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1802              $C$DW$231       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$231, DW_AT_name("PAGP")
    1805                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_PAGP")
    1806                      .dwattr $C$DW$231, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1807                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$232       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$232, DW_AT_name("_FBAC2_Reserved_31_16")
    1812                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("__FBAC2_Reserved_31_16")
    1813                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1814                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1815                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1816                      .dwendtag $C$DW$T$37
    1817              
    1818              
    1819              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1820                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1821              $C$DW$233       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$233, DW_AT_name("BANK")
    1824                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_BANK")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   35

    1825                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1826                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$234       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$234, DW_AT_name("_FMAC_Reserved_15_03")
    1831                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("__FMAC_Reserved_15_03")
    1832                      .dwattr $C$DW$234, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1833                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$235       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$235, DW_AT_name("_FMAC_Reserved_31_15")
    1838                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("__FMAC_Reserved_31_15")
    1839                      .dwattr $C$DW$235, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1840                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1841                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1842                      .dwendtag $C$DW$T$38
    1843              
    1844              
    1845              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1846                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1847              $C$DW$236       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$236, DW_AT_name("SLOCK")
    1850                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_SLOCK")
    1851                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1854              $C$DW$237       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    1856                      .dwattr $C$DW$237, DW_AT_name("PSUSP")
    1857                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_PSUSP")
    1858                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1859                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$238       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    1863                      .dwattr $C$DW$238, DW_AT_name("ESUSP")
    1864                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_ESUSP")
    1865                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1866                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1868              $C$DW$239       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$239, DW_AT_name("VOLSTAT")
    1871                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_VOLSTAT")
    1872                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1873                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$240       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    1877                      .dwattr $C$DW$240, DW_AT_name("CSTAT")
    1878                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_CSTAT")
    1879                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   36

    1880                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1881                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1882              $C$DW$241       .dwtag  DW_TAG_member
    1883                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    1884                      .dwattr $C$DW$241, DW_AT_name("INVDAT")
    1885                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_INVDAT")
    1886                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1887                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1888                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1889              $C$DW$242       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    1891                      .dwattr $C$DW$242, DW_AT_name("PGM")
    1892                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PGM")
    1893                      .dwattr $C$DW$242, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1894                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1895                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1896              $C$DW$243       .dwtag  DW_TAG_member
    1897                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    1898                      .dwattr $C$DW$243, DW_AT_name("ERS")
    1899                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_ERS")
    1900                      .dwattr $C$DW$243, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1901                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$244       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$244, DW_AT_name("Busy")
    1906                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_Busy")
    1907                      .dwattr $C$DW$244, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1908                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1909                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$245       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$245, DW_AT_name("CV")
    1913                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_CV")
    1914                      .dwattr $C$DW$245, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1915                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$246       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    1919                      .dwattr $C$DW$246, DW_AT_name("EV")
    1920                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_EV")
    1921                      .dwattr $C$DW$246, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1922                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1924              $C$DW$247       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    1926                      .dwattr $C$DW$247, DW_AT_name("PCV")
    1927                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_PCV")
    1928                      .dwattr $C$DW$247, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1929                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1931              $C$DW$248       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$248, DW_AT_name("PGV")
    1934                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_PGV")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   37

    1935                      .dwattr $C$DW$248, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1936                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$249       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$249, DW_AT_name("DBF")
    1941                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_DBF")
    1942                      .dwattr $C$DW$249, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1943                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$250       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    1947                      .dwattr $C$DW$250, DW_AT_name("ILA")
    1948                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ILA")
    1949                      .dwattr $C$DW$250, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1950                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1951                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    1952              $C$DW$251       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    1954                      .dwattr $C$DW$251, DW_AT_name("RVF")
    1955                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_RVF")
    1956                      .dwattr $C$DW$251, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1957                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    1959              $C$DW$252       .dwtag  DW_TAG_member
    1960                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    1961                      .dwattr $C$DW$252, DW_AT_name("RDVER")
    1962                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_RDVER")
    1963                      .dwattr $C$DW$252, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1964                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1965                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    1966              $C$DW$253       .dwtag  DW_TAG_member
    1967                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    1968                      .dwattr $C$DW$253, DW_AT_name("RVSUSP")
    1969                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_RVSUSP")
    1970                      .dwattr $C$DW$253, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1971                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1972                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    1973              $C$DW$254       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    1975                      .dwattr $C$DW$254, DW_AT_name("_FMSTAT_Reserved_31_18")
    1976                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("__FMSTAT_Reserved_31_18")
    1977                      .dwattr $C$DW$254, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1978                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1979                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    1980                      .dwendtag $C$DW$T$39
    1981              
    1982              
    1983              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1984                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1985              $C$DW$255       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$255, DW_AT_name("EMU_ECC")
    1988                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_EMU_ECC")
    1989                      .dwattr $C$DW$255, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
flash.asm                                                            PAGE   38

    1990                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$256       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$256, DW_AT_name("_FEMU_ECC_Reserved_15_08")
    1995                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("__FEMU_ECC_Reserved_15_08")
    1996                      .dwattr $C$DW$256, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1997                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$257       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$257, DW_AT_name("_FEMU_ECC_Reserved_31_16")
    2002                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("__FEMU_ECC_Reserved_31_16")
    2003                      .dwattr $C$DW$257, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2004                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2005                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2006                      .dwendtag $C$DW$T$40
    2007              
    2008              
    2009              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2010                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2011              $C$DW$258       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2013                      .dwattr $C$DW$258, DW_AT_name("ENCOM")
    2014                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_ENCOM")
    2015                      .dwattr $C$DW$258, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2016                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$259       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2020                      .dwattr $C$DW$259, DW_AT_name("_FLOCK_Reserved_31_16")
    2021                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("__FLOCK_Reserved_31_16")
    2022                      .dwattr $C$DW$259, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2023                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2024                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2025                      .dwendtag $C$DW$T$41
    2026              
    2027              
    2028              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2029                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2030              $C$DW$260       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$260, DW_AT_name("EMU_ADDR_15_0")
    2033                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_EMU_ADDR_15_0")
    2034                      .dwattr $C$DW$260, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2035                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2036                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$261       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2039                      .dwattr $C$DW$261, DW_AT_name("EMU_ADDR_21_16")
    2040                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_EMU_ADDR_21_16")
    2041                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2042                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
