TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:37:54 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/fsm_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("send_state_change_command")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_send_state_change_command")

    2037              ;* TYPE INFORMATION                                            *
    2038              ;***************************************************************
    2039              
    2040              $C$DW$T$280     .dwtag  DW_TAG_enumeration_type
    2041                      .dwattr $C$DW$T$280, DW_AT_byte_size(0x01)
    2042              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("COMBINED"), DW_AT_const_value(0x00)
    2043              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("ARTICULATED_STEERING"), DW_AT_const_value(0x01)
    2044              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("TURNTABLE_STEERING"), DW_AT_const_value(0x02)
    2045              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_LEFT"), DW_AT_const_value(0x03)
    2046              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_RIGHT"), DW_AT_const_value(0x04)
    2047              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_LEFT"), DW_AT_const_value(0x05)
    2048              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_MIDDLE"), DW_AT_const_value(0x06)
    2049              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("INCREMENT_SERVO"), DW_AT_const_value(0x07)
    2050              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("DECREMENT_SERVO"), DW_AT_const_value(0x08)
    2051              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_0"), DW_AT_const_value(0x09)
    2052              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_1"), DW_AT_const_value(0x0a)
    2053              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_2"), DW_AT_const_value(0x0b)
    2054              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_3"), DW_AT_const_value(0x0c)
    2055              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_4"), DW_AT_const_value(0x0d)
    2056              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_5"), DW_AT_const_value(0x0e)
    2057              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_6"), DW_AT_const_value(0x0f)
    2058              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_0"), DW_AT_const_value(0x10)
    2059              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_1"), DW_AT_const_value(0x11)
    2060              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_2"), DW_AT_const_value(0x12)
    2061                      .dwendtag $C$DW$T$280
    2062              
    2063              $C$DW$T$281     .dwtag  DW_TAG_typedef, DW_AT_name("config_mode_cmd_t")
    2064                      .dwattr $C$DW$T$281, DW_AT_type(*$C$DW$T$280)
    2065                      .dwattr $C$DW$T$281, DW_AT_language(DW_LANG_C)
    2066              $C$DW$T$282     .dwtag  DW_TAG_pointer_type
    2067                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$281)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   41

    2068                      .dwattr $C$DW$T$282, DW_AT_address_class(0x20)
    2069              
    2070              $C$DW$T$283     .dwtag  DW_TAG_enumeration_type
    2071                      .dwattr $C$DW$T$283, DW_AT_byte_size(0x01)
    2072              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("NO_CMD"), DW_AT_const_value(0x00)
    2073              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_CHANGE_CMD"), DW_AT_const_value(0x01)
    2074              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("CONFIG_MODE_CMD"), DW_AT_const_value(0x02)
    2075              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("DRIVE_CMD"), DW_AT_const_value(0x03)
    2076                      .dwendtag $C$DW$T$283
    2077              
    2078              $C$DW$T$284     .dwtag  DW_TAG_typedef, DW_AT_name("wyflyCommands_t")
    2079                      .dwattr $C$DW$T$284, DW_AT_type(*$C$DW$T$283)
    2080                      .dwattr $C$DW$T$284, DW_AT_language(DW_LANG_C)
    2081              
    2082              $C$DW$T$289     .dwtag  DW_TAG_enumeration_type
    2083                      .dwattr $C$DW$T$289, DW_AT_byte_size(0x01)
    2084              $C$DW$179       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_STOP"), DW_AT_const_value(0x00)
    2085              $C$DW$180       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_CONFIG"), DW_AT_const_value(0x01)
    2086              $C$DW$181       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_RUN"), DW_AT_const_value(0x02)
    2087              $C$DW$182       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_ERROR"), DW_AT_const_value(0x03)
    2088                      .dwendtag $C$DW$T$289
    2089              
    2090              $C$DW$T$290     .dwtag  DW_TAG_typedef, DW_AT_name("fsm_main_state_t")
    2091                      .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$289)
    2092                      .dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
    2093              $C$DW$T$291     .dwtag  DW_TAG_pointer_type
    2094                      .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    2095                      .dwattr $C$DW$T$291, DW_AT_address_class(0x20)
    2096              
    2097              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2098                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x18)
    2099              $C$DW$183       .dwtag  DW_TAG_member
    2100                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2101                      .dwattr $C$DW$183, DW_AT_name("speed_ref")
    2102                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_speed_ref")
    2103                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2104                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2105              $C$DW$184       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2107                      .dwattr $C$DW$184, DW_AT_name("angle_ref")
    2108                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_angle_ref")
    2109                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2110                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2111              $C$DW$185       .dwtag  DW_TAG_member
    2112                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$20)
    2113                      .dwattr $C$DW$185, DW_AT_name("steering_feedback")
    2114                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_steering_feedback")
    2115                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2116                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2117              $C$DW$186       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2119                      .dwattr $C$DW$186, DW_AT_name("speed_scaling_ms_to_mot")
    2120                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_speed_scaling_ms_to_mot")
    2121                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2122                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   42

    2123              $C$DW$187       .dwtag  DW_TAG_member
    2124                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2125                      .dwattr $C$DW$187, DW_AT_name("kp")
    2126                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_kp")
    2127                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2128                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$188       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$188, DW_AT_name("ki")
    2132                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ki")
    2133                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2134                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2135              $C$DW$189       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$189, DW_AT_name("dt")
    2138                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_dt")
    2139                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2140                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2141              $C$DW$190       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    2143                      .dwattr $C$DW$190, DW_AT_name("steering_loop_count")
    2144                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_steering_loop_count")
    2145                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2146                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2147              $C$DW$191       .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$191, DW_AT_name("motor_speed_1")
    2150                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_motor_speed_1")
    2151                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2152                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2153              $C$DW$192       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2155                      .dwattr $C$DW$192, DW_AT_name("motor_speed_2")
    2156                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_motor_speed_2")
    2157                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2158                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$193       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$193, DW_AT_name("scale_1")
    2162                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_scale_1")
    2163                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2164                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2165              $C$DW$194       .dwtag  DW_TAG_member
    2166                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2167                      .dwattr $C$DW$194, DW_AT_name("scale_2")
    2168                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_scale_2")
    2169                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2170                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2171                      .dwendtag $C$DW$T$21
    2172              
    2173              $C$DW$T$293     .dwtag  DW_TAG_typedef, DW_AT_name("steering_control_t")
    2174                      .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$21)
    2175                      .dwattr $C$DW$T$293, DW_AT_language(DW_LANG_C)
    2176              $C$DW$T$294     .dwtag  DW_TAG_pointer_type
    2177                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$293)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   43

    2178                      .dwattr $C$DW$T$294, DW_AT_address_class(0x20)
    2179              
    2180              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2181                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    2182              $C$DW$195       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2184                      .dwattr $C$DW$195, DW_AT_name("As")
    2185                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_As")
    2186                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$196       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2190                      .dwattr $C$DW$196, DW_AT_name("Bs")
    2191                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_Bs")
    2192                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2193                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$197       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2196                      .dwattr $C$DW$197, DW_AT_name("Cs")
    2197                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Cs")
    2198                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2199                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$198       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2202                      .dwattr $C$DW$198, DW_AT_name("Alpha")
    2203                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Alpha")
    2204                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2205                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$199       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    2208                      .dwattr $C$DW$199, DW_AT_name("Beta")
    2209                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Beta")
    2210                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2211                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2212                      .dwendtag $C$DW$T$23
    2213              
    2214              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
    2215                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$23)
    2216                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2217              
    2218              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2219                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    2220              $C$DW$200       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2222                      .dwattr $C$DW$200, DW_AT_name("Alpha")
    2223                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Alpha")
    2224                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2226              $C$DW$201       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2228                      .dwattr $C$DW$201, DW_AT_name("Beta")
    2229                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Beta")
    2230                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2231                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2232              $C$DW$202       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   44

    2233                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    2234                      .dwattr $C$DW$202, DW_AT_name("Angle")
    2235                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Angle")
    2236                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2237                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2238              $C$DW$203       .dwtag  DW_TAG_member
    2239                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    2240                      .dwattr $C$DW$203, DW_AT_name("Ds")
    2241                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Ds")
    2242                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2243                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$204       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    2246                      .dwattr $C$DW$204, DW_AT_name("Qs")
    2247                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Qs")
    2248                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2249                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$205       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
    2252                      .dwattr $C$DW$205, DW_AT_name("Sine")
    2253                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Sine")
    2254                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2255                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$206       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    2258                      .dwattr $C$DW$206, DW_AT_name("Cosine")
    2259                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Cosine")
    2260                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2261                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2262                      .dwendtag $C$DW$T$24
    2263              
    2264              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
    2265                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$24)
    2266                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2267              
    2268              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2269                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    2270              $C$DW$207       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
    2272                      .dwattr $C$DW$207, DW_AT_name("Alpha")
    2273                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Alpha")
    2274                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2276              $C$DW$208       .dwtag  DW_TAG_member
    2277                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
    2278                      .dwattr $C$DW$208, DW_AT_name("Beta")
    2279                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Beta")
    2280                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2281                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2282              $C$DW$209       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
    2284                      .dwattr $C$DW$209, DW_AT_name("Angle")
    2285                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Angle")
    2286                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2287                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   45

    2288              $C$DW$210       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    2290                      .dwattr $C$DW$210, DW_AT_name("Ds")
    2291                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Ds")
    2292                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2293                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2294              $C$DW$211       .dwtag  DW_TAG_member
    2295                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    2296                      .dwattr $C$DW$211, DW_AT_name("Qs")
    2297                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Qs")
    2298                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2299                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2300              $C$DW$212       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    2302                      .dwattr $C$DW$212, DW_AT_name("Sine")
    2303                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Sine")
    2304                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2305                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2306              $C$DW$213       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    2308                      .dwattr $C$DW$213, DW_AT_name("Cosine")
    2309                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Cosine")
    2310                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2311                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2312                      .dwendtag $C$DW$T$25
    2313              
    2314              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
    2315                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$25)
    2316                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2317              
    2318              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2319                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x18)
    2320              $C$DW$214       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    2322                      .dwattr $C$DW$214, DW_AT_name("Ref")
    2323                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_Ref")
    2324                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2326              $C$DW$215       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    2328                      .dwattr $C$DW$215, DW_AT_name("Fbk")
    2329                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_Fbk")
    2330                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2331                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2332              $C$DW$216       .dwtag  DW_TAG_member
    2333                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    2334                      .dwattr $C$DW$216, DW_AT_name("Out")
    2335                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_Out")
    2336                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2337                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2338              $C$DW$217       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    2340                      .dwattr $C$DW$217, DW_AT_name("Kp")
    2341                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_Kp")
    2342                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   46

    2343                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2344              $C$DW$218       .dwtag  DW_TAG_member
    2345                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    2346                      .dwattr $C$DW$218, DW_AT_name("Ki")
    2347                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_Ki")
    2348                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2349                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2350              $C$DW$219       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2352                      .dwattr $C$DW$219, DW_AT_name("Umax")
    2353                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_Umax")
    2354                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2355                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2356              $C$DW$220       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    2358                      .dwattr $C$DW$220, DW_AT_name("Umin")
    2359                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_Umin")
    2360                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2361                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2362              $C$DW$221       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    2364                      .dwattr $C$DW$221, DW_AT_name("up")
    2365                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_up")
    2366                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2367                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2368              $C$DW$222       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    2370                      .dwattr $C$DW$222, DW_AT_name("ui")
    2371                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_ui")
    2372                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2373                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2374              $C$DW$223       .dwtag  DW_TAG_member
    2375                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
    2376                      .dwattr $C$DW$223, DW_AT_name("v1")
    2377                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_v1")
    2378                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2379                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2380              $C$DW$224       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    2382                      .dwattr $C$DW$224, DW_AT_name("i1")
    2383                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_i1")
    2384                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2385                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2386              $C$DW$225       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
    2388                      .dwattr $C$DW$225, DW_AT_name("w1")
    2389                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_w1")
    2390                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2391                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2392                      .dwendtag $C$DW$T$26
    2393              
    2394              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    2395                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    2396                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2397              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   47

    2398              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2399                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2400              $C$DW$226       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    2402                      .dwattr $C$DW$226, DW_AT_name("Ref")
    2403                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_Ref")
    2404                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2406              $C$DW$227       .dwtag  DW_TAG_member
    2407                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    2408                      .dwattr $C$DW$227, DW_AT_name("Fbk")
    2409                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_Fbk")
    2410                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2411                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$228       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$22)
    2414                      .dwattr $C$DW$228, DW_AT_name("Out")
    2415                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_Out")
    2416                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2417                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$229       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$22)
    2420                      .dwattr $C$DW$229, DW_AT_name("c1")
    2421                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_c1")
    2422                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2423                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$230       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$22)
    2426                      .dwattr $C$DW$230, DW_AT_name("c2")
    2427                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_c2")
    2428                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2429                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2430                      .dwendtag $C$DW$T$27
    2431              
    2432              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
    2433                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    2434                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2435              
    2436              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2437                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    2438              $C$DW$231       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
    2440                      .dwattr $C$DW$231, DW_AT_name("Kr")
    2441                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_Kr")
    2442                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2443                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2444              $C$DW$232       .dwtag  DW_TAG_member
    2445                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$22)
    2446                      .dwattr $C$DW$232, DW_AT_name("Kp")
    2447                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_Kp")
    2448                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2449                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2450              $C$DW$233       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$22)
    2452                      .dwattr $C$DW$233, DW_AT_name("Ki")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   48

    2453                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_Ki")
    2454                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2455                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$234       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
    2458                      .dwattr $C$DW$234, DW_AT_name("Kd")
    2459                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_Kd")
    2460                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2461                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2462              $C$DW$235       .dwtag  DW_TAG_member
    2463                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$22)
    2464                      .dwattr $C$DW$235, DW_AT_name("Km")
    2465                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_Km")
    2466                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2467                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$236       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$22)
    2470                      .dwattr $C$DW$236, DW_AT_name("Umax")
    2471                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_Umax")
    2472                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2473                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2474              $C$DW$237       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
    2476                      .dwattr $C$DW$237, DW_AT_name("Umin")
    2477                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_Umin")
    2478                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2479                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2480                      .dwendtag $C$DW$T$28
    2481              
    2482              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
    2483                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    2484                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2485              
    2486              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2487                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    2488              $C$DW$238       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$22)
    2490                      .dwattr $C$DW$238, DW_AT_name("up")
    2491                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_up")
    2492                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2493                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2494              $C$DW$239       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$22)
    2496                      .dwattr $C$DW$239, DW_AT_name("ui")
    2497                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_ui")
    2498                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2499                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2500              $C$DW$240       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2502                      .dwattr $C$DW$240, DW_AT_name("ud")
    2503                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_ud")
    2504                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2505                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$241       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   49

    2508                      .dwattr $C$DW$241, DW_AT_name("v1")
    2509                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_v1")
    2510                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2511                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$242       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$22)
    2514                      .dwattr $C$DW$242, DW_AT_name("i1")
    2515                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_i1")
    2516                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2517                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$243       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$22)
    2520                      .dwattr $C$DW$243, DW_AT_name("d1")
    2521                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_d1")
    2522                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2523                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$244       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$22)
    2526                      .dwattr $C$DW$244, DW_AT_name("d2")
    2527                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_d2")
    2528                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2529                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$245       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$22)
    2532                      .dwattr $C$DW$245, DW_AT_name("w1")
    2533                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_w1")
    2534                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2535                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2536                      .dwendtag $C$DW$T$29
    2537              
    2538              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
    2539                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$29)
    2540                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2541              
    2542              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2543                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x28)
    2544              $C$DW$246       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$30)
    2546                      .dwattr $C$DW$246, DW_AT_name("term")
    2547                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_term")
    2548                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2549                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2550              $C$DW$247       .dwtag  DW_TAG_member
    2551                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$31)
    2552                      .dwattr $C$DW$247, DW_AT_name("param")
    2553                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_param")
    2554                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2555                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2556              $C$DW$248       .dwtag  DW_TAG_member
    2557                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$32)
    2558                      .dwattr $C$DW$248, DW_AT_name("data")
    2559                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_data")
    2560                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2561                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2562                      .dwendtag $C$DW$T$33
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   50

    2563              
    2564              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
    2565                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$33)
    2566                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2567              
    2568              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2569                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    2570              $C$DW$249       .dwtag  DW_TAG_member
    2571                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    2572                      .dwattr $C$DW$249, DW_AT_name("Ualpha")
    2573                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_Ualpha")
    2574                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2576              $C$DW$250       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    2578                      .dwattr $C$DW$250, DW_AT_name("Ubeta")
    2579                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_Ubeta")
    2580                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2581                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2582              $C$DW$251       .dwtag  DW_TAG_member
    2583                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    2584                      .dwattr $C$DW$251, DW_AT_name("Ta")
    2585                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_Ta")
    2586                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2587                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2588              $C$DW$252       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    2590                      .dwattr $C$DW$252, DW_AT_name("Tb")
    2591                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_Tb")
    2592                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2593                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2594              $C$DW$253       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    2596                      .dwattr $C$DW$253, DW_AT_name("Tc")
    2597                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_Tc")
    2598                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2599                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2600              $C$DW$254       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
    2602                      .dwattr $C$DW$254, DW_AT_name("tmp1")
    2603                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_tmp1")
    2604                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2605                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2606              $C$DW$255       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    2608                      .dwattr $C$DW$255, DW_AT_name("tmp2")
    2609                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_tmp2")
    2610                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2611                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2612              $C$DW$256       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$22)
    2614                      .dwattr $C$DW$256, DW_AT_name("tmp3")
    2615                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_tmp3")
    2616                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2617                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   51

    2618              $C$DW$257       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$34)
    2620                      .dwattr $C$DW$257, DW_AT_name("VecSector")
    2621                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_VecSector")
    2622                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2623                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2624                      .dwendtag $C$DW$T$35
    2625              
    2626              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    2627                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$35)
    2628                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2629              
    2630              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2631                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2632              $C$DW$258       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$22)
    2634                      .dwattr $C$DW$258, DW_AT_name("TargetValue")
    2635                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_TargetValue")
    2636                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$259       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2640                      .dwattr $C$DW$259, DW_AT_name("RampDelayMax")
    2641                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_RampDelayMax")
    2642                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2643                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2644              $C$DW$260       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$22)
    2646                      .dwattr $C$DW$260, DW_AT_name("RampLowLimit")
    2647                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_RampLowLimit")
    2648                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2649                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$261       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$22)
    2652                      .dwattr $C$DW$261, DW_AT_name("RampHighLimit")
    2653                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_RampHighLimit")
    2654                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2655                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$262       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$20)
    2658                      .dwattr $C$DW$262, DW_AT_name("RampDelayCount")
    2659                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_RampDelayCount")
    2660                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2661                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$263       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$22)
    2664                      .dwattr $C$DW$263, DW_AT_name("SetpointValue")
    2665                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_SetpointValue")
    2666                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2667                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$264       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2670                      .dwattr $C$DW$264, DW_AT_name("EqualFlag")
    2671                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_EqualFlag")
    2672                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   52

    2673                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$265       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$22)
    2676                      .dwattr $C$DW$265, DW_AT_name("Tmp")
    2677                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_Tmp")
    2678                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2679                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2680                      .dwendtag $C$DW$T$36
    2681              
    2682              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    2683                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$36)
    2684                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2685              
    2686              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2687                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    2688              $C$DW$266       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$22)
    2690                      .dwattr $C$DW$266, DW_AT_name("Freq")
    2691                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_Freq")
    2692                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2693                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2694              $C$DW$267       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    2696                      .dwattr $C$DW$267, DW_AT_name("StepAngleMax")
    2697                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_StepAngleMax")
    2698                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2699                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2700              $C$DW$268       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$22)
    2702                      .dwattr $C$DW$268, DW_AT_name("Angle")
    2703                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_Angle")
    2704                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2705                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$269       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$22)
    2708                      .dwattr $C$DW$269, DW_AT_name("Gain")
    2709                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_Gain")
    2710                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2711                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$270       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$22)
    2714                      .dwattr $C$DW$270, DW_AT_name("Out")
    2715                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_Out")
    2716                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2717                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2718              $C$DW$271       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$22)
    2720                      .dwattr $C$DW$271, DW_AT_name("Offset")
    2721                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_Offset")
    2722                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2723                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2724                      .dwendtag $C$DW$T$37
    2725              
    2726              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    2727                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   53

    2728                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2729              
    2730              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2731                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    2732              $C$DW$272       .dwtag  DW_TAG_member
    2733                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$22)
    2734                      .dwattr $C$DW$272, DW_AT_name("DcBusVolt")
    2735                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_DcBusVolt")
    2736                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$273       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$22)
    2740                      .dwattr $C$DW$273, DW_AT_name("MfuncV1")
    2741                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_MfuncV1")
    2742                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2743                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$274       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$22)
    2746                      .dwattr $C$DW$274, DW_AT_name("MfuncV2")
    2747                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_MfuncV2")
    2748                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2749                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$275       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$22)
    2752                      .dwattr $C$DW$275, DW_AT_name("MfuncV3")
    2753                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_MfuncV3")
    2754                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2755                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$276       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$34)
    2758                      .dwattr $C$DW$276, DW_AT_name("OutOfPhase")
    2759                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_OutOfPhase")
    2760                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2761                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$277       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$22)
    2764                      .dwattr $C$DW$277, DW_AT_name("VphaseA")
    2765                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_VphaseA")
    2766                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2767                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$278       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$22)
    2770                      .dwattr $C$DW$278, DW_AT_name("VphaseB")
    2771                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_VphaseB")
    2772                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2773                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$279       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$22)
    2776                      .dwattr $C$DW$279, DW_AT_name("VphaseC")
    2777                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_VphaseC")
    2778                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2779                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$280       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$22)
    2782                      .dwattr $C$DW$280, DW_AT_name("Valpha")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   54

    2783                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_Valpha")
    2784                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2785                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$281       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
    2788                      .dwattr $C$DW$281, DW_AT_name("Vbeta")
    2789                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_Vbeta")
    2790                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2791                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$282       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    2794                      .dwattr $C$DW$282, DW_AT_name("temp")
    2795                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_temp")
    2796                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2797                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2798                      .dwendtag $C$DW$T$38
    2799              
    2800              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    2801                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$38)
    2802                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2803              
    2804              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2805                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    2806              $C$DW$283       .dwtag  DW_TAG_member
    2807                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$22)
    2808                      .dwattr $C$DW$283, DW_AT_name("ElecTheta")
    2809                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_ElecTheta")
    2810                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2811                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2812              $C$DW$284       .dwtag  DW_TAG_member
    2813                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2814                      .dwattr $C$DW$284, DW_AT_name("DirectionQep")
    2815                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_DirectionQep")
    2816                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2817                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2818              $C$DW$285       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$22)
    2820                      .dwattr $C$DW$285, DW_AT_name("OldElecTheta")
    2821                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_OldElecTheta")
    2822                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2823                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2824              $C$DW$286       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$22)
    2826                      .dwattr $C$DW$286, DW_AT_name("Speed")
    2827                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_Speed")
    2828                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2829                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2830              $C$DW$287       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$20)
    2832                      .dwattr $C$DW$287, DW_AT_name("BaseRpm")
    2833                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_BaseRpm")
    2834                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2835                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2836              $C$DW$288       .dwtag  DW_TAG_member
    2837                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   55

    2838                      .dwattr $C$DW$288, DW_AT_name("K1")
    2839                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_K1")
    2840                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2841                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2842              $C$DW$289       .dwtag  DW_TAG_member
    2843                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$22)
    2844                      .dwattr $C$DW$289, DW_AT_name("K2")
    2845                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_K2")
    2846                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2847                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2848              $C$DW$290       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$22)
    2850                      .dwattr $C$DW$290, DW_AT_name("K3")
    2851                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_K3")
    2852                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2853                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2854              $C$DW$291       .dwtag  DW_TAG_member
    2855                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$40)
    2856                      .dwattr $C$DW$291, DW_AT_name("SpeedRpm")
    2857                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_SpeedRpm")
    2858                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2859                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2860              $C$DW$292       .dwtag  DW_TAG_member
    2861                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$22)
    2862                      .dwattr $C$DW$292, DW_AT_name("Tmp")
    2863                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_Tmp")
    2864                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2865                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2866                      .dwendtag $C$DW$T$41
    2867              
    2868              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    2869                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    2870                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2871              
    2872              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2873                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    2874              $C$DW$293       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    2876                      .dwattr $C$DW$293, DW_AT_name("ElecTheta")
    2877                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_ElecTheta")
    2878                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2879                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2880              $C$DW$294       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    2882                      .dwattr $C$DW$294, DW_AT_name("MechTheta")
    2883                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_MechTheta")
    2884                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2885                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2886              $C$DW$295       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$34)
    2888                      .dwattr $C$DW$295, DW_AT_name("DirectionQep")
    2889                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_DirectionQep")
    2890                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2891                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2892              $C$DW$296       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   56

    2893                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$34)
    2894                      .dwattr $C$DW$296, DW_AT_name("QepPeriod")
    2895                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_QepPeriod")
    2896                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2897                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2898              $C$DW$297       .dwtag  DW_TAG_member
    2899                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$20)
    2900                      .dwattr $C$DW$297, DW_AT_name("QepCountIndex")
    2901                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_QepCountIndex")
    2902                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2903                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2904              $C$DW$298       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$40)
    2906                      .dwattr $C$DW$298, DW_AT_name("RawTheta")
    2907                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_RawTheta")
    2908                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2909                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2910              $C$DW$299       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    2912                      .dwattr $C$DW$299, DW_AT_name("MechScaler")
    2913                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_MechScaler")
    2914                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2915                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2916              $C$DW$300       .dwtag  DW_TAG_member
    2917                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$34)
    2918                      .dwattr $C$DW$300, DW_AT_name("LineEncoder")
    2919                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_LineEncoder")
    2920                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2921                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2922              $C$DW$301       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$34)
    2924                      .dwattr $C$DW$301, DW_AT_name("PolePairs")
    2925                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_PolePairs")
    2926                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2927                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2928              $C$DW$302       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$40)
    2930                      .dwattr $C$DW$302, DW_AT_name("CalibratedAngle")
    2931                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_CalibratedAngle")
    2932                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2933                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2934              $C$DW$303       .dwtag  DW_TAG_member
    2935                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$34)
    2936                      .dwattr $C$DW$303, DW_AT_name("IndexSyncFlag")
    2937                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_IndexSyncFlag")
    2938                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2939                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2940                      .dwendtag $C$DW$T$42
    2941              
    2942              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    2943                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$42)
    2944                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2945              
    2946              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2947                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x07)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   57

    2948              $C$DW$304       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$43)
    2950                      .dwattr $C$DW$304, DW_AT_name("stat_reg1")
    2951                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_stat_reg1")
    2952                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2954              $C$DW$305       .dwtag  DW_TAG_member
    2955                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$44)
    2956                      .dwattr $C$DW$305, DW_AT_name("stat_reg2")
    2957                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_stat_reg2")
    2958                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2959                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2960              $C$DW$306       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$45)
    2962                      .dwattr $C$DW$306, DW_AT_name("cntrl_reg1")
    2963                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_cntrl_reg1")
    2964                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2965                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$307       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$46)
    2968                      .dwattr $C$DW$307, DW_AT_name("cntrl_reg2")
    2969                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_cntrl_reg2")
    2970                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2971                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2972              $C$DW$308       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$34)
    2974                      .dwattr $C$DW$308, DW_AT_name("readCntrl1")
    2975                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_readCntrl1")
    2976                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2977                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2978              $C$DW$309       .dwtag  DW_TAG_member
    2979                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$34)
    2980                      .dwattr $C$DW$309, DW_AT_name("readCntrl2")
    2981                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_readCntrl2")
    2982                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2983                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2984              $C$DW$310       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$34)
    2986                      .dwattr $C$DW$310, DW_AT_name("DRV_fault")
    2987                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_DRV_fault")
    2988                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2989                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    2990                      .dwendtag $C$DW$T$47
    2991              
    2992              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    2993                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$47)
    2994                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2995              
    2996              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2997                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x15)
    2998              $C$DW$311       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$34)
    3000                      .dwattr $C$DW$311, DW_AT_name("Rsvd0")
    3001                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_Rsvd0")
    3002                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   58

    3003                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3004              $C$DW$312       .dwtag  DW_TAG_member
    3005                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$48)
    3006                      .dwattr $C$DW$312, DW_AT_name("status1_wwd")
    3007                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_status1_wwd")
    3008                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3009                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3010              $C$DW$313       .dwtag  DW_TAG_member
    3011                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$49)
    3012                      .dwattr $C$DW$313, DW_AT_name("status2_ov_vds")
    3013                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_status2_ov_vds")
    3014                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3015                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3016              $C$DW$314       .dwtag  DW_TAG_member
    3017                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$50)
    3018                      .dwattr $C$DW$314, DW_AT_name("status3_IC")
    3019                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_status3_IC")
    3020                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3021                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$315       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$51)
    3024                      .dwattr $C$DW$315, DW_AT_name("status4_gd_Vgs")
    3025                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    3026                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3027                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$316       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$52)
    3030                      .dwattr $C$DW$316, DW_AT_name("cntrl5_hs_gd")
    3031                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    3032                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3033                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3034              $C$DW$317       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$53)
    3036                      .dwattr $C$DW$317, DW_AT_name("cntrl6_ls_gd")
    3037                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    3038                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3039                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$318       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$54)
    3042                      .dwattr $C$DW$318, DW_AT_name("cntrl7_gd")
    3043                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_cntrl7_gd")
    3044                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3045                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3046              $C$DW$319       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$34)
    3048                      .dwattr $C$DW$319, DW_AT_name("Rsvd8")
    3049                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_Rsvd8")
    3050                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3051                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3052              $C$DW$320       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$55)
    3054                      .dwattr $C$DW$320, DW_AT_name("cntrl9_IC_ops")
    3055                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    3056                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3057                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   59

    3058              $C$DW$321       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$56)
    3060                      .dwattr $C$DW$321, DW_AT_name("cntrlA_shunt_amp")
    3061                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    3062                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3063                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$322       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$57)
    3066                      .dwattr $C$DW$322, DW_AT_name("cntrlB_Vreg")
    3067                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    3068                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3069                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3070              $C$DW$323       .dwtag  DW_TAG_member
    3071                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$58)
    3072                      .dwattr $C$DW$323, DW_AT_name("cntrlC_Vds_SNS")
    3073                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    3074                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3075                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3076              $C$DW$324       .dwtag  DW_TAG_member
    3077                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$34)
    3078                      .dwattr $C$DW$324, DW_AT_name("readCntrl5")
    3079                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_readCntrl5")
    3080                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3081                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$325       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$34)
    3084                      .dwattr $C$DW$325, DW_AT_name("readCntrl6")
    3085                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_readCntrl6")
    3086                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3087                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3088              $C$DW$326       .dwtag  DW_TAG_member
    3089                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$34)
    3090                      .dwattr $C$DW$326, DW_AT_name("readCntrl7")
    3091                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_readCntrl7")
    3092                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3093                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3094              $C$DW$327       .dwtag  DW_TAG_member
    3095                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$34)
    3096                      .dwattr $C$DW$327, DW_AT_name("readCntrl9")
    3097                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_readCntrl9")
    3098                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3099                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3100              $C$DW$328       .dwtag  DW_TAG_member
    3101                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$34)
    3102                      .dwattr $C$DW$328, DW_AT_name("readCntrlA")
    3103                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_readCntrlA")
    3104                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3105                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$329       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$34)
    3108                      .dwattr $C$DW$329, DW_AT_name("readCntrlB")
    3109                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_readCntrlB")
    3110                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3111                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3112              $C$DW$330       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   60

    3113                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$34)
    3114                      .dwattr $C$DW$330, DW_AT_name("readCntrlC")
    3115                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_readCntrlC")
    3116                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3117                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3118              $C$DW$331       .dwtag  DW_TAG_member
    3119                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$34)
    3120                      .dwattr $C$DW$331, DW_AT_name("DRV_fault")
    3121                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_DRV_fault")
    3122                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3123                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3124                      .dwendtag $C$DW$T$59
    3125              
    3126              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    3127                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$59)
    3128                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3129              
    3130              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    3131                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x150)
    3132              $C$DW$332       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$61)
    3134                      .dwattr $C$DW$332, DW_AT_name("PwmARegs")
    3135                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_PwmARegs")
    3136                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3137                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$333       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$61)
    3140                      .dwattr $C$DW$333, DW_AT_name("PwmBRegs")
    3141                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_PwmBRegs")
    3142                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3143                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$334       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$61)
    3146                      .dwattr $C$DW$334, DW_AT_name("PwmCRegs")
    3147                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_PwmCRegs")
    3148                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3149                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3150              $C$DW$335       .dwtag  DW_TAG_member
    3151                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$63)
    3152                      .dwattr $C$DW$335, DW_AT_name("QepRegs")
    3153                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_QepRegs")
    3154                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3155                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3156              $C$DW$336       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$65)
    3158                      .dwattr $C$DW$336, DW_AT_name("SpiRegs")
    3159                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_SpiRegs")
    3160                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3161                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3162              $C$DW$337       .dwtag  DW_TAG_member
    3163                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$34)
    3164                      .dwattr $C$DW$337, DW_AT_name("drvScsPin")
    3165                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_drvScsPin")
    3166                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3167                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   61

    3168              $C$DW$338       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$22)
    3170                      .dwattr $C$DW$338, DW_AT_name("offset_shntA")
    3171                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_offset_shntA")
    3172                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3173                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$339       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$22)
    3176                      .dwattr $C$DW$339, DW_AT_name("offset_shntB")
    3177                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_offset_shntB")
    3178                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3179                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3180              $C$DW$340       .dwtag  DW_TAG_member
    3181                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$22)
    3182                      .dwattr $C$DW$340, DW_AT_name("offset_shntC")
    3183                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_offset_shntC")
    3184                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3185                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$341       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
    3188                      .dwattr $C$DW$341, DW_AT_name("VdTesting")
    3189                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_VdTesting")
    3190                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3191                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$342       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$22)
    3194                      .dwattr $C$DW$342, DW_AT_name("VqTesting")
    3195                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_VqTesting")
    3196                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3197                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3198              $C$DW$343       .dwtag  DW_TAG_member
    3199                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    3200                      .dwattr $C$DW$343, DW_AT_name("IdRef")
    3201                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_IdRef")
    3202                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3203                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3204              $C$DW$344       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    3206                      .dwattr $C$DW$344, DW_AT_name("IqRef")
    3207                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_IqRef")
    3208                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3209                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$345       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$22)
    3212                      .dwattr $C$DW$345, DW_AT_name("SpeedRef")
    3213                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_SpeedRef")
    3214                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3215                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3216              $C$DW$346       .dwtag  DW_TAG_member
    3217                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$22)
    3218                      .dwattr $C$DW$346, DW_AT_name("ElecTheta")
    3219                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_ElecTheta")
    3220                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3221                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3222              $C$DW$347       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:55 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   62

    3223                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$22)
    3224                      .dwattr $C$DW$347, DW_AT_name("MechTheta")
    3225                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_MechTheta")
    3226                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3227                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3228              $C$DW$348       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    3230                      .dwattr $C$DW$348, DW_AT_name("currentAs")
    3231                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_currentAs")
    3232                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3233                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3234              $C$DW$349       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    3236                      .dwattr $C$DW$349, DW_AT_name("currentBs")
    3237                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_currentBs")
    3238                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3239                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3240              $C$DW$350       .dwtag  DW_TAG_member
    3241                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    3242                      .dwattr $C$DW$350, DW_AT_name("currentCs")
    3243                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_currentCs")
    3244                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3245                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3246              $C$DW$351       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$40)
    3248                      .dwattr $C$DW$351, DW_AT_name("alignCntr")
    3249                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_alignCntr")
    3250                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3251                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3252              $C$DW$352       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$40)
    3254                      .dwattr $C$DW$352, DW_AT_name("alignCnt")
    3255                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_alignCnt")
    3256                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3257                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3258              $C$DW$353       .dwtag  DW_TAG_member
    3259                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$34)
