TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:27:04 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/fsm_main.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("send_state_change_command")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_send_state_change_command")

    2022              ;* TYPE INFORMATION                                            *
    2023              ;***************************************************************
    2024              
    2025              $C$DW$T$281     .dwtag  DW_TAG_enumeration_type
    2026                      .dwattr $C$DW$T$281, DW_AT_byte_size(0x01)
    2027              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("COMBINED"), DW_AT_const_value(0x00)
    2028              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("ARTICULATED_STEERING"), DW_AT_const_value(0x01)
    2029              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("TURNTABLE_STEERING"), DW_AT_const_value(0x02)
    2030              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_LEFT"), DW_AT_const_value(0x03)
    2031              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_RIGHT"), DW_AT_const_value(0x04)
    2032              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_LEFT"), DW_AT_const_value(0x05)
    2033              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_MIDDLE"), DW_AT_const_value(0x06)
    2034              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("INCREMENT_SERVO"), DW_AT_const_value(0x07)
    2035              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("DECREMENT_SERVO"), DW_AT_const_value(0x08)
    2036              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_0"), DW_AT_const_value(0x09)
    2037              $C$DW$163       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_1"), DW_AT_const_value(0x0a)
    2038              $C$DW$164       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_2"), DW_AT_const_value(0x0b)
    2039              $C$DW$165       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_3"), DW_AT_const_value(0x0c)
    2040              $C$DW$166       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_4"), DW_AT_const_value(0x0d)
    2041              $C$DW$167       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_5"), DW_AT_const_value(0x0e)
    2042              $C$DW$168       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_6"), DW_AT_const_value(0x0f)
    2043              $C$DW$169       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_0"), DW_AT_const_value(0x10)
    2044              $C$DW$170       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_1"), DW_AT_const_value(0x11)
    2045              $C$DW$171       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_2"), DW_AT_const_value(0x12)
    2046                      .dwendtag $C$DW$T$281
    2047              
    2048              $C$DW$T$282     .dwtag  DW_TAG_typedef, DW_AT_name("config_mode_cmd_t")
    2049                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$281)
    2050                      .dwattr $C$DW$T$282, DW_AT_language(DW_LANG_C)
    2051              $C$DW$T$283     .dwtag  DW_TAG_pointer_type
    2052                      .dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$282)
    2053                      .dwattr $C$DW$T$283, DW_AT_address_class(0x20)
    2054              
    2055              $C$DW$T$284     .dwtag  DW_TAG_enumeration_type
    2056                      .dwattr $C$DW$T$284, DW_AT_byte_size(0x01)
    2057              $C$DW$172       .dwtag  DW_TAG_enumerator, DW_AT_name("NO_CMD"), DW_AT_const_value(0x00)
    2058              $C$DW$173       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_CHANGE_CMD"), DW_AT_const_value(0x01)
    2059              $C$DW$174       .dwtag  DW_TAG_enumerator, DW_AT_name("CONFIG_MODE_CMD"), DW_AT_const_value(0x02)
    2060              $C$DW$175       .dwtag  DW_TAG_enumerator, DW_AT_name("DRIVE_CMD"), DW_AT_const_value(0x03)
    2061                      .dwendtag $C$DW$T$284
    2062              
    2063              $C$DW$T$285     .dwtag  DW_TAG_typedef, DW_AT_name("wyflyCommands_t")
    2064                      .dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$284)
    2065                      .dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
    2066              
    2067              $C$DW$T$290     .dwtag  DW_TAG_enumeration_type
    2068                      .dwattr $C$DW$T$290, DW_AT_byte_size(0x01)
    2069              $C$DW$176       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_STOP"), DW_AT_const_value(0x00)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   41

    2070              $C$DW$177       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_CONFIG"), DW_AT_const_value(0x01)
    2071              $C$DW$178       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_RUN"), DW_AT_const_value(0x02)
    2072              $C$DW$179       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_ERROR"), DW_AT_const_value(0x03)
    2073                      .dwendtag $C$DW$T$290
    2074              
    2075              $C$DW$T$291     .dwtag  DW_TAG_typedef, DW_AT_name("fsm_main_state_t")
    2076                      .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    2077                      .dwattr $C$DW$T$291, DW_AT_language(DW_LANG_C)
    2078              $C$DW$T$292     .dwtag  DW_TAG_pointer_type
    2079                      .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$291)
    2080                      .dwattr $C$DW$T$292, DW_AT_address_class(0x20)
    2081              
    2082              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2083                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x18)
    2084              $C$DW$180       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$180, DW_AT_name("speed_ref")
    2087                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_speed_ref")
    2088                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2090              $C$DW$181       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2092                      .dwattr $C$DW$181, DW_AT_name("angle_ref")
    2093                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_angle_ref")
    2094                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2095                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2096              $C$DW$182       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$20)
    2098                      .dwattr $C$DW$182, DW_AT_name("steering_feedback")
    2099                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_steering_feedback")
    2100                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2101                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2102              $C$DW$183       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2104                      .dwattr $C$DW$183, DW_AT_name("speed_scaling_ms_to_mot")
    2105                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_speed_scaling_ms_to_mot")
    2106                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2107                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$184       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$184, DW_AT_name("kp")
    2111                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_kp")
    2112                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2113                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$185       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$185, DW_AT_name("ki")
    2117                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ki")
    2118                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2119                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2120              $C$DW$186       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2122                      .dwattr $C$DW$186, DW_AT_name("dt")
    2123                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_dt")
    2124                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   42

    2125                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$187       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$20)
    2128                      .dwattr $C$DW$187, DW_AT_name("steering_loop_count")
    2129                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_steering_loop_count")
    2130                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2131                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$188       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2134                      .dwattr $C$DW$188, DW_AT_name("motor_speed_1")
    2135                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_motor_speed_1")
    2136                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2137                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$189       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$189, DW_AT_name("motor_speed_2")
    2141                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_motor_speed_2")
    2142                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2143                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2144              $C$DW$190       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2146                      .dwattr $C$DW$190, DW_AT_name("scale_1")
    2147                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_scale_1")
    2148                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2149                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$191       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$191, DW_AT_name("scale_2")
    2153                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_scale_2")
    2154                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2155                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2156                      .dwendtag $C$DW$T$21
    2157              
    2158              $C$DW$T$294     .dwtag  DW_TAG_typedef, DW_AT_name("steering_control_t")
    2159                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$21)
    2160                      .dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
    2161              $C$DW$T$295     .dwtag  DW_TAG_pointer_type
    2162                      .dwattr $C$DW$T$295, DW_AT_type(*$C$DW$T$294)
    2163                      .dwattr $C$DW$T$295, DW_AT_address_class(0x20)
    2164              
    2165              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2166                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    2167              $C$DW$192       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2169                      .dwattr $C$DW$192, DW_AT_name("As")
    2170                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_As")
    2171                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$193       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2175                      .dwattr $C$DW$193, DW_AT_name("Bs")
    2176                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_Bs")
    2177                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2178                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2179              $C$DW$194       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   43

    2180                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$22)
    2181                      .dwattr $C$DW$194, DW_AT_name("Cs")
    2182                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_Cs")
    2183                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2184                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2185              $C$DW$195       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
    2187                      .dwattr $C$DW$195, DW_AT_name("Alpha")
    2188                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_Alpha")
    2189                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2190                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2191              $C$DW$196       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$22)
    2193                      .dwattr $C$DW$196, DW_AT_name("Beta")
    2194                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_Beta")
    2195                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2196                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2197                      .dwendtag $C$DW$T$23
    2198              
    2199              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
    2200                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$23)
    2201                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    2202              
    2203              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2204                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    2205              $C$DW$197       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
    2207                      .dwattr $C$DW$197, DW_AT_name("Alpha")
    2208                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Alpha")
    2209                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$198       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$22)
    2213                      .dwattr $C$DW$198, DW_AT_name("Beta")
    2214                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Beta")
    2215                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2216                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2217              $C$DW$199       .dwtag  DW_TAG_member
    2218                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
    2219                      .dwattr $C$DW$199, DW_AT_name("Angle")
    2220                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Angle")
    2221                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2222                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2223              $C$DW$200       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2225                      .dwattr $C$DW$200, DW_AT_name("Ds")
    2226                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Ds")
    2227                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2228                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$201       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
    2231                      .dwattr $C$DW$201, DW_AT_name("Qs")
    2232                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Qs")
    2233                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2234                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   44

    2235              $C$DW$202       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$22)
    2237                      .dwattr $C$DW$202, DW_AT_name("Sine")
    2238                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Sine")
    2239                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2240                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2241              $C$DW$203       .dwtag  DW_TAG_member
    2242                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
    2243                      .dwattr $C$DW$203, DW_AT_name("Cosine")
    2244                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Cosine")
    2245                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2246                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2247                      .dwendtag $C$DW$T$24
    2248              
    2249              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
    2250                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$24)
    2251                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2252              
    2253              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2254                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    2255              $C$DW$204       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    2257                      .dwattr $C$DW$204, DW_AT_name("Alpha")
    2258                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Alpha")
    2259                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2261              $C$DW$205       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
    2263                      .dwattr $C$DW$205, DW_AT_name("Beta")
    2264                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Beta")
    2265                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2266                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2267              $C$DW$206       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
    2269                      .dwattr $C$DW$206, DW_AT_name("Angle")
    2270                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Angle")
    2271                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2272                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2273              $C$DW$207       .dwtag  DW_TAG_member
    2274                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
    2275                      .dwattr $C$DW$207, DW_AT_name("Ds")
    2276                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Ds")
    2277                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2278                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2279              $C$DW$208       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
    2281                      .dwattr $C$DW$208, DW_AT_name("Qs")
    2282                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_Qs")
    2283                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2284                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2285              $C$DW$209       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
    2287                      .dwattr $C$DW$209, DW_AT_name("Sine")
    2288                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_Sine")
    2289                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   45

    2290                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2291              $C$DW$210       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
    2293                      .dwattr $C$DW$210, DW_AT_name("Cosine")
    2294                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_Cosine")
    2295                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2296                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2297                      .dwendtag $C$DW$T$25
    2298              
    2299              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
    2300                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$25)
    2301                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2302              
    2303              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2304                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x18)
    2305              $C$DW$211       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    2307                      .dwattr $C$DW$211, DW_AT_name("Ref")
    2308                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_Ref")
    2309                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2311              $C$DW$212       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$22)
    2313                      .dwattr $C$DW$212, DW_AT_name("Fbk")
    2314                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_Fbk")
    2315                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2316                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2317              $C$DW$213       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$22)
    2319                      .dwattr $C$DW$213, DW_AT_name("Out")
    2320                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_Out")
    2321                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2322                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2323              $C$DW$214       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    2325                      .dwattr $C$DW$214, DW_AT_name("Kp")
    2326                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_Kp")
    2327                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2328                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$215       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$22)
    2331                      .dwattr $C$DW$215, DW_AT_name("Ki")
    2332                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_Ki")
    2333                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2334                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$216       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    2337                      .dwattr $C$DW$216, DW_AT_name("Umax")
    2338                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_Umax")
    2339                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2340                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2341              $C$DW$217       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$22)
    2343                      .dwattr $C$DW$217, DW_AT_name("Umin")
    2344                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_Umin")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   46

    2345                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2346                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2347              $C$DW$218       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    2349                      .dwattr $C$DW$218, DW_AT_name("up")
    2350                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_up")
    2351                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2352                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2353              $C$DW$219       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2355                      .dwattr $C$DW$219, DW_AT_name("ui")
    2356                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_ui")
    2357                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2358                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2359              $C$DW$220       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$22)
    2361                      .dwattr $C$DW$220, DW_AT_name("v1")
    2362                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_v1")
    2363                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2364                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2365              $C$DW$221       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$22)
    2367                      .dwattr $C$DW$221, DW_AT_name("i1")
    2368                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_i1")
    2369                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2370                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2371              $C$DW$222       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$22)
    2373                      .dwattr $C$DW$222, DW_AT_name("w1")
    2374                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_w1")
    2375                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2376                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2377                      .dwendtag $C$DW$T$26
    2378              
    2379              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    2380                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$26)
    2381                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2382              
    2383              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2384                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2385              $C$DW$223       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
    2387                      .dwattr $C$DW$223, DW_AT_name("Ref")
    2388                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_Ref")
    2389                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2390                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$224       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
    2393                      .dwattr $C$DW$224, DW_AT_name("Fbk")
    2394                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_Fbk")
    2395                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2396                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2397              $C$DW$225       .dwtag  DW_TAG_member
    2398                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
    2399                      .dwattr $C$DW$225, DW_AT_name("Out")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   47

    2400                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_Out")
    2401                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2402                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2403              $C$DW$226       .dwtag  DW_TAG_member
    2404                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
    2405                      .dwattr $C$DW$226, DW_AT_name("c1")
    2406                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_c1")
    2407                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2408                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$227       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$22)
    2411                      .dwattr $C$DW$227, DW_AT_name("c2")
    2412                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_c2")
    2413                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2414                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2415                      .dwendtag $C$DW$T$27
    2416              
    2417              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
    2418                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$27)
    2419                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2420              
    2421              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2422                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    2423              $C$DW$228       .dwtag  DW_TAG_member
    2424                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$22)
    2425                      .dwattr $C$DW$228, DW_AT_name("Kr")
    2426                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_Kr")
    2427                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2428                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2429              $C$DW$229       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$22)
    2431                      .dwattr $C$DW$229, DW_AT_name("Kp")
    2432                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_Kp")
    2433                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2434                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$230       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$22)
    2437                      .dwattr $C$DW$230, DW_AT_name("Ki")
    2438                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_Ki")
    2439                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2440                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2441              $C$DW$231       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$22)
    2443                      .dwattr $C$DW$231, DW_AT_name("Kd")
    2444                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_Kd")
    2445                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2446                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$232       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$22)
    2449                      .dwattr $C$DW$232, DW_AT_name("Km")
    2450                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_Km")
    2451                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2452                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2453              $C$DW$233       .dwtag  DW_TAG_member
    2454                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   48

    2455                      .dwattr $C$DW$233, DW_AT_name("Umax")
    2456                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_Umax")
    2457                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2458                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2459              $C$DW$234       .dwtag  DW_TAG_member
    2460                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$22)
    2461                      .dwattr $C$DW$234, DW_AT_name("Umin")
    2462                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_Umin")
    2463                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2464                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2465                      .dwendtag $C$DW$T$28
    2466              
    2467              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
    2468                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    2469                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2470              
    2471              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2472                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    2473              $C$DW$235       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$22)
    2475                      .dwattr $C$DW$235, DW_AT_name("up")
    2476                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_up")
    2477                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2478                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2479              $C$DW$236       .dwtag  DW_TAG_member
    2480                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$22)
    2481                      .dwattr $C$DW$236, DW_AT_name("ui")
    2482                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_ui")
    2483                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2484                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2485              $C$DW$237       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$22)
    2487                      .dwattr $C$DW$237, DW_AT_name("ud")
    2488                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_ud")
    2489                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2490                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2491              $C$DW$238       .dwtag  DW_TAG_member
    2492                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$22)
    2493                      .dwattr $C$DW$238, DW_AT_name("v1")
    2494                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_v1")
    2495                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2496                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2497              $C$DW$239       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$22)
    2499                      .dwattr $C$DW$239, DW_AT_name("i1")
    2500                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_i1")
    2501                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2502                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2503              $C$DW$240       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2505                      .dwattr $C$DW$240, DW_AT_name("d1")
    2506                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_d1")
    2507                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2508                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2509              $C$DW$241       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   49

    2510                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$22)
    2511                      .dwattr $C$DW$241, DW_AT_name("d2")
    2512                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_d2")
    2513                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2514                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2515              $C$DW$242       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$22)
    2517                      .dwattr $C$DW$242, DW_AT_name("w1")
    2518                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_w1")
    2519                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2520                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2521                      .dwendtag $C$DW$T$29
    2522              
    2523              $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
    2524                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$29)
    2525                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2526              
    2527              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2528                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x28)
    2529              $C$DW$243       .dwtag  DW_TAG_member
    2530                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$30)
    2531                      .dwattr $C$DW$243, DW_AT_name("term")
    2532                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_term")
    2533                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2534                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$244       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$31)
    2537                      .dwattr $C$DW$244, DW_AT_name("param")
    2538                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_param")
    2539                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2540                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$245       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$32)
    2543                      .dwattr $C$DW$245, DW_AT_name("data")
    2544                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_data")
    2545                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2546                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2547                      .dwendtag $C$DW$T$33
    2548              
    2549              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
    2550                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$33)
    2551                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2552              
    2553              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2554                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x12)
    2555              $C$DW$246       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$22)
    2557                      .dwattr $C$DW$246, DW_AT_name("Ualpha")
    2558                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_Ualpha")
    2559                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2561              $C$DW$247       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    2563                      .dwattr $C$DW$247, DW_AT_name("Ubeta")
    2564                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_Ubeta")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   50

    2565                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2566                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2567              $C$DW$248       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    2569                      .dwattr $C$DW$248, DW_AT_name("Ta")
    2570                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_Ta")
    2571                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2572                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2573              $C$DW$249       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    2575                      .dwattr $C$DW$249, DW_AT_name("Tb")
    2576                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_Tb")
    2577                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2578                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2579              $C$DW$250       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    2581                      .dwattr $C$DW$250, DW_AT_name("Tc")
    2582                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_Tc")
    2583                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2584                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2585              $C$DW$251       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    2587                      .dwattr $C$DW$251, DW_AT_name("tmp1")
    2588                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_tmp1")
    2589                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2590                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2591              $C$DW$252       .dwtag  DW_TAG_member
    2592                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    2593                      .dwattr $C$DW$252, DW_AT_name("tmp2")
    2594                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_tmp2")
    2595                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2596                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2597              $C$DW$253       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    2599                      .dwattr $C$DW$253, DW_AT_name("tmp3")
    2600                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_tmp3")
    2601                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2602                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2603              $C$DW$254       .dwtag  DW_TAG_member
    2604                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$34)
    2605                      .dwattr $C$DW$254, DW_AT_name("VecSector")
    2606                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_VecSector")
    2607                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2608                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2609                      .dwendtag $C$DW$T$35
    2610              
    2611              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    2612                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$35)
    2613                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    2614              
    2615              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2616                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    2617              $C$DW$255       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$22)
    2619                      .dwattr $C$DW$255, DW_AT_name("TargetValue")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   51

    2620                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_TargetValue")
    2621                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2622                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2623              $C$DW$256       .dwtag  DW_TAG_member
    2624                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2625                      .dwattr $C$DW$256, DW_AT_name("RampDelayMax")
    2626                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_RampDelayMax")
    2627                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2628                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2629              $C$DW$257       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$22)
    2631                      .dwattr $C$DW$257, DW_AT_name("RampLowLimit")
    2632                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_RampLowLimit")
    2633                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2634                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2635              $C$DW$258       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$22)
    2637                      .dwattr $C$DW$258, DW_AT_name("RampHighLimit")
    2638                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_RampHighLimit")
    2639                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2640                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2641              $C$DW$259       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$20)
    2643                      .dwattr $C$DW$259, DW_AT_name("RampDelayCount")
    2644                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_RampDelayCount")
    2645                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2646                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2647              $C$DW$260       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$22)
    2649                      .dwattr $C$DW$260, DW_AT_name("SetpointValue")
    2650                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SetpointValue")
    2651                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2652                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$261       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$20)
    2655                      .dwattr $C$DW$261, DW_AT_name("EqualFlag")
    2656                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_EqualFlag")
    2657                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2658                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2659              $C$DW$262       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$22)
    2661                      .dwattr $C$DW$262, DW_AT_name("Tmp")
    2662                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_Tmp")
    2663                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2664                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2665                      .dwendtag $C$DW$T$36
    2666              
    2667              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    2668                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$36)
    2669                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2670              
    2671              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2672                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    2673              $C$DW$263       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$22)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   52

    2675                      .dwattr $C$DW$263, DW_AT_name("Freq")
    2676                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_Freq")
    2677                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2679              $C$DW$264       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$22)
    2681                      .dwattr $C$DW$264, DW_AT_name("StepAngleMax")
    2682                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_StepAngleMax")
    2683                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2684                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2685              $C$DW$265       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$22)
    2687                      .dwattr $C$DW$265, DW_AT_name("Angle")
    2688                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_Angle")
    2689                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2690                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2691              $C$DW$266       .dwtag  DW_TAG_member
    2692                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$22)
    2693                      .dwattr $C$DW$266, DW_AT_name("Gain")
    2694                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_Gain")
    2695                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2696                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2697              $C$DW$267       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$22)
    2699                      .dwattr $C$DW$267, DW_AT_name("Out")
    2700                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_Out")
    2701                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2702                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2703              $C$DW$268       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$22)
    2705                      .dwattr $C$DW$268, DW_AT_name("Offset")
    2706                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_Offset")
    2707                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2708                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2709                      .dwendtag $C$DW$T$37
    2710              
    2711              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    2712                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$37)
    2713                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2714              
    2715              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2716                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x16)
    2717              $C$DW$269       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$22)
    2719                      .dwattr $C$DW$269, DW_AT_name("DcBusVolt")
    2720                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_DcBusVolt")
    2721                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2723              $C$DW$270       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$22)
    2725                      .dwattr $C$DW$270, DW_AT_name("MfuncV1")
    2726                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_MfuncV1")
    2727                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2728                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2729              $C$DW$271       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   53

    2730                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$22)
    2731                      .dwattr $C$DW$271, DW_AT_name("MfuncV2")
    2732                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_MfuncV2")
    2733                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2734                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2735              $C$DW$272       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$22)
    2737                      .dwattr $C$DW$272, DW_AT_name("MfuncV3")
    2738                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_MfuncV3")
    2739                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2740                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2741              $C$DW$273       .dwtag  DW_TAG_member
    2742                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$34)
    2743                      .dwattr $C$DW$273, DW_AT_name("OutOfPhase")
    2744                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_OutOfPhase")
    2745                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2746                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2747              $C$DW$274       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$22)
    2749                      .dwattr $C$DW$274, DW_AT_name("VphaseA")
    2750                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_VphaseA")
    2751                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2752                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2753              $C$DW$275       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$22)
    2755                      .dwattr $C$DW$275, DW_AT_name("VphaseB")
    2756                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_VphaseB")
    2757                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2758                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2759              $C$DW$276       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$22)
    2761                      .dwattr $C$DW$276, DW_AT_name("VphaseC")
    2762                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_VphaseC")
    2763                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2764                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2765              $C$DW$277       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$22)
    2767                      .dwattr $C$DW$277, DW_AT_name("Valpha")
    2768                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_Valpha")
    2769                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2770                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2771              $C$DW$278       .dwtag  DW_TAG_member
    2772                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$22)
    2773                      .dwattr $C$DW$278, DW_AT_name("Vbeta")
    2774                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_Vbeta")
    2775                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2776                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2777              $C$DW$279       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$22)
    2779                      .dwattr $C$DW$279, DW_AT_name("temp")
    2780                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_temp")
    2781                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2782                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2783                      .dwendtag $C$DW$T$38
    2784              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   54

    2785              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    2786                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$38)
    2787                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2788              
    2789              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2790                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    2791              $C$DW$280       .dwtag  DW_TAG_member
    2792                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$22)
    2793                      .dwattr $C$DW$280, DW_AT_name("ElecTheta")
    2794                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_ElecTheta")
    2795                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2797              $C$DW$281       .dwtag  DW_TAG_member
    2798                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$20)
    2799                      .dwattr $C$DW$281, DW_AT_name("DirectionQep")
    2800                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_DirectionQep")
    2801                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2802                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2803              $C$DW$282       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$22)
    2805                      .dwattr $C$DW$282, DW_AT_name("OldElecTheta")
    2806                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_OldElecTheta")
    2807                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2808                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2809              $C$DW$283       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$22)
    2811                      .dwattr $C$DW$283, DW_AT_name("Speed")
    2812                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_Speed")
    2813                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2814                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2815              $C$DW$284       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$20)
    2817                      .dwattr $C$DW$284, DW_AT_name("BaseRpm")
    2818                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_BaseRpm")
    2819                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2820                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2821              $C$DW$285       .dwtag  DW_TAG_member
    2822                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$39)
    2823                      .dwattr $C$DW$285, DW_AT_name("K1")
    2824                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_K1")
    2825                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2826                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2827              $C$DW$286       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$22)
    2829                      .dwattr $C$DW$286, DW_AT_name("K2")
    2830                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_K2")
    2831                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2832                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2833              $C$DW$287       .dwtag  DW_TAG_member
    2834                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$22)
    2835                      .dwattr $C$DW$287, DW_AT_name("K3")
    2836                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_K3")
    2837                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2838                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2839              $C$DW$288       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   55

    2840                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$40)
    2841                      .dwattr $C$DW$288, DW_AT_name("SpeedRpm")
    2842                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_SpeedRpm")
    2843                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2844                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2845              $C$DW$289       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$22)
    2847                      .dwattr $C$DW$289, DW_AT_name("Tmp")
    2848                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_Tmp")
    2849                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2850                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2851                      .dwendtag $C$DW$T$41
    2852              
    2853              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    2854                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    2855                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2856              
    2857              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2858                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x12)
    2859              $C$DW$290       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    2861                      .dwattr $C$DW$290, DW_AT_name("ElecTheta")
    2862                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_ElecTheta")
    2863                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2865              $C$DW$291       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    2867                      .dwattr $C$DW$291, DW_AT_name("MechTheta")
    2868                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_MechTheta")
    2869                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2870                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2871              $C$DW$292       .dwtag  DW_TAG_member
    2872                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$34)
    2873                      .dwattr $C$DW$292, DW_AT_name("DirectionQep")
    2874                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_DirectionQep")
    2875                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2876                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$293       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$34)
    2879                      .dwattr $C$DW$293, DW_AT_name("QepPeriod")
    2880                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_QepPeriod")
    2881                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2882                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2883              $C$DW$294       .dwtag  DW_TAG_member
    2884                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$20)
    2885                      .dwattr $C$DW$294, DW_AT_name("QepCountIndex")
    2886                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_QepCountIndex")
    2887                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2888                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2889              $C$DW$295       .dwtag  DW_TAG_member
    2890                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$40)
    2891                      .dwattr $C$DW$295, DW_AT_name("RawTheta")
    2892                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_RawTheta")
    2893                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2894                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   56

    2895              $C$DW$296       .dwtag  DW_TAG_member
    2896                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    2897                      .dwattr $C$DW$296, DW_AT_name("MechScaler")
    2898                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_MechScaler")
    2899                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2900                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2901              $C$DW$297       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$34)
    2903                      .dwattr $C$DW$297, DW_AT_name("LineEncoder")
    2904                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_LineEncoder")
    2905                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2906                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    2907              $C$DW$298       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$34)
    2909                      .dwattr $C$DW$298, DW_AT_name("PolePairs")
    2910                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_PolePairs")
    2911                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2912                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    2913              $C$DW$299       .dwtag  DW_TAG_member
    2914                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$40)
    2915                      .dwattr $C$DW$299, DW_AT_name("CalibratedAngle")
    2916                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_CalibratedAngle")
    2917                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2918                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    2919              $C$DW$300       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$34)
    2921                      .dwattr $C$DW$300, DW_AT_name("IndexSyncFlag")
    2922                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_IndexSyncFlag")
    2923                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2924                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    2925                      .dwendtag $C$DW$T$42
    2926              
    2927              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    2928                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$42)
    2929                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2930              
    2931              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2932                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x07)
    2933              $C$DW$301       .dwtag  DW_TAG_member
    2934                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$43)
    2935                      .dwattr $C$DW$301, DW_AT_name("stat_reg1")
    2936                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_stat_reg1")
    2937                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2938                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    2939              $C$DW$302       .dwtag  DW_TAG_member
    2940                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$44)
    2941                      .dwattr $C$DW$302, DW_AT_name("stat_reg2")
    2942                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_stat_reg2")
    2943                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2944                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    2945              $C$DW$303       .dwtag  DW_TAG_member
    2946                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$45)
    2947                      .dwattr $C$DW$303, DW_AT_name("cntrl_reg1")
    2948                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_cntrl_reg1")
    2949                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   57

    2950                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    2951              $C$DW$304       .dwtag  DW_TAG_member
    2952                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$46)
    2953                      .dwattr $C$DW$304, DW_AT_name("cntrl_reg2")
    2954                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_cntrl_reg2")
    2955                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    2956                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    2957              $C$DW$305       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$34)
    2959                      .dwattr $C$DW$305, DW_AT_name("readCntrl1")
    2960                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_readCntrl1")
    2961                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2962                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$306       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$34)
    2965                      .dwattr $C$DW$306, DW_AT_name("readCntrl2")
    2966                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_readCntrl2")
    2967                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2968                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$307       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$34)
    2971                      .dwattr $C$DW$307, DW_AT_name("DRV_fault")
    2972                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_DRV_fault")
    2973                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2974                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2975                      .dwendtag $C$DW$T$47
    2976              
    2977              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    2978                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$47)
    2979                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2980              
    2981              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    2982                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x15)
    2983              $C$DW$308       .dwtag  DW_TAG_member
    2984                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$34)
    2985                      .dwattr $C$DW$308, DW_AT_name("Rsvd0")
    2986                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_Rsvd0")
    2987                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2988                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2989              $C$DW$309       .dwtag  DW_TAG_member
    2990                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$48)
    2991                      .dwattr $C$DW$309, DW_AT_name("status1_wwd")
    2992                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_status1_wwd")
    2993                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2994                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2995              $C$DW$310       .dwtag  DW_TAG_member
    2996                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$49)
    2997                      .dwattr $C$DW$310, DW_AT_name("status2_ov_vds")
    2998                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_status2_ov_vds")
    2999                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3000                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3001              $C$DW$311       .dwtag  DW_TAG_member
    3002                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$50)
    3003                      .dwattr $C$DW$311, DW_AT_name("status3_IC")
    3004                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_status3_IC")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   58

    3005                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3006                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3007              $C$DW$312       .dwtag  DW_TAG_member
    3008                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$51)
    3009                      .dwattr $C$DW$312, DW_AT_name("status4_gd_Vgs")
    3010                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    3011                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3012                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3013              $C$DW$313       .dwtag  DW_TAG_member
    3014                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$52)
    3015                      .dwattr $C$DW$313, DW_AT_name("cntrl5_hs_gd")
    3016                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    3017                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3018                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3019              $C$DW$314       .dwtag  DW_TAG_member
    3020                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$53)
    3021                      .dwattr $C$DW$314, DW_AT_name("cntrl6_ls_gd")
    3022                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    3023                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3024                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3025              $C$DW$315       .dwtag  DW_TAG_member
    3026                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$54)
    3027                      .dwattr $C$DW$315, DW_AT_name("cntrl7_gd")
    3028                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_cntrl7_gd")
    3029                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    3030                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3031              $C$DW$316       .dwtag  DW_TAG_member
    3032                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$34)
    3033                      .dwattr $C$DW$316, DW_AT_name("Rsvd8")
    3034                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_Rsvd8")
    3035                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3036                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3037              $C$DW$317       .dwtag  DW_TAG_member
    3038                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$55)
    3039                      .dwattr $C$DW$317, DW_AT_name("cntrl9_IC_ops")
    3040                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    3041                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3042                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3043              $C$DW$318       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$56)
    3045                      .dwattr $C$DW$318, DW_AT_name("cntrlA_shunt_amp")
    3046                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    3047                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3048                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3049              $C$DW$319       .dwtag  DW_TAG_member
    3050                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$57)
    3051                      .dwattr $C$DW$319, DW_AT_name("cntrlB_Vreg")
    3052                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    3053                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3054                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3055              $C$DW$320       .dwtag  DW_TAG_member
    3056                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$58)
    3057                      .dwattr $C$DW$320, DW_AT_name("cntrlC_Vds_SNS")
    3058                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    3059                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   59

    3060                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3061              $C$DW$321       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$34)
    3063                      .dwattr $C$DW$321, DW_AT_name("readCntrl5")
    3064                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_readCntrl5")
    3065                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    3066                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3067              $C$DW$322       .dwtag  DW_TAG_member
    3068                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$34)
    3069                      .dwattr $C$DW$322, DW_AT_name("readCntrl6")
    3070                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_readCntrl6")
    3071                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3072                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3073              $C$DW$323       .dwtag  DW_TAG_member
    3074                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$34)
    3075                      .dwattr $C$DW$323, DW_AT_name("readCntrl7")
    3076                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_readCntrl7")
    3077                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3078                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3079              $C$DW$324       .dwtag  DW_TAG_member
    3080                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$34)
    3081                      .dwattr $C$DW$324, DW_AT_name("readCntrl9")
    3082                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_readCntrl9")
    3083                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3084                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3085              $C$DW$325       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$34)
    3087                      .dwattr $C$DW$325, DW_AT_name("readCntrlA")
    3088                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_readCntrlA")
    3089                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    3090                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3091              $C$DW$326       .dwtag  DW_TAG_member
    3092                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$34)
    3093                      .dwattr $C$DW$326, DW_AT_name("readCntrlB")
    3094                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_readCntrlB")
    3095                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3096                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3097              $C$DW$327       .dwtag  DW_TAG_member
    3098                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$34)
    3099                      .dwattr $C$DW$327, DW_AT_name("readCntrlC")
    3100                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_readCntrlC")
    3101                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    3102                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3103              $C$DW$328       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$34)
    3105                      .dwattr $C$DW$328, DW_AT_name("DRV_fault")
    3106                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_DRV_fault")
    3107                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3108                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3109                      .dwendtag $C$DW$T$59
    3110              
    3111              $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    3112                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$59)
    3113                      .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3114              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   60

    3115              $C$DW$T$79      .dwtag  DW_TAG_structure_type
    3116                      .dwattr $C$DW$T$79, DW_AT_byte_size(0x14c)
    3117              $C$DW$329       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$61)
    3119                      .dwattr $C$DW$329, DW_AT_name("PwmARegs")
    3120                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_PwmARegs")
    3121                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$330       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$61)
    3125                      .dwattr $C$DW$330, DW_AT_name("PwmBRegs")
    3126                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_PwmBRegs")
    3127                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3128                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3129              $C$DW$331       .dwtag  DW_TAG_member
    3130                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$61)
    3131                      .dwattr $C$DW$331, DW_AT_name("PwmCRegs")
    3132                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_PwmCRegs")
    3133                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3134                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3135              $C$DW$332       .dwtag  DW_TAG_member
    3136                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$63)
    3137                      .dwattr $C$DW$332, DW_AT_name("QepRegs")
    3138                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_QepRegs")
    3139                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3140                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$333       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$65)
    3143                      .dwattr $C$DW$333, DW_AT_name("SpiRegs")
    3144                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_SpiRegs")
    3145                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3146                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3147              $C$DW$334       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$34)
    3149                      .dwattr $C$DW$334, DW_AT_name("drvScsPin")
    3150                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_drvScsPin")
    3151                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3152                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3153              $C$DW$335       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$22)
    3155                      .dwattr $C$DW$335, DW_AT_name("offset_shntA")
    3156                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_offset_shntA")
    3157                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3158                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$336       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$22)
    3161                      .dwattr $C$DW$336, DW_AT_name("offset_shntB")
    3162                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_offset_shntB")
    3163                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3164                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$337       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$22)
    3167                      .dwattr $C$DW$337, DW_AT_name("offset_shntC")
    3168                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_offset_shntC")
    3169                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   61

    3170                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3171              $C$DW$338       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$22)
    3173                      .dwattr $C$DW$338, DW_AT_name("VdTesting")
    3174                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_VdTesting")
    3175                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3176                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3177              $C$DW$339       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$22)
    3179                      .dwattr $C$DW$339, DW_AT_name("VqTesting")
    3180                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_VqTesting")
    3181                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3182                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$340       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$22)
    3185                      .dwattr $C$DW$340, DW_AT_name("IdRef")
    3186                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_IdRef")
    3187                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3188                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3189              $C$DW$341       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$22)
    3191                      .dwattr $C$DW$341, DW_AT_name("IqRef")
    3192                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_IqRef")
    3193                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3194                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3195              $C$DW$342       .dwtag  DW_TAG_member
    3196                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$22)
    3197                      .dwattr $C$DW$342, DW_AT_name("SpeedRef")
    3198                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_SpeedRef")
    3199                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3200                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3201              $C$DW$343       .dwtag  DW_TAG_member
    3202                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$22)
    3203                      .dwattr $C$DW$343, DW_AT_name("ElecTheta")
    3204                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_ElecTheta")
    3205                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3206                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3207              $C$DW$344       .dwtag  DW_TAG_member
    3208                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$22)
    3209                      .dwattr $C$DW$344, DW_AT_name("MechTheta")
    3210                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_MechTheta")
    3211                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3212                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3213              $C$DW$345       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    3215                      .dwattr $C$DW$345, DW_AT_name("currentAs")
    3216                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_currentAs")
    3217                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3218                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$346       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    3221                      .dwattr $C$DW$346, DW_AT_name("currentBs")
    3222                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_currentBs")
    3223                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3224                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:05 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
fsm_main.asm                                                         PAGE   62

    3225              $C$DW$347       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    3227                      .dwattr $C$DW$347, DW_AT_name("currentCs")
    3228                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_currentCs")
    3229                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3230                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3231              $C$DW$348       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$40)
    3233                      .dwattr $C$DW$348, DW_AT_name("alignCntr")
    3234                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_alignCntr")
    3235                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3236                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$349       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$40)
    3239                      .dwattr $C$DW$349, DW_AT_name("alignCnt")
    3240                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_alignCnt")
    3241                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3242                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$350       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$34)
