TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:26:48 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../TI/Drivers/interrupt.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__disable_interrupts")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("___disable_interrupts")

    1044 000001a8 1BA6          CMP       AR6,#2048             ; [CPU_] |321| 
         000001a9 0800 
    1045 000001aa 56C2          BF        $C$L30,GT             ; [CPU_] |321| 
         000001ab 0018 
    1046                      ; branchcc occurs ; [] |321| 
    1047 000001ac 1BA6          CMP       AR6,#2048             ; [CPU_] |321| 
         000001ad 0800 
    1048 000001ae ECCB          BF        $C$L22,EQ             ; [CPU_] |321| 
    1049                      ; branchcc occurs ; [] |321| 
    1050 000001af 80A6          MOVZ      AR7,AR6               ; [CPU_] |321| 
    1051 000001b0 8F00          MOVL      XAR4,#256             ; [CPU_U] |321| 
         000001b1 0100 
    1052 000001b2 A8A9          MOVL      ACC,XAR4              ; [CPU_] |321| 
    1053 000001b3 0FA7          CMPL      ACC,XAR7              ; [CPU_] |321| 
    1054 000001b4 ECBC          BF        $C$L19,EQ             ; [CPU_] |321| 
    1055                      ; branchcc occurs ; [] |321| 
    1056 000001b5 80A6          MOVZ      AR7,AR6               ; [CPU_] |321| 
    1057 000001b6 8F00          MOVL      XAR4,#512             ; [CPU_U] |321| 
         000001b7 0200 
    1058 000001b8 A8A9          MOVL      ACC,XAR4              ; [CPU_] |321| 
    1059 000001b9 0FA7          CMPL      ACC,XAR7              ; [CPU_] |321| 
    1060 000001ba ECB9          BF        $C$L20,EQ             ; [CPU_] |321| 
    1061                      ; branchcc occurs ; [] |321| 
    1062 000001bb 88A6          MOVZ      AR6,AR6               ; [CPU_] |321| 
    1063 000001bc 8F00          MOVL      XAR4,#1024            ; [CPU_U] |321| 
         000001bd 0400 
    1064 000001be A8A9          MOVL      ACC,XAR4              ; [CPU_] |321| 
    1065 000001bf 0FA6          CMPL      ACC,XAR6              ; [CPU_] |321| 
    1066 000001c0 ECB6          BF        $C$L21,EQ             ; [CPU_] |321| 
    1067                      ; branchcc occurs ; [] |321| 
    1068 000001c1 6F14          B         $C$L31,UNC            ; [CPU_] |321| 
    1069                      ; branch occurs ; [] |321| 
    1070 000001c2       $C$L30:    
    1071 000001c2 80A6          MOVZ      AR7,AR6               ; [CPU_] |321| 
    1072 000001c3 8F00          MOVL      XAR4,#4096            ; [CPU_U] |321| 
         000001c4 1000 
    1073 000001c5 A8A9          MOVL      ACC,XAR4              ; [CPU_] |321| 
    1074 000001c6 0FA7          CMPL      ACC,XAR7              ; [CPU_] |321| 
    1075 000001c7 ECB5          BF        $C$L23,EQ             ; [CPU_] |321| 
    1076                      ; branchcc occurs ; [] |321| 
    1077 000001c8 80A6          MOVZ      AR7,AR6               ; [CPU_] |321| 
    1078 000001c9 8F00          MOVL      XAR4,#8192            ; [CPU_U] |321| 
         000001ca 2000 
    1079 000001cb A8A9          MOVL      ACC,XAR4              ; [CPU_] |321| 
    1080 000001cc 0FA7          CMPL      ACC,XAR7              ; [CPU_] |321| 
    1081 000001cd ECB2          BF        $C$L24,EQ             ; [CPU_] |321| 
    1082                      ; branchcc occurs ; [] |321| 
    1083 000001ce 88A6          MOVZ      AR6,AR6               ; [CPU_] |321| 
    1084 000001cf 8F00          MOVL      XAR4,#16384           ; [CPU_U] |321| 
         000001d0 4000 
    1085 000001d1 A8A9          MOVL      ACC,XAR4              ; [CPU_] |321| 
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   22

    1086 000001d2 0FA6          CMPL      ACC,XAR6              ; [CPU_] |321| 
    1087 000001d3 ECAF          BF        $C$L25,EQ             ; [CPU_] |321| 
    1088                      ; branchcc occurs ; [] |321| 
    1089 000001d4 6F01          B         $C$L31,UNC            ; [CPU_] |321| 
    1090                      ; branch occurs ; [] |321| 
    1091 000001d5       $C$L31:    
    1092 000001d5 FE82          SUBB      SP,#2                 ; [CPU_U] 
    1093                      .dwcfi  cfa_offset, -2
    1094              $C$DW$47        .dwtag  DW_TAG_TI_branch
    1095                      .dwattr $C$DW$47, DW_AT_low_pc(0x00)
    1096                      .dwattr $C$DW$47, DW_AT_TI_return
    1097 000001d6 0006          LRETR     ; [CPU_] 
    1098                      ; return occurs ; [] 
    1099                      .dwattr $C$DW$44, DW_AT_TI_end_file("../TI/Drivers/interrupt.c")
    1100                      .dwattr $C$DW$44, DW_AT_TI_end_line(0x175)
    1101                      .dwattr $C$DW$44, DW_AT_TI_end_column(0x01)
    1102                      .dwendentry
    1103                      .dwendtag $C$DW$44
    1104              
    1105              ;**************************************************************
    1106              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1107              ;**************************************************************
    1108                      .global _PieCtrlRegs
    1109                      .global _PieVectTable
    1110              
    1111              ;***************************************************************
    1112              ;* TYPE INFORMATION                                            *
    1113              ;***************************************************************
    1114              
    1115              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1116                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    1117                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1118              $C$DW$48        .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$48, DW_AT_name("ACK1")
    1121                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ACK1")
    1122                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1123                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1125              $C$DW$49        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1127                      .dwattr $C$DW$49, DW_AT_name("ACK2")
    1128                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ACK2")
    1129                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1130                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1132              $C$DW$50        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1134                      .dwattr $C$DW$50, DW_AT_name("ACK3")
    1135                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_ACK3")
    1136                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1137                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1139              $C$DW$51        .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   23

    1141                      .dwattr $C$DW$51, DW_AT_name("ACK4")
    1142                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_ACK4")
    1143                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1144                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1146              $C$DW$52        .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1148                      .dwattr $C$DW$52, DW_AT_name("ACK5")
    1149                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ACK5")
    1150                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1151                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1152                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1153              $C$DW$53        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$53, DW_AT_name("ACK6")
    1156                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_ACK6")
    1157                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1158                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1160              $C$DW$54        .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$54, DW_AT_name("ACK7")
    1163                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_ACK7")
    1164                      .dwattr $C$DW$54, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1165                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$55        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$55, DW_AT_name("ACK8")
    1170                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ACK8")
    1171                      .dwattr $C$DW$55, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1172                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$56        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$56, DW_AT_name("ACK9")
    1177                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ACK9")
    1178                      .dwattr $C$DW$56, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1181              $C$DW$57        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$57, DW_AT_name("ACK10")
    1184                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ACK10")
    1185                      .dwattr $C$DW$57, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$58        .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$58, DW_AT_name("ACK11")
    1191                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_ACK11")
    1192                      .dwattr $C$DW$58, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1193                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$59        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   24

    1196                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$59, DW_AT_name("ACK12")
    1198                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_ACK12")
    1199                      .dwattr $C$DW$59, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1200                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1202              $C$DW$60        .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$60, DW_AT_name("rsvd1")
    1205                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd1")
    1206                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1207                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1209                      .dwendtag $C$DW$T$20
    1210              
    1211              
    1212              $C$DW$T$21      .dwtag  DW_TAG_union_type
    1213                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    1214                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1215              $C$DW$61        .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$61, DW_AT_name("all")
    1218                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
    1219                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$62        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
    1223                      .dwattr $C$DW$62, DW_AT_name("bit")
    1224                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
    1225                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1227                      .dwendtag $C$DW$T$21
    1228              
    1229              
    1230              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1231                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    1232                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1233              $C$DW$63        .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$63, DW_AT_name("ENPIE")
    1236                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_ENPIE")
    1237                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$64        .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$64, DW_AT_name("PIEVECT")
    1243                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PIEVECT")
    1244                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1245                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1247                      .dwendtag $C$DW$T$22
    1248              
    1249              
    1250              $C$DW$T$23      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   25

    1251                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    1252                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1253              $C$DW$65        .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$65, DW_AT_name("all")
    1256                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
    1257                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1259              $C$DW$66        .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1261                      .dwattr $C$DW$66, DW_AT_name("bit")
    1262                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
    1263                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1265                      .dwendtag $C$DW$T$23
    1266              
    1267              
    1268              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1269                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER10_BITS")
    1270                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1271              $C$DW$67        .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$67, DW_AT_name("INTx1")
    1274                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_INTx1")
    1275                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$68        .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$68, DW_AT_name("INTx2")
    1281                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_INTx2")
    1282                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1283                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$69        .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$69, DW_AT_name("INTx3")
    1288                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_INTx3")
    1289                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$70        .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$70, DW_AT_name("INTx4")
    1295                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_INTx4")
    1296                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$71        .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$71, DW_AT_name("INTx5")
    1302                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_INTx5")
    1303                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   26

    1306              $C$DW$72        .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$72, DW_AT_name("INTx6")
    1309                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_INTx6")
    1310                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$73        .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$73, DW_AT_name("INTx7")
    1316                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_INTx7")
    1317                      .dwattr $C$DW$73, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$74        .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$74, DW_AT_name("INTx8")
    1323                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_INTx8")
    1324                      .dwattr $C$DW$74, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1325                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$75        .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$75, DW_AT_name("INTx9")
    1330                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_INTx9")
    1331                      .dwattr $C$DW$75, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$76        .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$76, DW_AT_name("INTx10")
    1337                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_INTx10")
    1338                      .dwattr $C$DW$76, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$77        .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$77, DW_AT_name("INTx11")
    1344                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_INTx11")
    1345                      .dwattr $C$DW$77, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1346                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$78        .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$78, DW_AT_name("INTx12")
    1351                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_INTx12")
    1352                      .dwattr $C$DW$78, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1353                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1354                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$79        .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$79, DW_AT_name("INTx13")
    1358                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INTx13")
    1359                      .dwattr $C$DW$79, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1360                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   27

    1361                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$80        .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$80, DW_AT_name("INTx14")
    1365                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INTx14")
    1366                      .dwattr $C$DW$80, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1367                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$81        .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1371                      .dwattr $C$DW$81, DW_AT_name("INTx15")
    1372                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTx15")
    1373                      .dwattr $C$DW$81, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1374                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$82        .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1378                      .dwattr $C$DW$82, DW_AT_name("INTx16")
    1379                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTx16")
    1380                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1383                      .dwendtag $C$DW$T$24
    1384              
    1385              
    1386              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1387                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER10_REG")
    1388                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    1389              $C$DW$83        .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$83, DW_AT_name("all")
    1392                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1393                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$84        .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
    1397                      .dwattr $C$DW$84, DW_AT_name("bit")
    1398                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
    1399                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1400                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1401                      .dwendtag $C$DW$T$25
    1402              
    1403              
    1404              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1405                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER11_BITS")
    1406                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1407              $C$DW$85        .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$85, DW_AT_name("INTx1")
    1410                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTx1")
    1411                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1412                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$86        .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   28

    1416                      .dwattr $C$DW$86, DW_AT_name("INTx2")
    1417                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_INTx2")
    1418                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1419                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1421              $C$DW$87        .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$87, DW_AT_name("INTx3")
    1424                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_INTx3")
    1425                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1426                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1428              $C$DW$88        .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1430                      .dwattr $C$DW$88, DW_AT_name("INTx4")
    1431                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_INTx4")
    1432                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1433                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$89        .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$89, DW_AT_name("INTx5")
    1438                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_INTx5")
    1439                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1440                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$90        .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$90, DW_AT_name("INTx6")
    1445                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_INTx6")
    1446                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1447                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1449              $C$DW$91        .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$91, DW_AT_name("INTx7")
    1452                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_INTx7")
    1453                      .dwattr $C$DW$91, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1454                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$92        .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$92, DW_AT_name("INTx8")
    1459                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_INTx8")
    1460                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1461                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1463              $C$DW$93        .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1465                      .dwattr $C$DW$93, DW_AT_name("INTx9")
    1466                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_INTx9")
    1467                      .dwattr $C$DW$93, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1468                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$94        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   29

    1471                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$94, DW_AT_name("INTx10")
    1473                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_INTx10")
    1474                      .dwattr $C$DW$94, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1475                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$95        .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$95, DW_AT_name("INTx11")
    1480                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_INTx11")
    1481                      .dwattr $C$DW$95, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1482                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$96        .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$96, DW_AT_name("INTx12")
    1487                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_INTx12")
    1488                      .dwattr $C$DW$96, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1489                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$97        .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$97, DW_AT_name("INTx13")
    1494                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_INTx13")
    1495                      .dwattr $C$DW$97, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1496                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$98        .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$98, DW_AT_name("INTx14")
    1501                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_INTx14")
    1502                      .dwattr $C$DW$98, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1503                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1505              $C$DW$99        .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$99, DW_AT_name("INTx15")
    1508                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INTx15")
    1509                      .dwattr $C$DW$99, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1510                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1512              $C$DW$100       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$100, DW_AT_name("INTx16")
    1515                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INTx16")
    1516                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1517                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1519                      .dwendtag $C$DW$T$26
    1520              
    1521              
    1522              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1523                      .dwattr $C$DW$T$27, DW_AT_name("PIEIER11_REG")
    1524                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1525              $C$DW$101       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   30

    1526                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$101, DW_AT_name("all")
    1528                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1529                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$102       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$26)
    1533                      .dwattr $C$DW$102, DW_AT_name("bit")
    1534                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1535                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1537                      .dwendtag $C$DW$T$27
    1538              
    1539              
    1540              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1541                      .dwattr $C$DW$T$28, DW_AT_name("PIEIER12_BITS")
    1542                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1543              $C$DW$103       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$103, DW_AT_name("INTx1")
    1546                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx1")
    1547                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$104       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$104, DW_AT_name("INTx2")
    1553                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx2")
    1554                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1555                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$105       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$105, DW_AT_name("INTx3")
    1560                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx3")
    1561                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1562                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$106       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$106, DW_AT_name("INTx4")
    1567                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx4")
    1568                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1569                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$107       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$107, DW_AT_name("INTx5")
    1574                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx5")
    1575                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1576                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1578              $C$DW$108       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$108, DW_AT_name("INTx6")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   31

    1581                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx6")
    1582                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1583                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1585              $C$DW$109       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1587                      .dwattr $C$DW$109, DW_AT_name("INTx7")
    1588                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_INTx7")
    1589                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1590                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$110       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$110, DW_AT_name("INTx8")
    1595                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTx8")
    1596                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$111       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1601                      .dwattr $C$DW$111, DW_AT_name("INTx9")
    1602                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INTx9")
    1603                      .dwattr $C$DW$111, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1604                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$112       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$112, DW_AT_name("INTx10")
    1609                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx10")
    1610                      .dwattr $C$DW$112, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1611                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1613              $C$DW$113       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1615                      .dwattr $C$DW$113, DW_AT_name("INTx11")
    1616                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INTx11")
    1617                      .dwattr $C$DW$113, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1618                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1619                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1620              $C$DW$114       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1622                      .dwattr $C$DW$114, DW_AT_name("INTx12")
    1623                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_INTx12")
    1624                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1625                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$115       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$115, DW_AT_name("INTx13")
    1630                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx13")
    1631                      .dwattr $C$DW$115, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1632                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1633                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$116       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   32

    1636                      .dwattr $C$DW$116, DW_AT_name("INTx14")
    1637                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx14")
    1638                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1639                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$117       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$117, DW_AT_name("INTx15")
    1644                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx15")
    1645                      .dwattr $C$DW$117, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1646                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1647                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1648              $C$DW$118       .dwtag  DW_TAG_member
    1649                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1650                      .dwattr $C$DW$118, DW_AT_name("INTx16")
    1651                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx16")
    1652                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1653                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1655                      .dwendtag $C$DW$T$28
    1656              
    1657              
    1658              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1659                      .dwattr $C$DW$T$29, DW_AT_name("PIEIER12_REG")
    1660                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1661              $C$DW$119       .dwtag  DW_TAG_member
    1662                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1663                      .dwattr $C$DW$119, DW_AT_name("all")
    1664                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1665                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1667              $C$DW$120       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$28)
    1669                      .dwattr $C$DW$120, DW_AT_name("bit")
    1670                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1671                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1673                      .dwendtag $C$DW$T$29
    1674              
    1675              
    1676              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1677                      .dwattr $C$DW$T$30, DW_AT_name("PIEIER1_BITS")
    1678                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1679              $C$DW$121       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$121, DW_AT_name("INTx1")
    1682                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_INTx1")
    1683                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$122       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$122, DW_AT_name("INTx2")
    1689                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_INTx2")
    1690                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   33

    1691                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$123       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1695                      .dwattr $C$DW$123, DW_AT_name("INTx3")
    1696                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_INTx3")
    1697                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1698                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1700              $C$DW$124       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$124, DW_AT_name("INTx4")
    1703                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_INTx4")
    1704                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1705                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$125       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$125, DW_AT_name("INTx5")
    1710                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_INTx5")
    1711                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1712                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1714              $C$DW$126       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$126, DW_AT_name("INTx6")
    1717                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_INTx6")
    1718                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1719                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1721              $C$DW$127       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$127, DW_AT_name("INTx7")
    1724                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INTx7")
    1725                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1726                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1727                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$128       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$128, DW_AT_name("INTx8")
    1731                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INTx8")
    1732                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1733                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1734                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$129       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1737                      .dwattr $C$DW$129, DW_AT_name("INTx9")
    1738                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_INTx9")
    1739                      .dwattr $C$DW$129, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1741                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1742              $C$DW$130       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$130, DW_AT_name("INTx10")
    1745                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_INTx10")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   34

    1746                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1747                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1748                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$131       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$131, DW_AT_name("INTx11")
    1752                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_INTx11")
    1753                      .dwattr $C$DW$131, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1755                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$132       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$132, DW_AT_name("INTx12")
    1759                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_INTx12")
    1760                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1761                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$133       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$133, DW_AT_name("INTx13")
    1766                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_INTx13")
    1767                      .dwattr $C$DW$133, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1768                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$134       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$134, DW_AT_name("INTx14")
    1773                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INTx14")
    1774                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1775                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$135       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$135, DW_AT_name("INTx15")
    1780                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INTx15")
    1781                      .dwattr $C$DW$135, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1782                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1784              $C$DW$136       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$136, DW_AT_name("INTx16")
    1787                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_INTx16")
    1788                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1789                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1790                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1791                      .dwendtag $C$DW$T$30
    1792              
    1793              
    1794              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1795                      .dwattr $C$DW$T$31, DW_AT_name("PIEIER1_REG")
    1796                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1797              $C$DW$137       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1799                      .dwattr $C$DW$137, DW_AT_name("all")
    1800                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   35

    1801                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$138       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$30)
    1805                      .dwattr $C$DW$138, DW_AT_name("bit")
    1806                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1807                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1809                      .dwendtag $C$DW$T$31
    1810              
    1811              
    1812              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1813                      .dwattr $C$DW$T$32, DW_AT_name("PIEIER2_BITS")
    1814                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1815              $C$DW$139       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$139, DW_AT_name("INTx1")
    1818                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_INTx1")
    1819                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$140       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$140, DW_AT_name("INTx2")
    1825                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_INTx2")
    1826                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1827                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$141       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$141, DW_AT_name("INTx3")
    1832                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_INTx3")
    1833                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$142       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$142, DW_AT_name("INTx4")
    1839                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_INTx4")
    1840                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1841                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1842                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$143       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1845                      .dwattr $C$DW$143, DW_AT_name("INTx5")
    1846                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_INTx5")
    1847                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1850              $C$DW$144       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$144, DW_AT_name("INTx6")
    1853                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_INTx6")
    1854                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1855                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   36

    1856                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$145       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1859                      .dwattr $C$DW$145, DW_AT_name("INTx7")
    1860                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_INTx7")
    1861                      .dwattr $C$DW$145, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1863                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1864              $C$DW$146       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$146, DW_AT_name("INTx8")
    1867                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_INTx8")
    1868                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1869                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1870                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1871              $C$DW$147       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$147, DW_AT_name("INTx9")
    1874                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_INTx9")
    1875                      .dwattr $C$DW$147, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1876                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1877                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$148       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$148, DW_AT_name("INTx10")
    1881                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_INTx10")
    1882                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1883                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$149       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$149, DW_AT_name("INTx11")
    1888                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_INTx11")
    1889                      .dwattr $C$DW$149, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1890                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1891                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1892              $C$DW$150       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$150, DW_AT_name("INTx12")
    1895                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_INTx12")
    1896                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1897                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$151       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$151, DW_AT_name("INTx13")
    1902                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_INTx13")
    1903                      .dwattr $C$DW$151, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1904                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1906              $C$DW$152       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1908                      .dwattr $C$DW$152, DW_AT_name("INTx14")
    1909                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INTx14")
    1910                      .dwattr $C$DW$152, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   37

    1911                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1913              $C$DW$153       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$153, DW_AT_name("INTx15")
    1916                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_INTx15")
    1917                      .dwattr $C$DW$153, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1918                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$154       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1922                      .dwattr $C$DW$154, DW_AT_name("INTx16")
    1923                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_INTx16")
    1924                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1926                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1927                      .dwendtag $C$DW$T$32
    1928              
    1929              
    1930              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1931                      .dwattr $C$DW$T$33, DW_AT_name("PIEIER2_REG")
    1932                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1933              $C$DW$155       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1935                      .dwattr $C$DW$155, DW_AT_name("all")
    1936                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    1937                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$156       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
    1941                      .dwattr $C$DW$156, DW_AT_name("bit")
    1942                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    1943                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1945                      .dwendtag $C$DW$T$33
    1946              
    1947              
    1948              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1949                      .dwattr $C$DW$T$34, DW_AT_name("PIEIER3_BITS")
    1950                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1951              $C$DW$157       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1953                      .dwattr $C$DW$157, DW_AT_name("INTx1")
    1954                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_INTx1")
    1955                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1956                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1957                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1958              $C$DW$158       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1960                      .dwattr $C$DW$158, DW_AT_name("INTx2")
    1961                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_INTx2")
    1962                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1963                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1965              $C$DW$159       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   38

    1966                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$159, DW_AT_name("INTx3")
    1968                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_INTx3")
    1969                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1970                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1971                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1972              $C$DW$160       .dwtag  DW_TAG_member
    1973                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1974                      .dwattr $C$DW$160, DW_AT_name("INTx4")
    1975                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_INTx4")
    1976                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1977                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1979              $C$DW$161       .dwtag  DW_TAG_member
    1980                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1981                      .dwattr $C$DW$161, DW_AT_name("INTx5")
    1982                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_INTx5")
    1983                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1984                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1985                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1986              $C$DW$162       .dwtag  DW_TAG_member
    1987                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1988                      .dwattr $C$DW$162, DW_AT_name("INTx6")
    1989                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_INTx6")
    1990                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1991                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1993              $C$DW$163       .dwtag  DW_TAG_member
    1994                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1995                      .dwattr $C$DW$163, DW_AT_name("INTx7")
    1996                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_INTx7")
    1997                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1998                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1999                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$164       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2002                      .dwattr $C$DW$164, DW_AT_name("INTx8")
    2003                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_INTx8")
    2004                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2005                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$165       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2009                      .dwattr $C$DW$165, DW_AT_name("INTx9")
    2010                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_INTx9")
    2011                      .dwattr $C$DW$165, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2012                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2013                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2014              $C$DW$166       .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2016                      .dwattr $C$DW$166, DW_AT_name("INTx10")
    2017                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_INTx10")
    2018                      .dwattr $C$DW$166, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2019                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2020                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   39

    2021              $C$DW$167       .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2023                      .dwattr $C$DW$167, DW_AT_name("INTx11")
    2024                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INTx11")
    2025                      .dwattr $C$DW$167, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2026                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2027                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2028              $C$DW$168       .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2030                      .dwattr $C$DW$168, DW_AT_name("INTx12")
    2031                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_INTx12")
    2032                      .dwattr $C$DW$168, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2033                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2034                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2035              $C$DW$169       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2037                      .dwattr $C$DW$169, DW_AT_name("INTx13")
    2038                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_INTx13")
    2039                      .dwattr $C$DW$169, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2040                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$170       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$170, DW_AT_name("INTx14")
    2045                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_INTx14")
    2046                      .dwattr $C$DW$170, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2047                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$171       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2051                      .dwattr $C$DW$171, DW_AT_name("INTx15")
    2052                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_INTx15")
    2053                      .dwattr $C$DW$171, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2054                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2055                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2056              $C$DW$172       .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2058                      .dwattr $C$DW$172, DW_AT_name("INTx16")
    2059                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTx16")
    2060                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2061                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2063                      .dwendtag $C$DW$T$34
    2064              
    2065              
    2066              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2067                      .dwattr $C$DW$T$35, DW_AT_name("PIEIER3_REG")
    2068                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2069              $C$DW$173       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$173, DW_AT_name("all")
    2072                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    2073                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2075              $C$DW$174       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   40

    2076                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$34)
    2077                      .dwattr $C$DW$174, DW_AT_name("bit")
    2078                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    2079                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2081                      .dwendtag $C$DW$T$35
    2082              
    2083              
    2084              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2085                      .dwattr $C$DW$T$36, DW_AT_name("PIEIER4_BITS")
    2086                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2087              $C$DW$175       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$175, DW_AT_name("INTx1")
    2090                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTx1")
    2091                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2092                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$176       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2096                      .dwattr $C$DW$176, DW_AT_name("INTx2")
    2097                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_INTx2")
    2098                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$177       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$177, DW_AT_name("INTx3")
    2104                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_INTx3")
    2105                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2106                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$178       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$178, DW_AT_name("INTx4")
    2111                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_INTx4")
    2112                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$179       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2117                      .dwattr $C$DW$179, DW_AT_name("INTx5")
    2118                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_INTx5")
    2119                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2120                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$180       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$180, DW_AT_name("INTx6")
    2125                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_INTx6")
    2126                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2127                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$181       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   41

    2131                      .dwattr $C$DW$181, DW_AT_name("INTx7")
    2132                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTx7")
    2133                      .dwattr $C$DW$181, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$182       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2138                      .dwattr $C$DW$182, DW_AT_name("INTx8")
    2139                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTx8")
    2140                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2141                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2143              $C$DW$183       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$183, DW_AT_name("INTx9")
    2146                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_INTx9")
    2147                      .dwattr $C$DW$183, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2148                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2149                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$184       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$184, DW_AT_name("INTx10")
    2153                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_INTx10")
    2154                      .dwattr $C$DW$184, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2155                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2157              $C$DW$185       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$185, DW_AT_name("INTx11")
    2160                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_INTx11")
    2161                      .dwattr $C$DW$185, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2162                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2163                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$186       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$186, DW_AT_name("INTx12")
    2167                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_INTx12")
    2168                      .dwattr $C$DW$186, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2169                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2171              $C$DW$187       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2173                      .dwattr $C$DW$187, DW_AT_name("INTx13")
    2174                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_INTx13")
    2175                      .dwattr $C$DW$187, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2176                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$188       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2180                      .dwattr $C$DW$188, DW_AT_name("INTx14")
    2181                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_INTx14")
    2182                      .dwattr $C$DW$188, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2183                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2185              $C$DW$189       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   42

    2186                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$189, DW_AT_name("INTx15")
    2188                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_INTx15")
    2189                      .dwattr $C$DW$189, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2190                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2191                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$190       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$190, DW_AT_name("INTx16")
    2195                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTx16")
    2196                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2199                      .dwendtag $C$DW$T$36
    2200              
    2201              
    2202              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2203                      .dwattr $C$DW$T$37, DW_AT_name("PIEIER4_REG")
    2204                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2205              $C$DW$191       .dwtag  DW_TAG_member
    2206                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2207                      .dwattr $C$DW$191, DW_AT_name("all")
    2208                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    2209                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2210                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2211              $C$DW$192       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$36)
    2213                      .dwattr $C$DW$192, DW_AT_name("bit")
    2214                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    2215                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2216                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2217                      .dwendtag $C$DW$T$37
    2218              
    2219              
    2220              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2221                      .dwattr $C$DW$T$38, DW_AT_name("PIEIER5_BITS")
    2222                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2223              $C$DW$193       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2225                      .dwattr $C$DW$193, DW_AT_name("INTx1")
    2226                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx1")
    2227                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2228                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$194       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$194, DW_AT_name("INTx2")
    2233                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx2")
    2234                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2235                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2236                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2237              $C$DW$195       .dwtag  DW_TAG_member
    2238                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2239                      .dwattr $C$DW$195, DW_AT_name("INTx3")
    2240                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx3")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:49 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
interrupt.asm                                                        PAGE   43

    2241                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2242                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2244              $C$DW$196       .dwtag  DW_TAG_member
    2245                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2246                      .dwattr $C$DW$196, DW_AT_name("INTx4")
    2247                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx4")
    2248                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2249                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2250                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2251              $C$DW$197       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$197, DW_AT_name("INTx5")
    2254                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx5")
    2255                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2256                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2258              $C$DW$198       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$198, DW_AT_name("INTx6")
    2261                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx6")
    2262                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2263                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$199       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$199, DW_AT_name("INTx7")
