TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Motor_ctrl.asm                                                       PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:36:44 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../motors/Motor_ctrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("abs")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_abs")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)

     285                      .dwendtag $C$DW$7
     286              
     287              
     288              ;***************************************************************
     289              ;* TYPE INFORMATION                                            *
     290              ;***************************************************************
     291              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     292                      .dwattr $C$DW$T$2, DW_AT_name("void")
     293              $C$DW$T$4       .dwtag  DW_TAG_base_type
     294                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     295                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     296                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     297              $C$DW$T$5       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Motor_ctrl.asm                                                       PAGE    7

     298                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     299                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     300                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     301              $C$DW$T$6       .dwtag  DW_TAG_base_type
     302                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     303                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     304                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     305              $C$DW$T$7       .dwtag  DW_TAG_base_type
     306                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     307                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     308                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     309              $C$DW$T$8       .dwtag  DW_TAG_base_type
     310                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     311                      .dwattr $C$DW$T$8, DW_AT_name("short")
     312                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     313              $C$DW$T$9       .dwtag  DW_TAG_base_type
     314                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     315                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     316                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     317              $C$DW$T$10      .dwtag  DW_TAG_base_type
     318                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     319                      .dwattr $C$DW$T$10, DW_AT_name("int")
     320                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     321              $C$DW$T$11      .dwtag  DW_TAG_base_type
     322                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     323                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     324                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     325              $C$DW$T$12      .dwtag  DW_TAG_base_type
     326                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     327                      .dwattr $C$DW$T$12, DW_AT_name("long")
     328                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     329              $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("_iq15")
     330                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$12)
     331                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     332              $C$DW$T$13      .dwtag  DW_TAG_base_type
     333                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     334                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     335                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
     336              $C$DW$T$14      .dwtag  DW_TAG_base_type
     337                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     338                      .dwattr $C$DW$T$14, DW_AT_name("long long")
     339                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
     340              $C$DW$T$15      .dwtag  DW_TAG_base_type
     341                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     342                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     343                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
     344              $C$DW$T$16      .dwtag  DW_TAG_base_type
     345                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     346                      .dwattr $C$DW$T$16, DW_AT_name("float")
     347                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
     348              $C$DW$T$17      .dwtag  DW_TAG_base_type
     349                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     350                      .dwattr $C$DW$T$17, DW_AT_name("double")
     351                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
     352              $C$DW$T$18      .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Motor_ctrl.asm                                                       PAGE    8

     353                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     354                      .dwattr $C$DW$T$18, DW_AT_name("long double")
     355                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
     356              
     357              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     358                      .dwattr $C$DW$T$19, DW_AT_name("piCtrl_t")
     359                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x14)
     360              $C$DW$12        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$16)
     362                      .dwattr $C$DW$12, DW_AT_name("ref")
     363                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_ref")
     364                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     365                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     366              $C$DW$13        .dwtag  DW_TAG_member
     367                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$16)
     368                      .dwattr $C$DW$13, DW_AT_name("fbk")
     369                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_fbk")
     370                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     371                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     372              $C$DW$14        .dwtag  DW_TAG_member
     373                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$16)
     374                      .dwattr $C$DW$14, DW_AT_name("e")
     375                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_e")
     376                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     377                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     378              $C$DW$15        .dwtag  DW_TAG_member
     379                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$16)
     380                      .dwattr $C$DW$15, DW_AT_name("e0")
     381                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_e0")
     382                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     383                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     384              $C$DW$16        .dwtag  DW_TAG_member
     385                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$16)
     386                      .dwattr $C$DW$16, DW_AT_name("u")
     387                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_u")
     388                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     389                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     390              $C$DW$17        .dwtag  DW_TAG_member
     391                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$16)
     392                      .dwattr $C$DW$17, DW_AT_name("u0")
     393                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_u0")
     394                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     395                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     396              $C$DW$18        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$16)
     398                      .dwattr $C$DW$18, DW_AT_name("uMin")
     399                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_uMin")
     400                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     401                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     402              $C$DW$19        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$16)
     404                      .dwattr $C$DW$19, DW_AT_name("uMax")
     405                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_uMax")
     406                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     407                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Motor_ctrl.asm                                                       PAGE    9

     408              $C$DW$20        .dwtag  DW_TAG_member
     409                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$16)
     410                      .dwattr $C$DW$20, DW_AT_name("c0")
     411                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_c0")
     412                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     413                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     414              $C$DW$21        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$16)
     416                      .dwattr $C$DW$21, DW_AT_name("c1")
     417                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_c1")
     418                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     419                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     420                      .dwendtag $C$DW$T$19
     421              
     422              $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     423                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
     424                      .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     425              
     426              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     427                      .dwattr $C$DW$T$21, DW_AT_name("rateLim_t")
     428                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x06)
     429              $C$DW$22        .dwtag  DW_TAG_member
     430                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     431                      .dwattr $C$DW$22, DW_AT_name("in")
     432                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_in")
     433                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     434                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     435              $C$DW$23        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     437                      .dwattr $C$DW$23, DW_AT_name("out")
     438                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_out")
     439                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     440                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     441              $C$DW$24        .dwtag  DW_TAG_member
     442                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$20)
     443                      .dwattr $C$DW$24, DW_AT_name("slope")
     444                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_slope")
     445                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     446                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     447                      .dwendtag $C$DW$T$21
     448              
     449              $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     450                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
     451                      .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     452                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
     453              
     454              ;***************************************************************
     455              ;* DWARF CIE ENTRIES                                           *
     456              ;***************************************************************
     457              
     458              $C$DW$CIE       .dwcie 26
     459                      .dwcfi  cfa_register, 20
     460                      .dwcfi  cfa_offset, 0
     461                      .dwcfi  undefined, 0
     462                      .dwcfi  undefined, 1
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:36:44 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Motor_ctrl.asm                                                       PAGE   10

     463                      .dwcfi  undefined, 2
     464                      .dwcfi  undefined, 3
     465                      .dwcfi  undefined, 20
     466                      .dwcfi  undefined, 21
     467                      .dwcfi  undefined, 22
     468                      .dwcfi  undefined, 23
     469                      .dwcfi  undefined, 24
     470                      .dwcfi  undefined, 25
     471                      .dwcfi  undefined, 26
     472                      .dwcfi  same_value, 28
     473                      .dwcfi  undefined, 29
     474                      .dwcfi  undefined, 30
     475                      .dwcfi  undefined, 31
     476                      .dwcfi  undefined, 32
     477                      .dwcfi  undefined, 33
     478                      .dwcfi  undefined, 34
     479                      .dwcfi  undefined, 35
     480                      .dwcfi  undefined, 36
     481                      .dwcfi  undefined, 37
     482                      .dwcfi  undefined, 38
     483                      .dwcfi  undefined, 75
     484                      .dwcfi  undefined, 76
     485                      .dwcfi  undefined, 77
     486                      .dwcfi  undefined, 4
     487                      .dwcfi  undefined, 5
     488                      .dwcfi  same_value, 6
     489                      .dwcfi  same_value, 7
     490                      .dwcfi  same_value, 8
     491                      .dwcfi  same_value, 9
     492                      .dwcfi  same_value, 10
     493                      .dwcfi  same_value, 11
     494                      .dwcfi  undefined, 12
     495                      .dwcfi  undefined, 13
     496                      .dwcfi  undefined, 14
     497                      .dwcfi  undefined, 15
     498                      .dwcfi  undefined, 16
     499                      .dwcfi  undefined, 17
     500                      .dwcfi  undefined, 18
     501                      .dwcfi  undefined, 19
     502                      .dwcfi  undefined, 43
     503                      .dwcfi  undefined, 44
     504                      .dwcfi  undefined, 47
     505                      .dwcfi  undefined, 48
     506                      .dwcfi  undefined, 51
     507                      .dwcfi  undefined, 52
     508                      .dwcfi  undefined, 55
     509                      .dwcfi  undefined, 56
     510                      .dwcfi  same_value, 59
     511                      .dwcfi  same_value, 60
     512                      .dwcfi  same_value, 63
     513                      .dwcfi  same_value, 64
     514                      .dwcfi  same_value, 67
