TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:27:09 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/pwm_servo.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

     496              $C$DW$37        .dwtag  DW_TAG_subprogram, DW_AT_name("pwm_servo_set_duty_time")
     497                      .dwattr $C$DW$37, DW_AT_low_pc(_pwm_servo_set_duty_time)
     498                      .dwattr $C$DW$37, DW_AT_high_pc(0x00)
     499                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_pwm_servo_set_duty_time")
     500                      .dwattr $C$DW$37, DW_AT_TI_begin_file("../Source/App/pwm_servo.c")
     501                      .dwattr $C$DW$37, DW_AT_TI_begin_line(0x53)
     502                      .dwattr $C$DW$37, DW_AT_TI_begin_column(0x0d)
     503                      .dwattr $C$DW$37, DW_AT_TI_max_frame_size(-4)
     504                      .dwpsn  file "../Source/App/pwm_servo.c",line 83,column 52,is_stmt,address _pwm_servo_set_duty_time,i
     505              
     506                      .dwfde $C$DW$CIE, _pwm_servo_set_duty_time
     507              $C$DW$38        .dwtag  DW_TAG_formal_parameter, DW_AT_name("time")
     508                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_time")
     509                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$225)
     510                      .dwattr $C$DW$38, DW_AT_location[DW_OP_reg0]
     511              
     512              ;***************************************************************
     513              ;* FNAME: _pwm_servo_set_duty_time      FR SIZE:   2           *
     514              ;*                                                             *
     515              ;* FUNCTION ENVIRONMENT                                        *
     516              ;*                                                             *
     517              ;* FUNCTION PROPERTIES                                         *
     518              ;*                            0 Parameter,  1 Auto,  0 SOE     *
     519              ;***************************************************************
     520              
     521 000000b8       _pwm_servo_set_duty_time:
     522                      .dwcfi  cfa_offset, -2
     523                      .dwcfi  save_reg_to_mem, 26, 0
     524 000000b8 FE02          ADDB      SP,#2                 ; [CPU_U] 
     525                      .dwcfi  cfa_offset, -4
     526              $C$DW$39        .dwtag  DW_TAG_variable, DW_AT_name("time")
     527                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_time")
     528                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$225)
     529                      .dwattr $C$DW$39, DW_AT_location[DW_OP_breg20 -1]
     530 000000b9 9641          MOV       *-SP[1],AL            ; [CPU_] |83| 
     531                      .dwpsn  file "../Source/App/pwm_servo.c",line 84,column 2,is_stmt,isa 0
     532 000000ba 5603          MOV       ACC,*-SP[1] << #2     ; [CPU_] |84| 
         000000bb 0241 
     533 000000bc 9641          MOV       *-SP[1],AL            ; [CPU_] |84| 
     534                      .dwpsn  file "../Source/App/pwm_servo.c",line 85,column 2,is_stmt,isa 0
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   12

     535 000000bd 1BA9          CMP       AL,#8000              ; [CPU_] |85| 
         000000be 1F40 
     536 000000bf 56C7          BF        $C$L3,HIS             ; [CPU_] |85| 
         000000c0 0005 
     537                      ; branchcc occurs ; [] |85| 
     538                      .dwpsn  file "../Source/App/pwm_servo.c",line 86,column 3,is_stmt,isa 0
     539 000000c1 761F!         MOVW      DP,#_EPwm3Regs+107    ; [CPU_U] 
         000000c2 0001 
     540 000000c3 962B!         MOV       @_EPwm3Regs+107,AL    ; [CPU_] |86| 
     541                      .dwpsn  file "../Source/App/pwm_servo.c",line 91,column 1,is_stmt,isa 0
     542 000000c4       $C$L3:    
     543 000000c4 FE82          SUBB      SP,#2                 ; [CPU_U] 
     544                      .dwcfi  cfa_offset, -2
     545              $C$DW$40        .dwtag  DW_TAG_TI_branch
     546                      .dwattr $C$DW$40, DW_AT_low_pc(0x00)
     547                      .dwattr $C$DW$40, DW_AT_TI_return
     548 000000c5 0006          LRETR     ; [CPU_] 
     549                      ; return occurs ; [] 
     550                      .dwattr $C$DW$37, DW_AT_TI_end_file("../Source/App/pwm_servo.c")
     551                      .dwattr $C$DW$37, DW_AT_TI_end_line(0x5b)
     552                      .dwattr $C$DW$37, DW_AT_TI_end_column(0x01)
     553                      .dwendentry
     554                      .dwendtag $C$DW$37
     555              
     556              ;**************************************************************
     557              ;* UNDEFINED EXTERNAL REFERENCES                              *
     558              ;**************************************************************
     559                      .global _GPIO_SetupPinOptions
     560                      .global _GPIO_SetupPinMux
     561                      .global _get_angle_multiplier
     562                      .global _get_time_angle_zero
     563                      .global _CpuSysRegs
     564                      .global _EPwm3Regs
     565              
     566              ;***************************************************************
     567              ;* TYPE INFORMATION                                            *
     568              ;***************************************************************
     569              
     570              $C$DW$T$19      .dwtag  DW_TAG_structure_type
     571                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
     572              $C$DW$41        .dwtag  DW_TAG_member
     573                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$16)
     574                      .dwattr $C$DW$41, DW_AT_name("angle_ref")
     575                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_angle_ref")
     576                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     578              $C$DW$42        .dwtag  DW_TAG_member
     579                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$16)
     580                      .dwattr $C$DW$42, DW_AT_name("angle_act")
     581                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_angle_act")
     582                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     583                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     584              $C$DW$43        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$16)
     586                      .dwattr $C$DW$43, DW_AT_name("dt")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   13

     587                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_dt")
     588                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     589                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     590              $C$DW$44        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$16)
     592                      .dwattr $C$DW$44, DW_AT_name("ramp")
     593                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_ramp")
     594                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     595                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     596                      .dwendtag $C$DW$T$19
     597              
     598              $C$DW$T$207     .dwtag  DW_TAG_typedef, DW_AT_name("servo_ramper_t")
     599                      .dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
     601              
     602              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     603                      .dwattr $C$DW$T$21, DW_AT_name("AQCSFRC_BITS")
     604                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     605              $C$DW$45        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
     607                      .dwattr $C$DW$45, DW_AT_name("CSFA")
     608                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_CSFA")
     609                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     610                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$46        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     614                      .dwattr $C$DW$46, DW_AT_name("CSFB")
     615                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_CSFB")
     616                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     617                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$47        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     621                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     622                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     623                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     624                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     626                      .dwendtag $C$DW$T$21
     627              
     628              
     629              $C$DW$T$22      .dwtag  DW_TAG_union_type
     630                      .dwattr $C$DW$T$22, DW_AT_name("AQCSFRC_REG")
     631                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     632              $C$DW$48        .dwtag  DW_TAG_member
     633                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     634                      .dwattr $C$DW$48, DW_AT_name("all")
     635                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_all")
     636                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$49        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     640                      .dwattr $C$DW$49, DW_AT_name("bit")
     641                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   14

     642                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     644                      .dwendtag $C$DW$T$22
     645              
     646              
     647              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     648                      .dwattr $C$DW$T$23, DW_AT_name("AQCTLA2_BITS")
     649                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     650              $C$DW$50        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
     652                      .dwattr $C$DW$50, DW_AT_name("T1U")
     653                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_T1U")
     654                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     655                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     656                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     657              $C$DW$51        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$20)
     659                      .dwattr $C$DW$51, DW_AT_name("T1D")
     660                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_T1D")
     661                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     662                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     664              $C$DW$52        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     666                      .dwattr $C$DW$52, DW_AT_name("T2U")
     667                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_T2U")
     668                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     669                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     671              $C$DW$53        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     673                      .dwattr $C$DW$53, DW_AT_name("T2D")
     674                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_T2D")
     675                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     676                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     678              $C$DW$54        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     680                      .dwattr $C$DW$54, DW_AT_name("rsvd1")
     681                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd1")
     682                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     683                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     685                      .dwendtag $C$DW$T$23
     686              
     687              
     688              $C$DW$T$24      .dwtag  DW_TAG_union_type
     689                      .dwattr $C$DW$T$24, DW_AT_name("AQCTLA2_REG")
     690                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     691              $C$DW$55        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
     693                      .dwattr $C$DW$55, DW_AT_name("all")
     694                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     695                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   15

     697              $C$DW$56        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$23)
     699                      .dwattr $C$DW$56, DW_AT_name("bit")
     700                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     701                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     703                      .dwendtag $C$DW$T$24
     704              
     705              
     706              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     707                      .dwattr $C$DW$T$25, DW_AT_name("AQCTLA_BITS")
     708                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     709              $C$DW$57        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     711                      .dwattr $C$DW$57, DW_AT_name("ZRO")
     712                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ZRO")
     713                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     714                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     716              $C$DW$58        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     718                      .dwattr $C$DW$58, DW_AT_name("PRD")
     719                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PRD")
     720                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     721                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     723              $C$DW$59        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     725                      .dwattr $C$DW$59, DW_AT_name("CAU")
     726                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CAU")
     727                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     728                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     730              $C$DW$60        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     732                      .dwattr $C$DW$60, DW_AT_name("CAD")
     733                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CAD")
     734                      .dwattr $C$DW$60, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     735                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     737              $C$DW$61        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
     739                      .dwattr $C$DW$61, DW_AT_name("CBU")
     740                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CBU")
     741                      .dwattr $C$DW$61, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     742                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     744              $C$DW$62        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     746                      .dwattr $C$DW$62, DW_AT_name("CBD")
     747                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_CBD")
     748                      .dwattr $C$DW$62, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     749                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$63        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   16

     752                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
     753                      .dwattr $C$DW$63, DW_AT_name("rsvd1")
     754                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd1")
     755                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     756                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     758                      .dwendtag $C$DW$T$25
     759              
     760              
     761              $C$DW$T$26      .dwtag  DW_TAG_union_type
     762                      .dwattr $C$DW$T$26, DW_AT_name("AQCTLA_REG")
     763                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     764              $C$DW$64        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     766                      .dwattr $C$DW$64, DW_AT_name("all")
     767                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
     768                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$65        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$25)
     772                      .dwattr $C$DW$65, DW_AT_name("bit")
     773                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
     774                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     775                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     776                      .dwendtag $C$DW$T$26
     777              
     778              
     779              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     780                      .dwattr $C$DW$T$27, DW_AT_name("AQCTLB2_BITS")
     781                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     782              $C$DW$66        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
     784                      .dwattr $C$DW$66, DW_AT_name("T1U")
     785                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_T1U")
     786                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     787                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     789              $C$DW$67        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
     791                      .dwattr $C$DW$67, DW_AT_name("T1D")
     792                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_T1D")
     793                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     794                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     796              $C$DW$68        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
     798                      .dwattr $C$DW$68, DW_AT_name("T2U")
     799                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_T2U")
     800                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     801                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$69        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
     805                      .dwattr $C$DW$69, DW_AT_name("T2D")
     806                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_T2D")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   17

     807                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     808                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     810              $C$DW$70        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
     812                      .dwattr $C$DW$70, DW_AT_name("rsvd1")
     813                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd1")
     814                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     815                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     817                      .dwendtag $C$DW$T$27
     818              
     819              
     820              $C$DW$T$28      .dwtag  DW_TAG_union_type
     821                      .dwattr $C$DW$T$28, DW_AT_name("AQCTLB2_REG")
     822                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     823              $C$DW$71        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
     825                      .dwattr $C$DW$71, DW_AT_name("all")
     826                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
     827                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     828                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$72        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
     831                      .dwattr $C$DW$72, DW_AT_name("bit")
     832                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
     833                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     835                      .dwendtag $C$DW$T$28
     836              
     837              
     838              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     839                      .dwattr $C$DW$T$29, DW_AT_name("AQCTLB_BITS")
     840                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     841              $C$DW$73        .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
     843                      .dwattr $C$DW$73, DW_AT_name("ZRO")
     844                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_ZRO")
     845                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     846                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     848              $C$DW$74        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
     850                      .dwattr $C$DW$74, DW_AT_name("PRD")
     851                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PRD")
     852                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     853                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     855              $C$DW$75        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
     857                      .dwattr $C$DW$75, DW_AT_name("CAU")
     858                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_CAU")
     859                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     860                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   18

     862              $C$DW$76        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
     864                      .dwattr $C$DW$76, DW_AT_name("CAD")
     865                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CAD")
     866                      .dwattr $C$DW$76, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     867                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     869              $C$DW$77        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
     871                      .dwattr $C$DW$77, DW_AT_name("CBU")
     872                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CBU")
     873                      .dwattr $C$DW$77, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     874                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     876              $C$DW$78        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
     878                      .dwattr $C$DW$78, DW_AT_name("CBD")
     879                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_CBD")
     880                      .dwattr $C$DW$78, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     881                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$79        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
     885                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
     886                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
     887                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     888                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     890                      .dwendtag $C$DW$T$29
     891              
     892              
     893              $C$DW$T$30      .dwtag  DW_TAG_union_type
     894                      .dwattr $C$DW$T$30, DW_AT_name("AQCTLB_REG")
     895                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     896              $C$DW$80        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
     898                      .dwattr $C$DW$80, DW_AT_name("all")
     899                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     900                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$81        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$29)
     904                      .dwattr $C$DW$81, DW_AT_name("bit")
     905                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     906                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     908                      .dwendtag $C$DW$T$30
     909              
     910              
     911              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     912                      .dwattr $C$DW$T$31, DW_AT_name("AQCTL_BITS")
     913                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     914              $C$DW$82        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
     916                      .dwattr $C$DW$82, DW_AT_name("LDAQAMODE")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   19

     917                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_LDAQAMODE")
     918                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     919                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$83        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
     923                      .dwattr $C$DW$83, DW_AT_name("LDAQBMODE")
     924                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_LDAQBMODE")
     925                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     926                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$84        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     930                      .dwattr $C$DW$84, DW_AT_name("SHDWAQAMODE")
     931                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SHDWAQAMODE")
     932                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$85        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     937                      .dwattr $C$DW$85, DW_AT_name("rsvd1")
     938                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd1")
     939                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     940                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$86        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
     944                      .dwattr $C$DW$86, DW_AT_name("SHDWAQBMODE")
     945                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SHDWAQBMODE")
     946                      .dwattr $C$DW$86, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$87        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
     951                      .dwattr $C$DW$87, DW_AT_name("rsvd2")
     952                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd2")
     953                      .dwattr $C$DW$87, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     954                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$88        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
     958                      .dwattr $C$DW$88, DW_AT_name("LDAQASYNC")
     959                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_LDAQASYNC")
     960                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     961                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$89        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
     965                      .dwattr $C$DW$89, DW_AT_name("LDAQBSYNC")
     966                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_LDAQBSYNC")
     967                      .dwattr $C$DW$89, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     968                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     970              $C$DW$90        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   20

     972                      .dwattr $C$DW$90, DW_AT_name("rsvd3")
     973                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd3")
     974                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     975                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     977                      .dwendtag $C$DW$T$31
     978              
     979              
     980              $C$DW$T$32      .dwtag  DW_TAG_union_type
     981                      .dwattr $C$DW$T$32, DW_AT_name("AQCTL_REG")
     982                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     983              $C$DW$91        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
     985                      .dwattr $C$DW$91, DW_AT_name("all")
     986                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
     987                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$92        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$31)
     991                      .dwattr $C$DW$92, DW_AT_name("bit")
     992                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
     993                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     995                      .dwendtag $C$DW$T$32
     996              
     997              
     998              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     999                      .dwattr $C$DW$T$33, DW_AT_name("AQSFRC_BITS")
    1000                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1001              $C$DW$93        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$20)
    1003                      .dwattr $C$DW$93, DW_AT_name("ACTSFA")
    1004                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ACTSFA")
    1005                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1006                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1008              $C$DW$94        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$20)
    1010                      .dwattr $C$DW$94, DW_AT_name("OTSFA")
    1011                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_OTSFA")
    1012                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$95        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    1017                      .dwattr $C$DW$95, DW_AT_name("ACTSFB")
    1018                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ACTSFB")
    1019                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x02)
    1020                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$96        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    1024                      .dwattr $C$DW$96, DW_AT_name("OTSFB")
    1025                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_OTSFB")
    1026                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   21

    1027                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$97        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    1031                      .dwattr $C$DW$97, DW_AT_name("RLDCSF")
    1032                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RLDCSF")
    1033                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1034                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$98        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    1038                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
    1039                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
    1040                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1041                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1043                      .dwendtag $C$DW$T$33
    1044              
    1045              
    1046              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1047                      .dwattr $C$DW$T$34, DW_AT_name("AQSFRC_REG")
    1048                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1049              $C$DW$99        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1051                      .dwattr $C$DW$99, DW_AT_name("all")
    1052                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    1053                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1055              $C$DW$100       .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$33)
    1057                      .dwattr $C$DW$100, DW_AT_name("bit")
    1058                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    1059                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1061                      .dwendtag $C$DW$T$34
    1062              
    1063              
    1064              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1065                      .dwattr $C$DW$T$35, DW_AT_name("AQTSRCSEL_BITS")
    1066                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1067              $C$DW$101       .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    1069                      .dwattr $C$DW$101, DW_AT_name("T1SEL")
    1070                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_T1SEL")
    1071                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1072                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1073                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1074              $C$DW$102       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
    1076                      .dwattr $C$DW$102, DW_AT_name("T2SEL")
    1077                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_T2SEL")
    1078                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1079                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$103       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   22

    1082                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
    1083                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
    1084                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
    1085                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1086                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1087                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1088                      .dwendtag $C$DW$T$35
    1089              
    1090              
    1091              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1092                      .dwattr $C$DW$T$36, DW_AT_name("AQTSRCSEL_REG")
    1093                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1094              $C$DW$104       .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
    1096                      .dwattr $C$DW$104, DW_AT_name("all")
    1097                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1098                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1100              $C$DW$105       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$35)
    1102                      .dwattr $C$DW$105, DW_AT_name("bit")
    1103                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1104                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1106                      .dwendtag $C$DW$T$36
    1107              
    1108              
    1109              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1110                      .dwattr $C$DW$T$37, DW_AT_name("CMPA_BITS")
    1111                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1112              $C$DW$106       .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
    1114                      .dwattr $C$DW$106, DW_AT_name("CMPAHR")
    1115                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_CMPAHR")
    1116                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1117                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$107       .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1121                      .dwattr $C$DW$107, DW_AT_name("CMPA")
    1122                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CMPA")
    1123                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1124                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1125                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1126                      .dwendtag $C$DW$T$37
    1127              
    1128              
    1129              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1130                      .dwattr $C$DW$T$39, DW_AT_name("CMPA_REG")
    1131                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1132              $C$DW$108       .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$38)
    1134                      .dwattr $C$DW$108, DW_AT_name("all")
    1135                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    1136                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   23

    1137                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$109       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$37)
    1140                      .dwattr $C$DW$109, DW_AT_name("bit")
    1141                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    1142                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1144                      .dwendtag $C$DW$T$39
    1145              
    1146              
    1147              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1148                      .dwattr $C$DW$T$40, DW_AT_name("CMPB_BITS")
    1149                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1150              $C$DW$110       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1152                      .dwattr $C$DW$110, DW_AT_name("CMPBHR")
    1153                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_CMPBHR")
    1154                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1155                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1156                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1157              $C$DW$111       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$20)
    1159                      .dwattr $C$DW$111, DW_AT_name("CMPB")
    1160                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_CMPB")
    1161                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1162                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1163                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1164                      .dwendtag $C$DW$T$40
    1165              
    1166              
    1167              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1168                      .dwattr $C$DW$T$41, DW_AT_name("CMPB_REG")
    1169                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1170              $C$DW$112       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$38)
    1172                      .dwattr $C$DW$112, DW_AT_name("all")
    1173                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1174                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$113       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$40)
    1178                      .dwattr $C$DW$113, DW_AT_name("bit")
    1179                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1180                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1182                      .dwendtag $C$DW$T$41
    1183              
    1184              
    1185              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1186                      .dwattr $C$DW$T$42, DW_AT_name("CMPCTL2_BITS")
    1187                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1188              $C$DW$114       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1190                      .dwattr $C$DW$114, DW_AT_name("LOADCMODE")
    1191                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_LOADCMODE")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   24

    1192                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1193                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$115       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1197                      .dwattr $C$DW$115, DW_AT_name("LOADDMODE")
    1198                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_LOADDMODE")
    1199                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1200                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1202              $C$DW$116       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1204                      .dwattr $C$DW$116, DW_AT_name("SHDWCMODE")
    1205                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_SHDWCMODE")
    1206                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1207                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$117       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$20)
    1211                      .dwattr $C$DW$117, DW_AT_name("rsvd1")
    1212                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd1")
    1213                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$118       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$20)
    1218                      .dwattr $C$DW$118, DW_AT_name("SHDWDMODE")
    1219                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SHDWDMODE")
    1220                      .dwattr $C$DW$118, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1221                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$119       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1225                      .dwattr $C$DW$119, DW_AT_name("rsvd2")
    1226                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd2")
    1227                      .dwattr $C$DW$119, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x03)
    1228                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$120       .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    1232                      .dwattr $C$DW$120, DW_AT_name("LOADCSYNC")
    1233                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_LOADCSYNC")
    1234                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1235                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$121       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1239                      .dwattr $C$DW$121, DW_AT_name("LOADDSYNC")
    1240                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_LOADDSYNC")
    1241                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1242                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$122       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1246                      .dwattr $C$DW$122, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   25

    1247                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd3")
    1248                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1249                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1251                      .dwendtag $C$DW$T$42
    1252              
    1253              
    1254              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1255                      .dwattr $C$DW$T$43, DW_AT_name("CMPCTL2_REG")
    1256                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1257              $C$DW$123       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1259                      .dwattr $C$DW$123, DW_AT_name("all")
    1260                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    1261                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$124       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$42)
    1265                      .dwattr $C$DW$124, DW_AT_name("bit")
    1266                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    1267                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1269                      .dwendtag $C$DW$T$43
    1270              
    1271              
    1272              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1273                      .dwattr $C$DW$T$44, DW_AT_name("CMPCTL_BITS")
    1274                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1275              $C$DW$125       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1277                      .dwattr $C$DW$125, DW_AT_name("LOADAMODE")
    1278                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_LOADAMODE")
    1279                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1280                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$126       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1284                      .dwattr $C$DW$126, DW_AT_name("LOADBMODE")
    1285                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_LOADBMODE")
    1286                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1287                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$127       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1291                      .dwattr $C$DW$127, DW_AT_name("SHDWAMODE")
    1292                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_SHDWAMODE")
    1293                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$128       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1298                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1299                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1300                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1301                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   26

    1302                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$129       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1305                      .dwattr $C$DW$129, DW_AT_name("SHDWBMODE")
    1306                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_SHDWBMODE")
    1307                      .dwattr $C$DW$129, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1308                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1309                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$130       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1312                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    1313                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    1314                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1316                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$131       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1319                      .dwattr $C$DW$131, DW_AT_name("SHDWAFULL")
    1320                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SHDWAFULL")
    1321                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1322                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$132       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1326                      .dwattr $C$DW$132, DW_AT_name("SHDWBFULL")
    1327                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SHDWBFULL")
    1328                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$133       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1333                      .dwattr $C$DW$133, DW_AT_name("LOADASYNC")
    1334                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_LOADASYNC")
    1335                      .dwattr $C$DW$133, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1336                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$134       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1340                      .dwattr $C$DW$134, DW_AT_name("LOADBSYNC")
    1341                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_LOADBSYNC")
    1342                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1343                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$135       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1347                      .dwattr $C$DW$135, DW_AT_name("rsvd3")
    1348                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd3")
    1349                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1350                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1352                      .dwendtag $C$DW$T$44
    1353              
    1354              
    1355              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1356                      .dwattr $C$DW$T$45, DW_AT_name("CMPCTL_REG")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   27

    1357                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1358              $C$DW$136       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1360                      .dwattr $C$DW$136, DW_AT_name("all")
    1361                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1362                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$137       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$44)
    1366                      .dwattr $C$DW$137, DW_AT_name("bit")
    1367                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1368                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1370                      .dwendtag $C$DW$T$45
    1371              
    1372              
    1373              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1374                      .dwattr $C$DW$T$46, DW_AT_name("CPUSYSLOCK1_BITS")
    1375                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1376              $C$DW$138       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1378                      .dwattr $C$DW$138, DW_AT_name("HIBBOOTMODE")
    1379                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1380                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1381                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$139       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1385                      .dwattr $C$DW$139, DW_AT_name("IORESTOREADDR")
    1386                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1387                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1388                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$140       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1392                      .dwattr $C$DW$140, DW_AT_name("PIEVERRADDR")
    1393                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1394                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1395                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$141       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1399                      .dwattr $C$DW$141, DW_AT_name("PCLKCR0")
    1400                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PCLKCR0")
    1401                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1402                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$142       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1406                      .dwattr $C$DW$142, DW_AT_name("PCLKCR1")
    1407                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PCLKCR1")
    1408                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1409                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$143       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   28

    1412                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
    1413                      .dwattr $C$DW$143, DW_AT_name("PCLKCR2")
    1414                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PCLKCR2")
    1415                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1416                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$144       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1420                      .dwattr $C$DW$144, DW_AT_name("PCLKCR3")
    1421                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PCLKCR3")
    1422                      .dwattr $C$DW$144, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1423                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$145       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1427                      .dwattr $C$DW$145, DW_AT_name("PCLKCR4")
    1428                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PCLKCR4")
    1429                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1430                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$146       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1434                      .dwattr $C$DW$146, DW_AT_name("PCLKCR5")
    1435                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PCLKCR5")
    1436                      .dwattr $C$DW$146, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1437                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$147       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1441                      .dwattr $C$DW$147, DW_AT_name("PCLKCR6")
    1442                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PCLKCR6")
    1443                      .dwattr $C$DW$147, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1444                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1446              $C$DW$148       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1448                      .dwattr $C$DW$148, DW_AT_name("PCLKCR7")
    1449                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PCLKCR7")
    1450                      .dwattr $C$DW$148, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1451                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1452                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$149       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1455                      .dwattr $C$DW$149, DW_AT_name("PCLKCR8")
    1456                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PCLKCR8")
    1457                      .dwattr $C$DW$149, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1458                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$150       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    1462                      .dwattr $C$DW$150, DW_AT_name("PCLKCR9")
    1463                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PCLKCR9")
    1464                      .dwattr $C$DW$150, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1465                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   29

    1467              $C$DW$151       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    1469                      .dwattr $C$DW$151, DW_AT_name("PCLKCR10")
    1470                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PCLKCR10")
    1471                      .dwattr $C$DW$151, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1472                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1473                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1474              $C$DW$152       .dwtag  DW_TAG_member
    1475                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    1476                      .dwattr $C$DW$152, DW_AT_name("PCLKCR11")
    1477                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PCLKCR11")
    1478                      .dwattr $C$DW$152, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1479                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1481              $C$DW$153       .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    1483                      .dwattr $C$DW$153, DW_AT_name("PCLKCR12")
    1484                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PCLKCR12")
    1485                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1486                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1488              $C$DW$154       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    1490                      .dwattr $C$DW$154, DW_AT_name("PCLKCR13")
    1491                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PCLKCR13")
    1492                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1493                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1494                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1495              $C$DW$155       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    1497                      .dwattr $C$DW$155, DW_AT_name("PCLKCR14")
    1498                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PCLKCR14")
    1499                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1500                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1501                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$156       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    1504                      .dwattr $C$DW$156, DW_AT_name("PCLKCR15")
    1505                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PCLKCR15")
    1506                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1507                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1508                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$157       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1511                      .dwattr $C$DW$157, DW_AT_name("PCLKCR16")
    1512                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PCLKCR16")
    1513                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1514                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1515                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1516              $C$DW$158       .dwtag  DW_TAG_member
    1517                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1518                      .dwattr $C$DW$158, DW_AT_name("SECMSEL")
    1519                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SECMSEL")
    1520                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1521                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   30

    1522                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1523              $C$DW$159       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1525                      .dwattr $C$DW$159, DW_AT_name("LPMCR")
    1526                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_LPMCR")
    1527                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1528                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1529                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1530              $C$DW$160       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    1532                      .dwattr $C$DW$160, DW_AT_name("GPIOLPMSEL0")
    1533                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1534                      .dwattr $C$DW$160, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1535                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1536                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1537              $C$DW$161       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    1539                      .dwattr $C$DW$161, DW_AT_name("GPIOLPMSEL1")
    1540                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1541                      .dwattr $C$DW$161, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1542                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1543                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$162       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1546                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    1547                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    1548                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1549                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1550                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1551                      .dwendtag $C$DW$T$46
    1552              
    1553              
    1554              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1555                      .dwattr $C$DW$T$47, DW_AT_name("CPUSYSLOCK1_REG")
    1556                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1557              $C$DW$163       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$38)
    1559                      .dwattr $C$DW$163, DW_AT_name("all")
    1560                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    1561                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1563              $C$DW$164       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$46)
    1565                      .dwattr $C$DW$164, DW_AT_name("bit")
    1566                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    1567                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1569                      .dwendtag $C$DW$T$47
    1570              
    1571              
    1572              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1573                      .dwattr $C$DW$T$52, DW_AT_name("CPU_SYS_REGS")
    1574                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x82)
    1575              $C$DW$165       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$47)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   31

    1577                      .dwattr $C$DW$165, DW_AT_name("CPUSYSLOCK1")
    1578                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1579                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1581              $C$DW$166       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$48)
    1583                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    1584                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    1585                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1586                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$167       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$38)
    1589                      .dwattr $C$DW$167, DW_AT_name("HIBBOOTMODE")
    1590                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1591                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1592                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1593              $C$DW$168       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$128)
    1595                      .dwattr $C$DW$168, DW_AT_name("IORESTOREADDR")
    1596                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1597                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1598                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$169       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$164)
    1601                      .dwattr $C$DW$169, DW_AT_name("PIEVERRADDR")
    1602                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1603                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1604                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$170       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$49)
    1607                      .dwattr $C$DW$170, DW_AT_name("rsvd2")
    1608                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd2")
    1609                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1610                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$171       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$134)
    1613                      .dwattr $C$DW$171, DW_AT_name("PCLKCR0")
    1614                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PCLKCR0")
    1615                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1616                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1617              $C$DW$172       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$148)
    1619                      .dwattr $C$DW$172, DW_AT_name("PCLKCR1")
    1620                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCLKCR1")
    1621                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1622                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$173       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$150)
    1625                      .dwattr $C$DW$173, DW_AT_name("PCLKCR2")
    1626                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PCLKCR2")
    1627                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1628                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$174       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$152)
    1631                      .dwattr $C$DW$174, DW_AT_name("PCLKCR3")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   32

    1632                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PCLKCR3")
    1633                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1634                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$175       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$154)
    1637                      .dwattr $C$DW$175, DW_AT_name("PCLKCR4")
    1638                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PCLKCR4")
    1639                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1640                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$176       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$50)
    1643                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    1644                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    1645                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1646                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1647              $C$DW$177       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$156)
    1649                      .dwattr $C$DW$177, DW_AT_name("PCLKCR6")
    1650                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PCLKCR6")
    1651                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1652                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$178       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$158)
    1655                      .dwattr $C$DW$178, DW_AT_name("PCLKCR7")
    1656                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PCLKCR7")
    1657                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1658                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$179       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$160)
    1661                      .dwattr $C$DW$179, DW_AT_name("PCLKCR8")
    1662                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PCLKCR8")
    1663                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1664                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$180       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$162)
    1667                      .dwattr $C$DW$180, DW_AT_name("PCLKCR9")
    1668                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PCLKCR9")
    1669                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1670                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$181       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$136)
    1673                      .dwattr $C$DW$181, DW_AT_name("PCLKCR10")
    1674                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PCLKCR10")
    1675                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1676                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$182       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$138)
    1679                      .dwattr $C$DW$182, DW_AT_name("PCLKCR11")
    1680                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PCLKCR11")
    1681                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1682                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$183       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$140)
    1685                      .dwattr $C$DW$183, DW_AT_name("PCLKCR12")
    1686                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PCLKCR12")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:10 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
pwm_servo.asm                                                        PAGE   33

    1687                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1688                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$184       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$142)
    1691                      .dwattr $C$DW$184, DW_AT_name("PCLKCR13")
    1692                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PCLKCR13")
    1693                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1694                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$185       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$144)
    1697                      .dwattr $C$DW$185, DW_AT_name("PCLKCR14")
    1698                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PCLKCR14")
    1699                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1700                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$186       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$50)
    1703                      .dwattr $C$DW$186, DW_AT_name("rsvd4")
    1704                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd4")
    1705                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1706                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$187       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$146)
    1709                      .dwattr $C$DW$187, DW_AT_name("PCLKCR16")
    1710                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PCLKCR16")
    1711                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1712                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$188       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$51)
    1715                      .dwattr $C$DW$188, DW_AT_name("rsvd5")
    1716                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd5")
    1717                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1718                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$189       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$168)
    1721                      .dwattr $C$DW$189, DW_AT_name("SECMSEL")
    1722                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_SECMSEL")
    1723                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1724                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$190       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$130)
    1727                      .dwattr $C$DW$190, DW_AT_name("LPMCR")
    1728                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_LPMCR")
    1729                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1730                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$191       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$114)
    1733                      .dwattr $C$DW$191, DW_AT_name("GPIOLPMSEL0")
    1734                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1735                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1736                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$192       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$116)
    1739                      .dwattr $C$DW$192, DW_AT_name("GPIOLPMSEL1")
    1740                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1741                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
