TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_control.asm                                                 PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:27:14 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/steering_control.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("get_potentiometer_zero")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_get_potentiometer_zero")

     291 0000008d 7700          NOP       ; [CPU_] 
     292 0000008e 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |60| 
     293 0000008f E203          MOV32     *+XAR4[6],R0H         ; [CPU_] |60| 
         00000090 00F4 
     294                      .dwpsn  file "../Source/App/steering_control.c",line 61,column 2,is_stmt,isa 0
     295              $C$DW$21        .dwtag  DW_TAG_TI_branch
     296                      .dwattr $C$DW$21, DW_AT_low_pc(0x00)
     297                      .dwattr $C$DW$21, DW_AT_name("_get_KP")
     298                      .dwattr $C$DW$21, DW_AT_TI_call
     299 00000091 7640!         LCR       #_get_KP              ; [CPU_] |61| 
         00000092 0000 
     300                      ; call occurs [#_get_KP] ; [] |61| 
     301 00000093 0208          MOVB      ACC,#8                ; [CPU_] |61| 
     302 00000094 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |61| 
     303 00000095 8AA9          MOVL      XAR4,ACC              ; [CPU_] |61| 
     304 00000096 E203          MOV32     *+XAR4[0],R0H         ; [CPU_] |61| 
         00000097 00C4 
     305                      .dwpsn  file "../Source/App/steering_control.c",line 62,column 2,is_stmt,isa 0
     306              $C$DW$22        .dwtag  DW_TAG_TI_branch
     307                      .dwattr $C$DW$22, DW_AT_low_pc(0x00)
     308                      .dwattr $C$DW$22, DW_AT_name("_get_KI")
     309                      .dwattr $C$DW$22, DW_AT_TI_call
     310 00000098 7640!         LCR       #_get_KI              ; [CPU_] |62| 
         00000099 0000 
     311                      ; call occurs [#_get_KI] ; [] |62| 
     312 0000009a 020A          MOVB      ACC,#10               ; [CPU_] |62| 
     313 0000009b 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |62| 
     314 0000009c 8AA9          MOVL      XAR4,ACC              ; [CPU_] |62| 
     315 0000009d E203          MOV32     *+XAR4[0],R0H         ; [CPU_] |62| 
         0000009e 00C4 
     316                      .dwpsn  file "../Source/App/steering_control.c",line 63,column 2,is_stmt,isa 0
     317 0000009f 020C          MOVB      ACC,#12               ; [CPU_] |63| 
     318 000000a0 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |63| 
     319 000000a1 8AA9          MOVL      XAR4,ACC              ; [CPU_] |63| 
     320 000000a2 E801          MOVIZ     R0H,#14749            ; [CPU_] |63| 
         000000a3 CCE8 
     321 000000a4 E80A          MOVXI     R0H,#18770            ; [CPU_] |63| 
         000000a5 4A90 
     322 000000a6 E203          MOV32     *+XAR4[0],R0H         ; [CPU_] |63| 
         000000a7 00C4 
     323                      .dwpsn  file "../Source/App/steering_control.c",line 64,column 2,is_stmt,isa 0
     324 000000a8 0210          MOVB      ACC,#16               ; [CPU_] |64| 
     325 000000a9 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |64| 
     326 000000aa 8AA9          MOVL      XAR4,ACC              ; [CPU_] |64| 
     327 000000ab E590          ZERO      R0H                   ; [CPU_] |64| 
     328 000000ac E203          MOV32     *+XAR4[0],R0H         ; [CPU_] |64| 
         000000ad 00C4 
     329                      .dwpsn  file "../Source/App/steering_control.c",line 65,column 2,is_stmt,isa 0
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_control.asm                                                 PAGE    8

     330 000000ae 0212          MOVB      ACC,#18               ; [CPU_] |65| 
     331 000000af 0742          ADDL      ACC,*-SP[2]           ; [CPU_] |65| 
     332 000000b0 8AA9          MOVL      XAR4,ACC              ; [CPU_] |65| 
     333 000000b1 E203          MOV32     *+XAR4[0],R0H         ; [CPU_] |65| 
         000000b2 00C4 
     334                      .dwpsn  file "../Source/App/steering_control.c",line 66,column 1,is_stmt,isa 0
     335 000000b3 FE84          SUBB      SP,#4                 ; [CPU_U] 
     336                      .dwcfi  cfa_offset, -2
     337              $C$DW$23        .dwtag  DW_TAG_TI_branch
     338                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     339                      .dwattr $C$DW$23, DW_AT_TI_return
     340 000000b4 0006          LRETR     ; [CPU_] 
     341                      ; return occurs ; [] 
     342                      .dwattr $C$DW$15, DW_AT_TI_end_file("../Source/App/steering_control.c")
     343                      .dwattr $C$DW$15, DW_AT_TI_end_line(0x42)
     344                      .dwattr $C$DW$15, DW_AT_TI_end_column(0x01)
     345                      .dwendentry
     346                      .dwendtag $C$DW$15
     347              
     348              ;**************************************************************
     349              ;* UNDEFINED EXTERNAL REFERENCES                              *
     350              ;**************************************************************
     351                      .global _get_potentiometer_zero
     352                      .global _get_left_wheel_factor
     353                      .global _get_KI
     354                      .global _get_right_wheel_factor
     355                      .global _get_KP
     356              
     357              ;***************************************************************
     358              ;* TYPE INFORMATION                                            *
     359              ;***************************************************************
     360              
     361              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     362                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x18)
     363              $C$DW$24        .dwtag  DW_TAG_member
     364                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     365                      .dwattr $C$DW$24, DW_AT_name("speed_ref")
     366                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_speed_ref")
     367                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     368                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     369              $C$DW$25        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$25, DW_AT_name("angle_ref")
     372                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_angle_ref")
     373                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     374                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     375              $C$DW$26        .dwtag  DW_TAG_member
     376                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     377                      .dwattr $C$DW$26, DW_AT_name("steering_feedback")
     378                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_steering_feedback")
     379                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     380                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     381              $C$DW$27        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     383                      .dwattr $C$DW$27, DW_AT_name("speed_scaling_ms_to_mot")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_control.asm                                                 PAGE    9

     384                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_speed_scaling_ms_to_mot")
     385                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     386                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     387              $C$DW$28        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     389                      .dwattr $C$DW$28, DW_AT_name("kp")
     390                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_kp")
     391                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     392                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     393              $C$DW$29        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     395                      .dwattr $C$DW$29, DW_AT_name("ki")
     396                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_ki")
     397                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     398                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     399              $C$DW$30        .dwtag  DW_TAG_member
     400                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     401                      .dwattr $C$DW$30, DW_AT_name("dt")
     402                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_dt")
     403                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     404                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     405              $C$DW$31        .dwtag  DW_TAG_member
     406                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     407                      .dwattr $C$DW$31, DW_AT_name("steering_loop_count")
     408                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_steering_loop_count")
     409                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     410                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     411              $C$DW$32        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     413                      .dwattr $C$DW$32, DW_AT_name("motor_speed_1")
     414                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_motor_speed_1")
     415                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     416                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     417              $C$DW$33        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     419                      .dwattr $C$DW$33, DW_AT_name("motor_speed_2")
     420                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_motor_speed_2")
     421                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     422                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     423              $C$DW$34        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$34, DW_AT_name("scale_1")
     426                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_scale_1")
     427                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     428                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     429              $C$DW$35        .dwtag  DW_TAG_member
     430                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     431                      .dwattr $C$DW$35, DW_AT_name("scale_2")
     432                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_scale_2")
     433                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     434                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     435                      .dwendtag $C$DW$T$21
     436              
     437              $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("steering_control_t")
     438                      .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:27:15 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_control.asm                                                 PAGE   10

     439                      .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
     440              $C$DW$T$23      .dwtag  DW_TAG_pointer_type
     441                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
     442                      .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
     443              $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     444                      .dwattr $C$DW$T$2, DW_AT_name("void")
     445              $C$DW$T$4       .dwtag  DW_TAG_base_type
     446                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     447                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     448                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     449              $C$DW$T$5       .dwtag  DW_TAG_base_type
     450                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     451                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     452                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     453              $C$DW$T$6       .dwtag  DW_TAG_base_type
     454                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     455                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     456                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     457              $C$DW$T$7       .dwtag  DW_TAG_base_type
     458                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     459                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     460                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     461              $C$DW$T$8       .dwtag  DW_TAG_base_type
     462                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     463                      .dwattr $C$DW$T$8, DW_AT_name("short")
     464                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     465              $C$DW$T$9       .dwtag  DW_TAG_base_type
     466                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     467                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     468                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     469              $C$DW$T$10      .dwtag  DW_TAG_base_type
     470                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     471                      .dwattr $C$DW$T$10, DW_AT_name("int")
     472                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     473              $C$DW$T$11      .dwtag  DW_TAG_base_type
     474                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     475                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     476                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     477              $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
     478                      .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
     479                      .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     480              $C$DW$T$12      .dwtag  DW_TAG_base_type
     481                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     482                      .dwattr $C$DW$T$12, DW_AT_name("long")
     483                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     484              $C$DW$T$13      .dwtag  DW_TAG_base_type
     485                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
