;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
;* Date/Time created: Thu Dec 14 13:38:04 2017                 *
;***************************************************************
	.compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --object_format=coff --quiet --silicon_version=28 --symdebug:dwarf --symdebug:dwarf_version=3 --tmu_support=tmu0 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../Source/App/steering_control.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("get_potentiometer_zero")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_get_potentiometer_zero")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external

$C$DW$2	.dwtag  DW_TAG_subprogram, DW_AT_name("get_left_wheel_factor")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_get_left_wheel_factor")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external

$C$DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("get_KI")
	.dwattr $C$DW$3, DW_AT_TI_symbol_name("_get_KI")

;* FUNCTION ENVIRONMENT                                        *
;*                                                             *
;* FUNCTION PROPERTIES                                         *
;*                            0 Parameter,  4 Auto,  0 SOE     *
;***************************************************************

_init_steering_control:
	.dwcfi	cfa_offset, -2
	.dwcfi	save_reg_to_mem, 26, 0
        ADDB      SP,#4                 ; [CPU_U] 
	.dwcfi	cfa_offset, -6
$C$DW$18	.dwtag  DW_TAG_variable, DW_AT_name("control_instruction")
	.dwattr $C$DW$18, DW_AT_TI_symbol_name("_control_instruction")
	.dwattr $C$DW$18, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$18, DW_AT_location[DW_OP_breg20 -2]
$C$DW$19	.dwtag  DW_TAG_variable, DW_AT_name("speed_base_rpm")
	.dwattr $C$DW$19, DW_AT_TI_symbol_name("_speed_base_rpm")
	.dwattr $C$DW$19, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$19, DW_AT_location[DW_OP_breg20 -4]
        MOVL      *-SP[4],ACC           ; [CPU_] |57| 
        MOVL      *-SP[2],XAR4          ; [CPU_] |57| 
	.dwpsn	file "../Source/App/steering_control.c",line 58,column 2,is_stmt,isa 0
        ZERO      R0H                   ; [CPU_] |58| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |58| 
	.dwpsn	file "../Source/App/steering_control.c",line 59,column 2,is_stmt,isa 0
$C$DW$20	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$20, DW_AT_low_pc(0x00)
	.dwattr $C$DW$20, DW_AT_name("_get_potentiometer_zero")
	.dwattr $C$DW$20, DW_AT_TI_call
        LCR       #_get_potentiometer_zero ; [CPU_] |59| 
        ; call occurs [#_get_potentiometer_zero] ; [] |59| 
        MOVL      XAR4,*-SP[2]          ; [CPU_] |59| 
        MOVU      ACC,AL                ; [CPU_] |59| 
        MOVL      *+XAR4[4],ACC         ; [CPU_] |59| 
	.dwpsn	file "../Source/App/steering_control.c",line 60,column 2,is_stmt,isa 0
        MOVIZ     R0H,#15670            ; [CPU_] |60| 
        UI32TOF32 R1H,*-SP[4]           ; [CPU_] |60| 
        MOVXI     R0H,#17826            ; [CPU_] |60| 
        MPYF32    R1H,R0H,R1H           ; [CPU_] |60| 
        MOVIZ     R0H,#16457            ; [CPU_] |60| 
        MPYF32    R1H,R1H,#16384        ; [CPU_] |60| 
        MOVXI     R0H,#4059             ; [CPU_] |60| 
        MPYF32    R0H,R0H,R1H           ; [CPU_] |60| 
        NOP       ; [CPU_] 
        MOVIZ     R1H,#17008            ; [CPU_] |60| 
        DIVF32    R0H,R1H,R0H           ; [CPU_] |60| 
        NOP       ; [CPU_] 
        NOP       ; [CPU_] 
        NOP       ; [CPU_] 
        MOVL      XAR4,*-SP[2]          ; [CPU_] |60| 
        MOV32     *+XAR4[6],R0H         ; [CPU_] |60| 
	.dwpsn	file "../Source/App/steering_control.c",line 61,column 2,is_stmt,isa 0
$C$DW$21	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$21, DW_AT_low_pc(0x00)
	.dwattr $C$DW$21, DW_AT_name("_get_KP")
	.dwattr $C$DW$21, DW_AT_TI_call
        LCR       #_get_KP              ; [CPU_] |61| 
        ; call occurs [#_get_KP] ; [] |61| 
        MOVB      ACC,#8                ; [CPU_] |61| 
        ADDL      ACC,*-SP[2]           ; [CPU_] |61| 
        MOVL      XAR4,ACC              ; [CPU_] |61| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |61| 
	.dwpsn	file "../Source/App/steering_control.c",line 62,column 2,is_stmt,isa 0
$C$DW$22	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$22, DW_AT_low_pc(0x00)
	.dwattr $C$DW$22, DW_AT_name("_get_KI")
	.dwattr $C$DW$22, DW_AT_TI_call
        LCR       #_get_KI              ; [CPU_] |62| 
        ; call occurs [#_get_KI] ; [] |62| 
        MOVB      ACC,#10               ; [CPU_] |62| 
        ADDL      ACC,*-SP[2]           ; [CPU_] |62| 
        MOVL      XAR4,ACC              ; [CPU_] |62| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |62| 
	.dwpsn	file "../Source/App/steering_control.c",line 63,column 2,is_stmt,isa 0
        MOVB      ACC,#12               ; [CPU_] |63| 
        ADDL      ACC,*-SP[2]           ; [CPU_] |63| 
        MOVL      XAR4,ACC              ; [CPU_] |63| 
        MOVIZ     R0H,#14749            ; [CPU_] |63| 
        MOVXI     R0H,#18770            ; [CPU_] |63| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |63| 
	.dwpsn	file "../Source/App/steering_control.c",line 64,column 2,is_stmt,isa 0
        MOVB      ACC,#16               ; [CPU_] |64| 
        ADDL      ACC,*-SP[2]           ; [CPU_] |64| 
        MOVL      XAR4,ACC              ; [CPU_] |64| 
        ZERO      R0H                   ; [CPU_] |64| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |64| 
	.dwpsn	file "../Source/App/steering_control.c",line 65,column 2,is_stmt,isa 0
        MOVB      ACC,#18               ; [CPU_] |65| 
        ADDL      ACC,*-SP[2]           ; [CPU_] |65| 
        MOVL      XAR4,ACC              ; [CPU_] |65| 
        MOV32     *+XAR4[0],R0H         ; [CPU_] |65| 
	.dwpsn	file "../Source/App/steering_control.c",line 66,column 1,is_stmt,isa 0
        SUBB      SP,#4                 ; [CPU_U] 
	.dwcfi	cfa_offset, -2
$C$DW$23	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$23, DW_AT_low_pc(0x00)
	.dwattr $C$DW$23, DW_AT_TI_return
        LRETR     ; [CPU_] 
        ; return occurs ; [] 
	.dwattr $C$DW$15, DW_AT_TI_end_file("../Source/App/steering_control.c")
	.dwattr $C$DW$15, DW_AT_TI_end_line(0x42)
	.dwattr $C$DW$15, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$15

;**************************************************************
;* UNDEFINED EXTERNAL REFERENCES                              *
;**************************************************************
	.global	_get_potentiometer_zero
	.global	_get_left_wheel_factor
	.global	_get_KI
	.global	_get_right_wheel_factor
	.global	_get_KP

;***************************************************************
;* TYPE INFORMATION                                            *
;***************************************************************

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x18)
$C$DW$24	.dwtag  DW_TAG_member
	.dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$24, DW_AT_name("speed_ref")
	.dwattr $C$DW$24, DW_AT_TI_symbol_name("_speed_ref")
	.dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$25	.dwtag  DW_TAG_member
	.dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$25, DW_AT_name("angle_ref")
	.dwattr $C$DW$25, DW_AT_TI_symbol_name("_angle_ref")
	.dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$26	.dwtag  DW_TAG_member
	.dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$26, DW_AT_name("steering_feedback")
	.dwattr $C$DW$26, DW_AT_TI_symbol_name("_steering_feedback")
	.dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$27	.dwtag  DW_TAG_member
	.dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$27, DW_AT_name("speed_scaling_ms_to_mot")
	.dwattr $C$DW$27, DW_AT_TI_symbol_name("_speed_scaling_ms_to_mot")
	.dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$28	.dwtag  DW_TAG_member
	.dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$28, DW_AT_name("kp")
	.dwattr $C$DW$28, DW_AT_TI_symbol_name("_kp")
	.dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$29	.dwtag  DW_TAG_member
	.dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$29, DW_AT_name("ki")
	.dwattr $C$DW$29, DW_AT_TI_symbol_name("_ki")
	.dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$30	.dwtag  DW_TAG_member
	.dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$30, DW_AT_name("dt")
	.dwattr $C$DW$30, DW_AT_TI_symbol_name("_dt")
	.dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$31	.dwtag  DW_TAG_member
	.dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$31, DW_AT_name("steering_loop_count")
	.dwattr $C$DW$31, DW_AT_TI_symbol_name("_steering_loop_count")
	.dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$32	.dwtag  DW_TAG_member
	.dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$32, DW_AT_name("motor_speed_1")
	.dwattr $C$DW$32, DW_AT_TI_symbol_name("_motor_speed_1")
	.dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$33	.dwtag  DW_TAG_member
	.dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$33, DW_AT_name("motor_speed_2")
	.dwattr $C$DW$33, DW_AT_TI_symbol_name("_motor_speed_2")
	.dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$34	.dwtag  DW_TAG_member
	.dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$34, DW_AT_name("scale_1")
	.dwattr $C$DW$34, DW_AT_TI_symbol_name("_scale_1")
	.dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
$C$DW$35	.dwtag  DW_TAG_member
	.dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$35, DW_AT_name("scale_2")
	.dwattr $C$DW$35, DW_AT_TI_symbol_name("_scale_2")
	.dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag $C$DW$T$21

$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("steering_control_t")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
$C$DW$T$23	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x20)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 26
	.dwcfi	cfa_register, 20
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	undefined, 20
