TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:38:02 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/steering_config.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("read_Flash")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_read_Flash")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$155)

    2348 00000342 9209-         MOV       AL,@_steering_config+9 ; [CPU_] |304| 
    2349 00000343 ECD6          BF        $C$L22,EQ             ; [CPU_] |304| 
    2350                      ; branchcc occurs ; [] |304| 
    2351 00000344 5201          CMPB      AL,#1                 ; [CPU_] |304| 
    2352 00000345 ECD9          BF        $C$L23,EQ             ; [CPU_] |304| 
    2353                      ; branchcc occurs ; [] |304| 
    2354 00000346 5202          CMPB      AL,#2                 ; [CPU_] |304| 
    2355 00000347 ECF4          BF        $C$L24,EQ             ; [CPU_] |304| 
    2356                      ; branchcc occurs ; [] |304| 
    2357 00000348 6F01          B         $C$L26,UNC            ; [CPU_] |304| 
    2358                      ; branch occurs ; [] |304| 
    2359 00000349       $C$L26:    
    2360 00000349 FE86          SUBB      SP,#6                 ; [CPU_U] 
    2361                      .dwcfi  cfa_offset, -2
    2362              $C$DW$143       .dwtag  DW_TAG_TI_branch
    2363                      .dwattr $C$DW$143, DW_AT_low_pc(0x00)
    2364                      .dwattr $C$DW$143, DW_AT_TI_return
    2365 0000034a 0006          LRETR     ; [CPU_] 
    2366                      ; return occurs ; [] 
    2367                      .dwattr $C$DW$139, DW_AT_TI_end_file("../Source/App/steering_config.c")
    2368                      .dwattr $C$DW$139, DW_AT_TI_end_line(0x13e)
    2369                      .dwattr $C$DW$139, DW_AT_TI_end_column(0x01)
    2370                      .dwendentry
    2371                      .dwendtag $C$DW$139
    2372              
    2373              ;**************************************************************
    2374              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2375              ;**************************************************************
    2376                      .global _read_Flash
    2377                      .global _get_servo_angle
    2378                      .global _tan
    2379                      .global _EPwm3Regs
    2380              
    2381              ;***************************************************************
    2382              ;* TYPE INFORMATION                                            *
    2383              ;***************************************************************
    2384              
    2385              $C$DW$T$156     .dwtag  DW_TAG_enumeration_type
    2386                      .dwattr $C$DW$T$156, DW_AT_byte_size(0x01)
    2387              $C$DW$144       .dwtag  DW_TAG_enumerator, DW_AT_name("COMBINED"), DW_AT_const_value(0x00)
    2388              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("ARTICULATED_STEERING"), DW_AT_const_value(0x01)
    2389              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("TURNTABLE_STEERING"), DW_AT_const_value(0x02)
    2390              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_LEFT"), DW_AT_const_value(0x03)
    2391              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_RIGHT"), DW_AT_const_value(0x04)
    2392              $C$DW$149       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_LEFT"), DW_AT_const_value(0x05)
    2393              $C$DW$150       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_MIDDLE"), DW_AT_const_value(0x06)
    2394              $C$DW$151       .dwtag  DW_TAG_enumerator, DW_AT_name("INCREMENT_SERVO"), DW_AT_const_value(0x07)
    2395              $C$DW$152       .dwtag  DW_TAG_enumerator, DW_AT_name("DECREMENT_SERVO"), DW_AT_const_value(0x08)
    2396              $C$DW$153       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_0"), DW_AT_const_value(0x09)
    2397              $C$DW$154       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_1"), DW_AT_const_value(0x0a)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   49

    2398              $C$DW$155       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_2"), DW_AT_const_value(0x0b)
    2399              $C$DW$156       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_3"), DW_AT_const_value(0x0c)
    2400              $C$DW$157       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_4"), DW_AT_const_value(0x0d)
    2401              $C$DW$158       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_5"), DW_AT_const_value(0x0e)
    2402              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_6"), DW_AT_const_value(0x0f)
    2403              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_0"), DW_AT_const_value(0x10)
    2404              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_1"), DW_AT_const_value(0x11)
    2405              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_2"), DW_AT_const_value(0x12)
    2406                      .dwendtag $C$DW$T$156
    2407              
    2408              $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("config_mode_cmd_t")
    2409                      .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    2410                      .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    2411              
    2412              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2413                      .dwattr $C$DW$T$20, DW_AT_name("AQCSFRC_BITS")
    2414                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    2415              $C$DW$163       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2417                      .dwattr $C$DW$163, DW_AT_name("CSFA")
    2418                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_CSFA")
    2419                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2420                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2421                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2422              $C$DW$164       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2424                      .dwattr $C$DW$164, DW_AT_name("CSFB")
    2425                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CSFB")
    2426                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2427                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2428                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2429              $C$DW$165       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2431                      .dwattr $C$DW$165, DW_AT_name("rsvd1")
    2432                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd1")
    2433                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2434                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2436                      .dwendtag $C$DW$T$20
    2437              
    2438              
    2439              $C$DW$T$21      .dwtag  DW_TAG_union_type
    2440                      .dwattr $C$DW$T$21, DW_AT_name("AQCSFRC_REG")
    2441                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    2442              $C$DW$166       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2444                      .dwattr $C$DW$166, DW_AT_name("all")
    2445                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    2446                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2447                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$167       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    2450                      .dwattr $C$DW$167, DW_AT_name("bit")
    2451                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    2452                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   50

    2453                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2454                      .dwendtag $C$DW$T$21
    2455              
    2456              
    2457              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2458                      .dwattr $C$DW$T$22, DW_AT_name("AQCTLA2_BITS")
    2459                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2460              $C$DW$168       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2462                      .dwattr $C$DW$168, DW_AT_name("T1U")
    2463                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_T1U")
    2464                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2465                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2466                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2467              $C$DW$169       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2469                      .dwattr $C$DW$169, DW_AT_name("T1D")
    2470                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_T1D")
    2471                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2472                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2474              $C$DW$170       .dwtag  DW_TAG_member
    2475                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2476                      .dwattr $C$DW$170, DW_AT_name("T2U")
    2477                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_T2U")
    2478                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2479                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2480                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2481              $C$DW$171       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2483                      .dwattr $C$DW$171, DW_AT_name("T2D")
    2484                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_T2D")
    2485                      .dwattr $C$DW$171, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2486                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2487                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$172       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2490                      .dwattr $C$DW$172, DW_AT_name("rsvd1")
    2491                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd1")
    2492                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2493                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2494                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2495                      .dwendtag $C$DW$T$22
    2496              
    2497              
    2498              $C$DW$T$23      .dwtag  DW_TAG_union_type
    2499                      .dwattr $C$DW$T$23, DW_AT_name("AQCTLA2_REG")
    2500                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    2501              $C$DW$173       .dwtag  DW_TAG_member
    2502                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2503                      .dwattr $C$DW$173, DW_AT_name("all")
    2504                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    2505                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2506                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2507              $C$DW$174       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   51

    2508                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    2509                      .dwattr $C$DW$174, DW_AT_name("bit")
    2510                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    2511                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2512                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2513                      .dwendtag $C$DW$T$23
    2514              
    2515              
    2516              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2517                      .dwattr $C$DW$T$24, DW_AT_name("AQCTLA_BITS")
    2518                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2519              $C$DW$175       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$175, DW_AT_name("ZRO")
    2522                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ZRO")
    2523                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2524                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2525                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$176       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$176, DW_AT_name("PRD")
    2529                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PRD")
    2530                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2531                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2533              $C$DW$177       .dwtag  DW_TAG_member
    2534                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2535                      .dwattr $C$DW$177, DW_AT_name("CAU")
    2536                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_CAU")
    2537                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2538                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2539                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2540              $C$DW$178       .dwtag  DW_TAG_member
    2541                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2542                      .dwattr $C$DW$178, DW_AT_name("CAD")
    2543                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_CAD")
    2544                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2545                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2546                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2547              $C$DW$179       .dwtag  DW_TAG_member
    2548                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2549                      .dwattr $C$DW$179, DW_AT_name("CBU")
    2550                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_CBU")
    2551                      .dwattr $C$DW$179, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2552                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$180       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2556                      .dwattr $C$DW$180, DW_AT_name("CBD")
    2557                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_CBD")
    2558                      .dwattr $C$DW$180, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2559                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2560                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2561              $C$DW$181       .dwtag  DW_TAG_member
    2562                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   52

    2563                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    2564                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    2565                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2566                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2567                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2568                      .dwendtag $C$DW$T$24
    2569              
    2570              
    2571              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2572                      .dwattr $C$DW$T$25, DW_AT_name("AQCTLA_REG")
    2573                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2574              $C$DW$182       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$182, DW_AT_name("all")
    2577                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    2578                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2580              $C$DW$183       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$24)
    2582                      .dwattr $C$DW$183, DW_AT_name("bit")
    2583                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    2584                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2585                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2586                      .dwendtag $C$DW$T$25
    2587              
    2588              
    2589              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2590                      .dwattr $C$DW$T$26, DW_AT_name("AQCTLB2_BITS")
    2591                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2592              $C$DW$184       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$184, DW_AT_name("T1U")
    2595                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_T1U")
    2596                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2597                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2599              $C$DW$185       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$185, DW_AT_name("T1D")
    2602                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_T1D")
    2603                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2604                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2606              $C$DW$186       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2608                      .dwattr $C$DW$186, DW_AT_name("T2U")
    2609                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_T2U")
    2610                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2611                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2613              $C$DW$187       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2615                      .dwattr $C$DW$187, DW_AT_name("T2D")
    2616                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_T2D")
    2617                      .dwattr $C$DW$187, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   53

    2618                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$188       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$188, DW_AT_name("rsvd1")
    2623                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd1")
    2624                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2625                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2627                      .dwendtag $C$DW$T$26
    2628              
    2629              
    2630              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2631                      .dwattr $C$DW$T$27, DW_AT_name("AQCTLB2_REG")
    2632                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2633              $C$DW$189       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2635                      .dwattr $C$DW$189, DW_AT_name("all")
    2636                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    2637                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2639              $C$DW$190       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$26)
    2641                      .dwattr $C$DW$190, DW_AT_name("bit")
    2642                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    2643                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2645                      .dwendtag $C$DW$T$27
    2646              
    2647              
    2648              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2649                      .dwattr $C$DW$T$28, DW_AT_name("AQCTLB_BITS")
    2650                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2651              $C$DW$191       .dwtag  DW_TAG_member
    2652                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2653                      .dwattr $C$DW$191, DW_AT_name("ZRO")
    2654                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ZRO")
    2655                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2656                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2657                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2658              $C$DW$192       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2660                      .dwattr $C$DW$192, DW_AT_name("PRD")
    2661                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PRD")
    2662                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2663                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2664                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2665              $C$DW$193       .dwtag  DW_TAG_member
    2666                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2667                      .dwattr $C$DW$193, DW_AT_name("CAU")
    2668                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CAU")
    2669                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2670                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2671                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2672              $C$DW$194       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   54

    2673                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2674                      .dwattr $C$DW$194, DW_AT_name("CAD")
    2675                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CAD")
    2676                      .dwattr $C$DW$194, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2677                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2678                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2679              $C$DW$195       .dwtag  DW_TAG_member
    2680                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2681                      .dwattr $C$DW$195, DW_AT_name("CBU")
    2682                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_CBU")
    2683                      .dwattr $C$DW$195, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2684                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2685                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2686              $C$DW$196       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2688                      .dwattr $C$DW$196, DW_AT_name("CBD")
    2689                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CBD")
    2690                      .dwattr $C$DW$196, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2691                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2692                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2693              $C$DW$197       .dwtag  DW_TAG_member
    2694                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2695                      .dwattr $C$DW$197, DW_AT_name("rsvd1")
    2696                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd1")
    2697                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2698                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2699                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2700                      .dwendtag $C$DW$T$28
    2701              
    2702              
    2703              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2704                      .dwattr $C$DW$T$29, DW_AT_name("AQCTLB_REG")
    2705                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2706              $C$DW$198       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2708                      .dwattr $C$DW$198, DW_AT_name("all")
    2709                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_all")
    2710                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2711                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$199       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$28)
    2714                      .dwattr $C$DW$199, DW_AT_name("bit")
    2715                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_bit")
    2716                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2717                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2718                      .dwendtag $C$DW$T$29
    2719              
    2720              
    2721              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2722                      .dwattr $C$DW$T$30, DW_AT_name("AQCTL_BITS")
    2723                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2724              $C$DW$200       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$200, DW_AT_name("LDAQAMODE")
    2727                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_LDAQAMODE")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   55

    2728                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2729                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2730                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2731              $C$DW$201       .dwtag  DW_TAG_member
    2732                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2733                      .dwattr $C$DW$201, DW_AT_name("LDAQBMODE")
    2734                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_LDAQBMODE")
    2735                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2736                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$202       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2740                      .dwattr $C$DW$202, DW_AT_name("SHDWAQAMODE")
    2741                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SHDWAQAMODE")
    2742                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2743                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2745              $C$DW$203       .dwtag  DW_TAG_member
    2746                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2747                      .dwattr $C$DW$203, DW_AT_name("rsvd1")
    2748                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd1")
    2749                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2750                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2751                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$204       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2754                      .dwattr $C$DW$204, DW_AT_name("SHDWAQBMODE")
    2755                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_SHDWAQBMODE")
    2756                      .dwattr $C$DW$204, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2757                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2758                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2759              $C$DW$205       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2761                      .dwattr $C$DW$205, DW_AT_name("rsvd2")
    2762                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd2")
    2763                      .dwattr $C$DW$205, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2764                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2765                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2766              $C$DW$206       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2768                      .dwattr $C$DW$206, DW_AT_name("LDAQASYNC")
    2769                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_LDAQASYNC")
    2770                      .dwattr $C$DW$206, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2771                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2772                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2773              $C$DW$207       .dwtag  DW_TAG_member
    2774                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2775                      .dwattr $C$DW$207, DW_AT_name("LDAQBSYNC")
    2776                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_LDAQBSYNC")
    2777                      .dwattr $C$DW$207, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2778                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2779                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$208       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2782                      .dwattr $C$DW$208, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   56

    2783                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd3")
    2784                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2785                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2787                      .dwendtag $C$DW$T$30
    2788              
    2789              
    2790              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2791                      .dwattr $C$DW$T$31, DW_AT_name("AQCTL_REG")
    2792                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2793              $C$DW$209       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2795                      .dwattr $C$DW$209, DW_AT_name("all")
    2796                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_all")
    2797                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2798                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2799              $C$DW$210       .dwtag  DW_TAG_member
    2800                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$30)
    2801                      .dwattr $C$DW$210, DW_AT_name("bit")
    2802                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_bit")
    2803                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2805                      .dwendtag $C$DW$T$31
    2806              
    2807              
    2808              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2809                      .dwattr $C$DW$T$32, DW_AT_name("AQSFRC_BITS")
    2810                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2811              $C$DW$211       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2813                      .dwattr $C$DW$211, DW_AT_name("ACTSFA")
    2814                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_ACTSFA")
    2815                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2816                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2818              $C$DW$212       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2820                      .dwattr $C$DW$212, DW_AT_name("OTSFA")
    2821                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_OTSFA")
    2822                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2823                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$213       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2827                      .dwattr $C$DW$213, DW_AT_name("ACTSFB")
    2828                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ACTSFB")
    2829                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x02)
    2830                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2832              $C$DW$214       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2834                      .dwattr $C$DW$214, DW_AT_name("OTSFB")
    2835                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_OTSFB")
    2836                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2837                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   57

    2838                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2839              $C$DW$215       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2841                      .dwattr $C$DW$215, DW_AT_name("RLDCSF")
    2842                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_RLDCSF")
    2843                      .dwattr $C$DW$215, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2844                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2845                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2846              $C$DW$216       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2848                      .dwattr $C$DW$216, DW_AT_name("rsvd1")
    2849                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd1")
    2850                      .dwattr $C$DW$216, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2851                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2853                      .dwendtag $C$DW$T$32
    2854              
    2855              
    2856              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2857                      .dwattr $C$DW$T$33, DW_AT_name("AQSFRC_REG")
    2858                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2859              $C$DW$217       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2861                      .dwattr $C$DW$217, DW_AT_name("all")
    2862                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_all")
    2863                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2865              $C$DW$218       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$32)
    2867                      .dwattr $C$DW$218, DW_AT_name("bit")
    2868                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_bit")
    2869                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2870                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2871                      .dwendtag $C$DW$T$33
    2872              
    2873              
    2874              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2875                      .dwattr $C$DW$T$34, DW_AT_name("AQTSRCSEL_BITS")
    2876                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2877              $C$DW$219       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2879                      .dwattr $C$DW$219, DW_AT_name("T1SEL")
    2880                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_T1SEL")
    2881                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    2882                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2884              $C$DW$220       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$220, DW_AT_name("T2SEL")
    2887                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_T2SEL")
    2888                      .dwattr $C$DW$220, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2889                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2890                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$221       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   58

    2893                      .dwattr $C$DW$221, DW_AT_name("rsvd1")
    2894                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd1")
    2895                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2896                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2897                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2898                      .dwendtag $C$DW$T$34
    2899              
    2900              
    2901              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2902                      .dwattr $C$DW$T$35, DW_AT_name("AQTSRCSEL_REG")
    2903                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2904              $C$DW$222       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2906                      .dwattr $C$DW$222, DW_AT_name("all")
    2907                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_all")
    2908                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2910              $C$DW$223       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$34)
    2912                      .dwattr $C$DW$223, DW_AT_name("bit")
    2913                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_bit")
    2914                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2915                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2916                      .dwendtag $C$DW$T$35
    2917              
    2918              
    2919              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2920                      .dwattr $C$DW$T$36, DW_AT_name("CMPA_BITS")
    2921                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2922              $C$DW$224       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2924                      .dwattr $C$DW$224, DW_AT_name("CMPAHR")
    2925                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_CMPAHR")
    2926                      .dwattr $C$DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2927                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2928                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2929              $C$DW$225       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2931                      .dwattr $C$DW$225, DW_AT_name("CMPA")
    2932                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_CMPA")
    2933                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2934                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2935                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2936                      .dwendtag $C$DW$T$36
    2937              
    2938              
    2939              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2940                      .dwattr $C$DW$T$38, DW_AT_name("CMPA_REG")
    2941                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2942              $C$DW$226       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$37)
    2944                      .dwattr $C$DW$226, DW_AT_name("all")
    2945                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_all")
    2946                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2947                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   59

    2948              $C$DW$227       .dwtag  DW_TAG_member
    2949                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$36)
    2950                      .dwattr $C$DW$227, DW_AT_name("bit")
    2951                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_bit")
    2952                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2953                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2954                      .dwendtag $C$DW$T$38
    2955              
    2956              
    2957              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2958                      .dwattr $C$DW$T$39, DW_AT_name("CMPB_BITS")
    2959                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2960              $C$DW$228       .dwtag  DW_TAG_member
    2961                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2962                      .dwattr $C$DW$228, DW_AT_name("CMPBHR")
    2963                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_CMPBHR")
    2964                      .dwattr $C$DW$228, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2965                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2966                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2967              $C$DW$229       .dwtag  DW_TAG_member
    2968                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2969                      .dwattr $C$DW$229, DW_AT_name("CMPB")
    2970                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_CMPB")
    2971                      .dwattr $C$DW$229, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2972                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2973                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2974                      .dwendtag $C$DW$T$39
    2975              
    2976              
    2977              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2978                      .dwattr $C$DW$T$40, DW_AT_name("CMPB_REG")
    2979                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2980              $C$DW$230       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$37)
    2982                      .dwattr $C$DW$230, DW_AT_name("all")
    2983                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_all")
    2984                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2985                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2986              $C$DW$231       .dwtag  DW_TAG_member
    2987                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$39)
    2988                      .dwattr $C$DW$231, DW_AT_name("bit")
    2989                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_bit")
    2990                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2991                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2992                      .dwendtag $C$DW$T$40
    2993              
    2994              
    2995              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2996                      .dwattr $C$DW$T$41, DW_AT_name("CMPCTL2_BITS")
    2997                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2998              $C$DW$232       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3000                      .dwattr $C$DW$232, DW_AT_name("LOADCMODE")
    3001                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_LOADCMODE")
    3002                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   60

    3003                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3004                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$233       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3007                      .dwattr $C$DW$233, DW_AT_name("LOADDMODE")
    3008                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_LOADDMODE")
    3009                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3010                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3012              $C$DW$234       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3014                      .dwattr $C$DW$234, DW_AT_name("SHDWCMODE")
    3015                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_SHDWCMODE")
    3016                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3017                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3018                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3019              $C$DW$235       .dwtag  DW_TAG_member
    3020                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3021                      .dwattr $C$DW$235, DW_AT_name("rsvd1")
    3022                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd1")
    3023                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3024                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$236       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3028                      .dwattr $C$DW$236, DW_AT_name("SHDWDMODE")
    3029                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_SHDWDMODE")
    3030                      .dwattr $C$DW$236, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3031                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$237       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$237, DW_AT_name("rsvd2")
    3036                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd2")
    3037                      .dwattr $C$DW$237, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x03)
    3038                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3039                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$238       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3042                      .dwattr $C$DW$238, DW_AT_name("LOADCSYNC")
    3043                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_LOADCSYNC")
    3044                      .dwattr $C$DW$238, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3045                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3046                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$239       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3049                      .dwattr $C$DW$239, DW_AT_name("LOADDSYNC")
    3050                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_LOADDSYNC")
    3051                      .dwattr $C$DW$239, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3052                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3053                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$240       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    3056                      .dwattr $C$DW$240, DW_AT_name("rsvd3")
    3057                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd3")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   61

    3058                      .dwattr $C$DW$240, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3059                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3060                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3061                      .dwendtag $C$DW$T$41
    3062              
    3063              
    3064              $C$DW$T$42      .dwtag  DW_TAG_union_type
    3065                      .dwattr $C$DW$T$42, DW_AT_name("CMPCTL2_REG")
    3066                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    3067              $C$DW$241       .dwtag  DW_TAG_member
    3068                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3069                      .dwattr $C$DW$241, DW_AT_name("all")
    3070                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_all")
    3071                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3072                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3073              $C$DW$242       .dwtag  DW_TAG_member
    3074                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$41)
    3075                      .dwattr $C$DW$242, DW_AT_name("bit")
    3076                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_bit")
    3077                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3078                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3079                      .dwendtag $C$DW$T$42
    3080              
    3081              
    3082              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3083                      .dwattr $C$DW$T$43, DW_AT_name("CMPCTL_BITS")
    3084                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    3085              $C$DW$243       .dwtag  DW_TAG_member
    3086                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3087                      .dwattr $C$DW$243, DW_AT_name("LOADAMODE")
    3088                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_LOADAMODE")
    3089                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3090                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3091                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3092              $C$DW$244       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3094                      .dwattr $C$DW$244, DW_AT_name("LOADBMODE")
    3095                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_LOADBMODE")
    3096                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3097                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3098                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3099              $C$DW$245       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3101                      .dwattr $C$DW$245, DW_AT_name("SHDWAMODE")
    3102                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_SHDWAMODE")
    3103                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3104                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$246       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3108                      .dwattr $C$DW$246, DW_AT_name("rsvd1")
    3109                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd1")
    3110                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3111                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   62

    3113              $C$DW$247       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3115                      .dwattr $C$DW$247, DW_AT_name("SHDWBMODE")
    3116                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_SHDWBMODE")
    3117                      .dwattr $C$DW$247, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3118                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3119                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3120              $C$DW$248       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3122                      .dwattr $C$DW$248, DW_AT_name("rsvd2")
    3123                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_rsvd2")
    3124                      .dwattr $C$DW$248, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3125                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3126                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3127              $C$DW$249       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3129                      .dwattr $C$DW$249, DW_AT_name("SHDWAFULL")
    3130                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_SHDWAFULL")
    3131                      .dwattr $C$DW$249, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3132                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3133                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3134              $C$DW$250       .dwtag  DW_TAG_member
    3135                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3136                      .dwattr $C$DW$250, DW_AT_name("SHDWBFULL")
    3137                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_SHDWBFULL")
    3138                      .dwattr $C$DW$250, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3139                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3140                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3141              $C$DW$251       .dwtag  DW_TAG_member
    3142                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3143                      .dwattr $C$DW$251, DW_AT_name("LOADASYNC")
    3144                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_LOADASYNC")
    3145                      .dwattr $C$DW$251, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3146                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3147                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3148              $C$DW$252       .dwtag  DW_TAG_member
    3149                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3150                      .dwattr $C$DW$252, DW_AT_name("LOADBSYNC")
    3151                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_LOADBSYNC")
    3152                      .dwattr $C$DW$252, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3153                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3154                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3155              $C$DW$253       .dwtag  DW_TAG_member
    3156                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3157                      .dwattr $C$DW$253, DW_AT_name("rsvd3")
    3158                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_rsvd3")
    3159                      .dwattr $C$DW$253, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3160                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3161                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3162                      .dwendtag $C$DW$T$43
    3163              
    3164              
    3165              $C$DW$T$44      .dwtag  DW_TAG_union_type
    3166                      .dwattr $C$DW$T$44, DW_AT_name("CMPCTL_REG")
    3167                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   63

    3168              $C$DW$254       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    3170                      .dwattr $C$DW$254, DW_AT_name("all")
    3171                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_all")
    3172                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3173                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3174              $C$DW$255       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$43)
    3176                      .dwattr $C$DW$255, DW_AT_name("bit")
    3177                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_bit")
    3178                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3179                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3180                      .dwendtag $C$DW$T$44
    3181              
    3182              
    3183              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    3184                      .dwattr $C$DW$T$45, DW_AT_name("DBCTL2_BITS")
    3185                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    3186              $C$DW$256       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3188                      .dwattr $C$DW$256, DW_AT_name("LOADDBCTLMODE")
    3189                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_LOADDBCTLMODE")
    3190                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3191                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3192                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3193              $C$DW$257       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3195                      .dwattr $C$DW$257, DW_AT_name("SHDWDBCTLMODE")
    3196                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_SHDWDBCTLMODE")
    3197                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3198                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3199                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3200              $C$DW$258       .dwtag  DW_TAG_member
    3201                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3202                      .dwattr $C$DW$258, DW_AT_name("rsvd1")
    3203                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd1")
    3204                      .dwattr $C$DW$258, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3205                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3206                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3207                      .dwendtag $C$DW$T$45
    3208              
    3209              
    3210              $C$DW$T$46      .dwtag  DW_TAG_union_type
    3211                      .dwattr $C$DW$T$46, DW_AT_name("DBCTL2_REG")
    3212                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    3213              $C$DW$259       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3215                      .dwattr $C$DW$259, DW_AT_name("all")
    3216                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_all")
    3217                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3218                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$260       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$45)
    3221                      .dwattr $C$DW$260, DW_AT_name("bit")
    3222                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   64

    3223                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3224                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3225                      .dwendtag $C$DW$T$46
    3226              
    3227              
    3228              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3229                      .dwattr $C$DW$T$47, DW_AT_name("DBCTL_BITS")
    3230                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    3231              $C$DW$261       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3233                      .dwattr $C$DW$261, DW_AT_name("OUT_MODE")
    3234                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_OUT_MODE")
    3235                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3236                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3237                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3238              $C$DW$262       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3240                      .dwattr $C$DW$262, DW_AT_name("POLSEL")
    3241                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_POLSEL")
    3242                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3243                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$263       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3247                      .dwattr $C$DW$263, DW_AT_name("IN_MODE")
    3248                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_IN_MODE")
    3249                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    3250                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3251                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3252              $C$DW$264       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3254                      .dwattr $C$DW$264, DW_AT_name("LOADREDMODE")
    3255                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_LOADREDMODE")
    3256                      .dwattr $C$DW$264, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    3257                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3258                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3259              $C$DW$265       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3261                      .dwattr $C$DW$265, DW_AT_name("LOADFEDMODE")
    3262                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_LOADFEDMODE")
    3263                      .dwattr $C$DW$265, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3264                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3265                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3266              $C$DW$266       .dwtag  DW_TAG_member
    3267                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3268                      .dwattr $C$DW$266, DW_AT_name("SHDWDBREDMODE")
    3269                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_SHDWDBREDMODE")
    3270                      .dwattr $C$DW$266, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3271                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3272                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3273              $C$DW$267       .dwtag  DW_TAG_member
    3274                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3275                      .dwattr $C$DW$267, DW_AT_name("SHDWDBFEDMODE")
    3276                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_SHDWDBFEDMODE")
    3277                      .dwattr $C$DW$267, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   65

    3278                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3279                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3280              $C$DW$268       .dwtag  DW_TAG_member
    3281                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3282                      .dwattr $C$DW$268, DW_AT_name("OUTSWAP")
    3283                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_OUTSWAP")
    3284                      .dwattr $C$DW$268, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3285                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3286                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3287              $C$DW$269       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3289                      .dwattr $C$DW$269, DW_AT_name("DEDB_MODE")
    3290                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_DEDB_MODE")
    3291                      .dwattr $C$DW$269, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3292                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3293                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3294              $C$DW$270       .dwtag  DW_TAG_member
    3295                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3296                      .dwattr $C$DW$270, DW_AT_name("HALFCYCLE")
    3297                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_HALFCYCLE")
    3298                      .dwattr $C$DW$270, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3299                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3300                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3301                      .dwendtag $C$DW$T$47
    3302              
    3303              
    3304              $C$DW$T$48      .dwtag  DW_TAG_union_type
    3305                      .dwattr $C$DW$T$48, DW_AT_name("DBCTL_REG")
    3306                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    3307              $C$DW$271       .dwtag  DW_TAG_member
    3308                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3309                      .dwattr $C$DW$271, DW_AT_name("all")
    3310                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_all")
    3311                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3313              $C$DW$272       .dwtag  DW_TAG_member
    3314                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$47)
    3315                      .dwattr $C$DW$272, DW_AT_name("bit")
    3316                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_bit")
    3317                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3318                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3319                      .dwendtag $C$DW$T$48
    3320              
    3321              
    3322              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3323                      .dwattr $C$DW$T$49, DW_AT_name("DBFEDHR_BITS")
    3324                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    3325              $C$DW$273       .dwtag  DW_TAG_member
    3326                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    3327                      .dwattr $C$DW$273, DW_AT_name("rsvd1")
    3328                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_rsvd1")
    3329                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3330                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3331                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3332              $C$DW$274       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   66

    3333                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3334                      .dwattr $C$DW$274, DW_AT_name("rsvd2")
    3335                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_rsvd2")
    3336                      .dwattr $C$DW$274, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x07)
    3337                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3338                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3339              $C$DW$275       .dwtag  DW_TAG_member
    3340                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    3341                      .dwattr $C$DW$275, DW_AT_name("rsvd3")
    3342                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_rsvd3")
    3343                      .dwattr $C$DW$275, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3344                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3345                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3346              $C$DW$276       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3348                      .dwattr $C$DW$276, DW_AT_name("DBFEDHR")
    3349                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_DBFEDHR")
    3350                      .dwattr $C$DW$276, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    3351                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3352                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3353                      .dwendtag $C$DW$T$49
    3354              
    3355              
    3356              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3357                      .dwattr $C$DW$T$50, DW_AT_name("DBFEDHR_REG")
    3358                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    3359              $C$DW$277       .dwtag  DW_TAG_member
    3360                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3361                      .dwattr $C$DW$277, DW_AT_name("all")
    3362                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_all")
    3363                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3364                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$278       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$49)
    3367                      .dwattr $C$DW$278, DW_AT_name("bit")
    3368                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_bit")
    3369                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3370                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3371                      .dwendtag $C$DW$T$50
    3372              
    3373              
    3374              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3375                      .dwattr $C$DW$T$51, DW_AT_name("DBREDHR_BITS")
    3376                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    3377              $C$DW$279       .dwtag  DW_TAG_member
    3378                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    3379                      .dwattr $C$DW$279, DW_AT_name("rsvd1")
    3380                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_rsvd1")
    3381                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3382                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3383                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3384              $C$DW$280       .dwtag  DW_TAG_member
    3385                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    3386                      .dwattr $C$DW$280, DW_AT_name("rsvd2")
    3387                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   67

    3388                      .dwattr $C$DW$280, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x07)
    3389                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3390                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3391              $C$DW$281       .dwtag  DW_TAG_member
    3392                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    3393                      .dwattr $C$DW$281, DW_AT_name("rsvd3")
    3394                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_rsvd3")
    3395                      .dwattr $C$DW$281, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3396                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3397                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3398              $C$DW$282       .dwtag  DW_TAG_member
    3399                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    3400                      .dwattr $C$DW$282, DW_AT_name("DBREDHR")
    3401                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_DBREDHR")
    3402                      .dwattr $C$DW$282, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    3403                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3404                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3405                      .dwendtag $C$DW$T$51
    3406              
    3407              
    3408              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3409                      .dwattr $C$DW$T$52, DW_AT_name("DBREDHR_REG")
    3410                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    3411              $C$DW$283       .dwtag  DW_TAG_member
    3412                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    3413                      .dwattr $C$DW$283, DW_AT_name("all")
    3414                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_all")
    3415                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3416                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3417              $C$DW$284       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$51)
    3419                      .dwattr $C$DW$284, DW_AT_name("bit")
    3420                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_bit")
    3421                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3422                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3423                      .dwendtag $C$DW$T$52
    3424              
    3425              
    3426              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3427                      .dwattr $C$DW$T$53, DW_AT_name("DCACTL_BITS")
    3428                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    3429              $C$DW$285       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    3431                      .dwattr $C$DW$285, DW_AT_name("EVT1SRCSEL")
    3432                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_EVT1SRCSEL")
    3433                      .dwattr $C$DW$285, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3434                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3435                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3436              $C$DW$286       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3438                      .dwattr $C$DW$286, DW_AT_name("EVT1FRCSYNCSEL")
    3439                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_EVT1FRCSYNCSEL")
    3440                      .dwattr $C$DW$286, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3441                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   68

    3443              $C$DW$287       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3445                      .dwattr $C$DW$287, DW_AT_name("EVT1SOCE")
    3446                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_EVT1SOCE")
    3447                      .dwattr $C$DW$287, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3448                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3449                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$288       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3452                      .dwattr $C$DW$288, DW_AT_name("EVT1SYNCE")
    3453                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_EVT1SYNCE")
    3454                      .dwattr $C$DW$288, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3455                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3456                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3457              $C$DW$289       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    3459                      .dwattr $C$DW$289, DW_AT_name("rsvd1")
    3460                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_rsvd1")
    3461                      .dwattr $C$DW$289, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    3462                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3463                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$290       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    3466                      .dwattr $C$DW$290, DW_AT_name("EVT2SRCSEL")
    3467                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_EVT2SRCSEL")
    3468                      .dwattr $C$DW$290, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3469                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3470                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3471              $C$DW$291       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    3473                      .dwattr $C$DW$291, DW_AT_name("EVT2FRCSYNCSEL")
    3474                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_EVT2FRCSYNCSEL")
    3475                      .dwattr $C$DW$291, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3476                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3477                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3478              $C$DW$292       .dwtag  DW_TAG_member
    3479                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    3480                      .dwattr $C$DW$292, DW_AT_name("rsvd2")
    3481                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_rsvd2")
    3482                      .dwattr $C$DW$292, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    3483                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3484                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3485                      .dwendtag $C$DW$T$53
    3486              
    3487              
    3488              $C$DW$T$54      .dwtag  DW_TAG_union_type
    3489                      .dwattr $C$DW$T$54, DW_AT_name("DCACTL_REG")
    3490                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    3491              $C$DW$293       .dwtag  DW_TAG_member
    3492                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    3493                      .dwattr $C$DW$293, DW_AT_name("all")
    3494                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_all")
    3495                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3496                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$294       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   69

    3498                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$53)
    3499                      .dwattr $C$DW$294, DW_AT_name("bit")
    3500                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_bit")
    3501                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3502                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3503                      .dwendtag $C$DW$T$54
    3504              
    3505              
    3506              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3507                      .dwattr $C$DW$T$55, DW_AT_name("DCAHTRIPSEL_BITS")
    3508                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    3509              $C$DW$295       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    3511                      .dwattr $C$DW$295, DW_AT_name("TRIPINPUT1")
    3512                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_TRIPINPUT1")
    3513                      .dwattr $C$DW$295, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3514                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3515                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$296       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    3518                      .dwattr $C$DW$296, DW_AT_name("TRIPINPUT2")
    3519                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_TRIPINPUT2")
    3520                      .dwattr $C$DW$296, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3521                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3522                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3523              $C$DW$297       .dwtag  DW_TAG_member
    3524                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    3525                      .dwattr $C$DW$297, DW_AT_name("TRIPINPUT3")
    3526                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_TRIPINPUT3")
    3527                      .dwattr $C$DW$297, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3528                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3529                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3530              $C$DW$298       .dwtag  DW_TAG_member
    3531                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    3532                      .dwattr $C$DW$298, DW_AT_name("TRIPINPUT4")
    3533                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_TRIPINPUT4")
    3534                      .dwattr $C$DW$298, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3535                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3536                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3537              $C$DW$299       .dwtag  DW_TAG_member
    3538                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    3539                      .dwattr $C$DW$299, DW_AT_name("TRIPINPUT5")
    3540                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_TRIPINPUT5")
    3541                      .dwattr $C$DW$299, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3542                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3544              $C$DW$300       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    3546                      .dwattr $C$DW$300, DW_AT_name("TRIPINPUT6")
    3547                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_TRIPINPUT6")
    3548                      .dwattr $C$DW$300, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3549                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3550                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3551              $C$DW$301       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:38:02 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
steering_config.asm                                                  PAGE   70

    3553                      .dwattr $C$DW$301, DW_AT_name("TRIPINPUT7")
    3554                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_TRIPINPUT7")
    3555                      .dwattr $C$DW$301, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3556                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3557                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3558              $C$DW$302       .dwtag  DW_TAG_member
    3559                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    3560                      .dwattr $C$DW$302, DW_AT_name("TRIPINPUT8")
    3561                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_TRIPINPUT8")
    3562                      .dwattr $C$DW$302, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3563                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3564                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3565              $C$DW$303       .dwtag  DW_TAG_member
    3566                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    3567                      .dwattr $C$DW$303, DW_AT_name("TRIPINPUT9")
    3568                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_TRIPINPUT9")
    3569                      .dwattr $C$DW$303, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3570                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3571                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3572              $C$DW$304       .dwtag  DW_TAG_member
    3573                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    3574                      .dwattr $C$DW$304, DW_AT_name("TRIPINPUT10")
    3575                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_TRIPINPUT10")
    3576                      .dwattr $C$DW$304, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3577                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3578                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3579              $C$DW$305       .dwtag  DW_TAG_member
    3580                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    3581                      .dwattr $C$DW$305, DW_AT_name("TRIPINPUT11")
    3582                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_TRIPINPUT11")
    3583                      .dwattr $C$DW$305, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3584                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3585                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3586              $C$DW$306       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    3588                      .dwattr $C$DW$306, DW_AT_name("TRIPINPUT12")
    3589                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_TRIPINPUT12")
    3590                      .dwattr $C$DW$306, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3591                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3592                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3593              $C$DW$307       .dwtag  DW_TAG_member
