TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 13:37:41 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../TI/Drivers/sysctl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SysCtlDelay")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SysCtlDelay")
      16                      .dwattr $C$DW$1, DW_AT_declaration

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   28

    1409              ;*                                                             *
    1410              ;* FUNCTION ENVIRONMENT                                        *
    1411              ;*                                                             *
    1412              ;* FUNCTION PROPERTIES                                         *
    1413              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1414              ;***************************************************************
    1415              
    1416 00000271       _SysCtlUSBPLLEnable:
    1417                      .dwcfi  cfa_offset, -2
    1418                      .dwcfi  save_reg_to_mem, 26, 0
    1419                      .dwpsn  file "../TI/Drivers/sysctl.c",line 771,column 1,is_stmt,isa 0
    1420              $C$DW$64        .dwtag  DW_TAG_TI_branch
    1421                      .dwattr $C$DW$64, DW_AT_low_pc(0x00)
    1422                      .dwattr $C$DW$64, DW_AT_TI_return
    1423 00000271 0006          LRETR     ; [CPU_] 
    1424                      ; return occurs ; [] 
    1425                      .dwattr $C$DW$63, DW_AT_TI_end_file("../TI/Drivers/sysctl.c")
    1426                      .dwattr $C$DW$63, DW_AT_TI_end_line(0x303)
    1427                      .dwattr $C$DW$63, DW_AT_TI_end_column(0x01)
    1428                      .dwendentry
    1429                      .dwendtag $C$DW$63
    1430              
    1431 00000272               .sect   ".text"
    1432                      .clink
    1433                      .global _SysCtlUSBPLLDisable
    1434              
    1435              $C$DW$65        .dwtag  DW_TAG_subprogram, DW_AT_name("SysCtlUSBPLLDisable")
    1436                      .dwattr $C$DW$65, DW_AT_low_pc(_SysCtlUSBPLLDisable)
    1437                      .dwattr $C$DW$65, DW_AT_high_pc(0x00)
    1438                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SysCtlUSBPLLDisable")
    1439                      .dwattr $C$DW$65, DW_AT_external
    1440                      .dwattr $C$DW$65, DW_AT_TI_begin_file("../TI/Drivers/sysctl.c")
    1441                      .dwattr $C$DW$65, DW_AT_TI_begin_line(0x310)
    1442                      .dwattr $C$DW$65, DW_AT_TI_begin_column(0x01)
    1443                      .dwattr $C$DW$65, DW_AT_TI_max_frame_size(-2)
    1444                      .dwpsn  file "../TI/Drivers/sysctl.c",line 785,column 1,is_stmt,address _SysCtlUSBPLLDisable,isa 0
    1445              
    1446                      .dwfde $C$DW$CIE, _SysCtlUSBPLLDisable
    1447              
    1448              ;***************************************************************
    1449              ;* FNAME: _SysCtlUSBPLLDisable          FR SIZE:   0           *
    1450              ;*                                                             *
    1451              ;* FUNCTION ENVIRONMENT                                        *
    1452              ;*                                                             *
    1453              ;* FUNCTION PROPERTIES                                         *
    1454              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1455              ;***************************************************************
    1456              
    1457 00000272       _SysCtlUSBPLLDisable:
    1458                      .dwcfi  cfa_offset, -2
    1459                      .dwcfi  save_reg_to_mem, 26, 0
    1460                      .dwpsn  file "../TI/Drivers/sysctl.c",line 788,column 1,is_stmt,isa 0
    1461              $C$DW$66        .dwtag  DW_TAG_TI_branch
    1462                      .dwattr $C$DW$66, DW_AT_low_pc(0x00)
    1463                      .dwattr $C$DW$66, DW_AT_TI_return
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   29

    1464 00000272 0006          LRETR     ; [CPU_] 
    1465                      ; return occurs ; [] 
    1466                      .dwattr $C$DW$65, DW_AT_TI_end_file("../TI/Drivers/sysctl.c")
    1467                      .dwattr $C$DW$65, DW_AT_TI_end_line(0x314)
    1468                      .dwattr $C$DW$65, DW_AT_TI_end_column(0x01)
    1469                      .dwendentry
    1470                      .dwendtag $C$DW$65
    1471              
    1472              ;**************************************************************
    1473              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1474              ;**************************************************************
    1475                      .global _SysCtlDelay
    1476                      .global _WdRegs
    1477                      .global _ClkCfgRegs
    1478                      .global _CpuSysRegs
    1479                      .global _DevCfgRegs
    1480              
    1481              ;***************************************************************
    1482              ;* TYPE INFORMATION                                            *
    1483              ;***************************************************************
    1484              
    1485              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1486                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
    1487                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1488              $C$DW$67        .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$67, DW_AT_name("AUXPLLDIV")
    1491                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_AUXPLLDIV")
    1492                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1493                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1495              $C$DW$68        .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1497                      .dwattr $C$DW$68, DW_AT_name("rsvd1")
    1498                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd1")
    1499                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1500                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$69        .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1504                      .dwattr $C$DW$69, DW_AT_name("rsvd2")
    1505                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd2")
    1506                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1507                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1508                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1509                      .dwendtag $C$DW$T$20
    1510              
    1511              
    1512              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1513                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
    1514                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1515              $C$DW$70        .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1517                      .dwattr $C$DW$70, DW_AT_name("all")
    1518                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   30

    1519                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$71        .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1523                      .dwattr $C$DW$71, DW_AT_name("bit")
    1524                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
    1525                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1526                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1527                      .dwendtag $C$DW$T$22
    1528              
    1529              
    1530              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1531                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
    1532                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1533              $C$DW$72        .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1535                      .dwattr $C$DW$72, DW_AT_name("PLLEN")
    1536                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PLLEN")
    1537                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1538                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$73        .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1542                      .dwattr $C$DW$73, DW_AT_name("PLLCLKEN")
    1543                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PLLCLKEN")
    1544                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1545                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1546                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1547              $C$DW$74        .dwtag  DW_TAG_member
    1548                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1549                      .dwattr $C$DW$74, DW_AT_name("rsvd1")
    1550                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd1")
    1551                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1552                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1554              $C$DW$75        .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1556                      .dwattr $C$DW$75, DW_AT_name("rsvd2")
    1557                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd2")
    1558                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1559                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1560                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1561                      .dwendtag $C$DW$T$23
    1562              
    1563              
    1564              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1565                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
    1566                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1567              $C$DW$76        .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
    1569                      .dwattr $C$DW$76, DW_AT_name("all")
    1570                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
    1571                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$77        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   31

    1574                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
    1575                      .dwattr $C$DW$77, DW_AT_name("bit")
    1576                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
    1577                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1578                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1579                      .dwendtag $C$DW$T$24
    1580              
    1581              
    1582              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1583                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
    1584                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1585              $C$DW$78        .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1587                      .dwattr $C$DW$78, DW_AT_name("IMULT")
    1588                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_IMULT")
    1589                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    1590                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$79        .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
    1595                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
    1596                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1597                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$80        .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1601                      .dwattr $C$DW$80, DW_AT_name("FMULT")
    1602                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_FMULT")
    1603                      .dwattr $C$DW$80, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1604                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$81        .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$81, DW_AT_name("rsvd2")
    1609                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd2")
    1610                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1611                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1613              $C$DW$82        .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1615                      .dwattr $C$DW$82, DW_AT_name("rsvd3")
    1616                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd3")
    1617                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1618                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1619                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1620                      .dwendtag $C$DW$T$25
    1621              
    1622              
    1623              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1624                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
    1625                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1626              $C$DW$83        .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    1628                      .dwattr $C$DW$83, DW_AT_name("all")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   32

    1629                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
    1630                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1631                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$84        .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$25)
    1634                      .dwattr $C$DW$84, DW_AT_name("bit")
    1635                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
    1636                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1638                      .dwendtag $C$DW$T$26
    1639              
    1640              
    1641              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1642                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
    1643                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1644              $C$DW$85        .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$85, DW_AT_name("LOCKS")
    1647                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_LOCKS")
    1648                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1649                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$86        .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$86, DW_AT_name("SLIPS")
    1654                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_SLIPS")
    1655                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1656                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$87        .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$87, DW_AT_name("rsvd1")
    1661                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd1")
    1662                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1663                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$88        .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$88, DW_AT_name("rsvd2")
    1668                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd2")
    1669                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1670                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1671                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1672                      .dwendtag $C$DW$T$27
    1673              
    1674              
    1675              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1676                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
    1677                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1678              $C$DW$89        .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
    1680                      .dwattr $C$DW$89, DW_AT_name("all")
    1681                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
    1682                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   33

    1684              $C$DW$90        .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$27)
    1686                      .dwattr $C$DW$90, DW_AT_name("bit")
    1687                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
    1688                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1690                      .dwendtag $C$DW$T$28
    1691              
    1692              
    1693              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1694                      .dwattr $C$DW$T$29, DW_AT_name("CLKCFGLOCK1_BITS")
    1695                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1696              $C$DW$91        .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$91, DW_AT_name("CLKSRCCTL1")
    1699                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1700                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1703              $C$DW$92        .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1705                      .dwattr $C$DW$92, DW_AT_name("CLKSRCCTL2")
    1706                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1707                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1708                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$93        .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$93, DW_AT_name("CLKSRCCTL3")
    1713                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1714                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1715                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$94        .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$94, DW_AT_name("SYSPLLCTL1")
    1720                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1721                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1724              $C$DW$95        .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$95, DW_AT_name("SYSPLLCTL2")
    1727                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1728                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1729                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$96        .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$96, DW_AT_name("SYSPLLCTL3")
    1734                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1735                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1738              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   34

    1739                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1740                      .dwattr $C$DW$97, DW_AT_name("SYSPLLMULT")
    1741                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1742                      .dwattr $C$DW$97, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1743                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$98        .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1747                      .dwattr $C$DW$98, DW_AT_name("AUXPLLCTL1")
    1748                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1749                      .dwattr $C$DW$98, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1750                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$99        .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
    1755                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
    1756                      .dwattr $C$DW$99, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1757                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$100       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1762                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1763                      .dwattr $C$DW$100, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1764                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1766              $C$DW$101       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$101, DW_AT_name("AUXPLLMULT")
    1769                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1770                      .dwattr $C$DW$101, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1771                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$102       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1775                      .dwattr $C$DW$102, DW_AT_name("SYSCLKDIVSEL")
    1776                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1777                      .dwattr $C$DW$102, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1778                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$103       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$103, DW_AT_name("AUXCLKDIVSEL")
    1783                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1784                      .dwattr $C$DW$103, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$104       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$104, DW_AT_name("PERCLKDIVSEL")
    1790                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1791                      .dwattr $C$DW$104, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1792                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   35

    1794              $C$DW$105       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$105, DW_AT_name("rsvd3")
    1797                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd3")
    1798                      .dwattr $C$DW$105, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1799                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$106       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$106, DW_AT_name("LOSPCP")
    1804                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_LOSPCP")
    1805                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1806                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1808              $C$DW$107       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$107, DW_AT_name("rsvd4")
    1811                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd4")
    1812                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1813                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1814                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1815                      .dwendtag $C$DW$T$29
    1816              
    1817              
    1818              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1819                      .dwattr $C$DW$T$30, DW_AT_name("CLKCFGLOCK1_REG")
    1820                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1821              $C$DW$108       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1823                      .dwattr $C$DW$108, DW_AT_name("all")
    1824                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    1825                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$109       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$29)
    1829                      .dwattr $C$DW$109, DW_AT_name("bit")
    1830                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    1831                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1833                      .dwendtag $C$DW$T$30
    1834              
    1835              
    1836              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1837                      .dwattr $C$DW$T$31, DW_AT_name("CLKSRCCTL1_BITS")
    1838                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1839              $C$DW$110       .dwtag  DW_TAG_member
    1840                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1841                      .dwattr $C$DW$110, DW_AT_name("OSCCLKSRCSEL")
    1842                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1843                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1844                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1845                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1846              $C$DW$111       .dwtag  DW_TAG_member
    1847                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1848                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   36

    1849                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1850                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1851                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1852                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1853              $C$DW$112       .dwtag  DW_TAG_member
    1854                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1855                      .dwattr $C$DW$112, DW_AT_name("INTOSC2OFF")
    1856                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1857                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1858                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1859                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1860              $C$DW$113       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1862                      .dwattr $C$DW$113, DW_AT_name("XTALOFF")
    1863                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_XTALOFF")
    1864                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1865                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$114       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$114, DW_AT_name("WDHALTI")
    1870                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_WDHALTI")
    1871                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1872                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1874              $C$DW$115       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    1877                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    1878                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1879                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$116       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1883                      .dwattr $C$DW$116, DW_AT_name("rsvd3")
    1884                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd3")
    1885                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1886                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1887                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1888                      .dwendtag $C$DW$T$31
    1889              
    1890              
    1891              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1892                      .dwattr $C$DW$T$32, DW_AT_name("CLKSRCCTL1_REG")
    1893                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1894              $C$DW$117       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    1896                      .dwattr $C$DW$117, DW_AT_name("all")
    1897                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1898                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1899                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1900              $C$DW$118       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$31)
    1902                      .dwattr $C$DW$118, DW_AT_name("bit")
    1903                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   37

    1904                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1906                      .dwendtag $C$DW$T$32
    1907              
    1908              
    1909              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1910                      .dwattr $C$DW$T$33, DW_AT_name("CLKSRCCTL2_BITS")
    1911                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1912              $C$DW$119       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1914                      .dwattr $C$DW$119, DW_AT_name("AUXOSCCLKSRCSEL")
    1915                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1916                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1917                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1918                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1919              $C$DW$120       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$120, DW_AT_name("CANABCLKSEL")
    1922                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1923                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1924                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1925                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$121       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1928                      .dwattr $C$DW$121, DW_AT_name("CANBBCLKSEL")
    1929                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1930                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1931                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1932                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$122       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1935                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1936                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    1937                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1938                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1939                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1940              $C$DW$123       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1942                      .dwattr $C$DW$123, DW_AT_name("rsvd2")
    1943                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd2")
    1944                      .dwattr $C$DW$123, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1945                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1947              $C$DW$124       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1949                      .dwattr $C$DW$124, DW_AT_name("rsvd3")
    1950                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd3")
    1951                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1952                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1953                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1954              $C$DW$125       .dwtag  DW_TAG_member
    1955                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1956                      .dwattr $C$DW$125, DW_AT_name("rsvd4")
    1957                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd4")
    1958                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   38

    1959                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1960                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1961                      .dwendtag $C$DW$T$33
    1962              
    1963              
    1964              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1965                      .dwattr $C$DW$T$34, DW_AT_name("CLKSRCCTL2_REG")
    1966                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1967              $C$DW$126       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    1969                      .dwattr $C$DW$126, DW_AT_name("all")
    1970                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    1971                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1972                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1973              $C$DW$127       .dwtag  DW_TAG_member
    1974                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$33)
    1975                      .dwattr $C$DW$127, DW_AT_name("bit")
    1976                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    1977                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1979                      .dwendtag $C$DW$T$34
    1980              
    1981              
    1982              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1983                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL3_BITS")
    1984                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1985              $C$DW$128       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$128, DW_AT_name("XCLKOUTSEL")
    1988                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1989                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1990                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$129       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    1995                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    1996                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1997                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$130       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    2002                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    2003                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2004                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2005                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2006                      .dwendtag $C$DW$T$35
    2007              
    2008              
    2009              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2010                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL3_REG")
    2011                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2012              $C$DW$131       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   39

    2014                      .dwattr $C$DW$131, DW_AT_name("all")
    2015                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    2016                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$132       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$35)
    2020                      .dwattr $C$DW$132, DW_AT_name("bit")
    2021                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    2022                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2024                      .dwendtag $C$DW$T$36
    2025              
    2026              
    2027              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2028                      .dwattr $C$DW$T$39, DW_AT_name("CLK_CFG_REGS")
    2029                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x32)
    2030              $C$DW$133       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$37)
    2032                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    2033                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    2034                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2035                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$134       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$30)
    2038                      .dwattr $C$DW$134, DW_AT_name("CLKCFGLOCK1")
    2039                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    2040                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2041                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$135       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
    2044                      .dwattr $C$DW$135, DW_AT_name("rsvd2")
    2045                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd2")
    2046                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2047                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$136       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$32)
    2050                      .dwattr $C$DW$136, DW_AT_name("CLKSRCCTL1")
    2051                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2052                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2053                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$137       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$34)
    2056                      .dwattr $C$DW$137, DW_AT_name("CLKSRCCTL2")
    2057                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2058                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2059                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2060              $C$DW$138       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$36)
    2062                      .dwattr $C$DW$138, DW_AT_name("CLKSRCCTL3")
    2063                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2064                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2065                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2066              $C$DW$139       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$178)
    2068                      .dwattr $C$DW$139, DW_AT_name("SYSPLLCTL1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   40

    2069                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2070                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2071                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2072              $C$DW$140       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$38)
    2074                      .dwattr $C$DW$140, DW_AT_name("rsvd3")
    2075                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd3")
    2076                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2077                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2078              $C$DW$141       .dwtag  DW_TAG_member
    2079                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$180)
    2080                      .dwattr $C$DW$141, DW_AT_name("SYSPLLMULT")
    2081                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2082                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2083                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2084              $C$DW$142       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$182)
    2086                      .dwattr $C$DW$142, DW_AT_name("SYSPLLSTS")
    2087                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_SYSPLLSTS")
    2088                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2089                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2090              $C$DW$143       .dwtag  DW_TAG_member
    2091                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$24)
    2092                      .dwattr $C$DW$143, DW_AT_name("AUXPLLCTL1")
    2093                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2094                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2095                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2096              $C$DW$144       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$38)
    2098                      .dwattr $C$DW$144, DW_AT_name("rsvd4")
    2099                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd4")
    2100                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2101                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2102              $C$DW$145       .dwtag  DW_TAG_member
    2103                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$26)
    2104                      .dwattr $C$DW$145, DW_AT_name("AUXPLLMULT")
    2105                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2106                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2107                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$146       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$28)
    2110                      .dwattr $C$DW$146, DW_AT_name("AUXPLLSTS")
    2111                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_AUXPLLSTS")
    2112                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2113                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$147       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$176)
    2116                      .dwattr $C$DW$147, DW_AT_name("SYSCLKDIVSEL")
    2117                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2118                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2119                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2120              $C$DW$148       .dwtag  DW_TAG_member
    2121                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    2122                      .dwattr $C$DW$148, DW_AT_name("AUXCLKDIVSEL")
    2123                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   41

    2124                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2125                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2126              $C$DW$149       .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$138)
    2128                      .dwattr $C$DW$149, DW_AT_name("PERCLKDIVSEL")
    2129                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2130                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2131                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2132              $C$DW$150       .dwtag  DW_TAG_member
    2133                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$199)
    2134                      .dwattr $C$DW$150, DW_AT_name("XCLKOUTDIVSEL")
    2135                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    2136                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2137                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$151       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$37)
    2140                      .dwattr $C$DW$151, DW_AT_name("rsvd5")
    2141                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd5")
    2142                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2143                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2144              $C$DW$152       .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$98)
    2146                      .dwattr $C$DW$152, DW_AT_name("LOSPCP")
    2147                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_LOSPCP")
    2148                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2149                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$153       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$102)
    2152                      .dwattr $C$DW$153, DW_AT_name("MCDCR")
    2153                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_MCDCR")
    2154                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2155                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2156              $C$DW$154       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$197)
    2158                      .dwattr $C$DW$154, DW_AT_name("X1CNT")
    2159                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_X1CNT")
    2160                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2161                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2162                      .dwendtag $C$DW$T$39
    2163              
    2164              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    2165                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$39)
    2166              $C$DW$T$211     .dwtag  DW_TAG_volatile_type
    2167                      .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$155)
    2168              
    2169              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2170                      .dwattr $C$DW$T$40, DW_AT_name("CPUSYSLOCK1_BITS")
    2171                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2172              $C$DW$156       .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2174                      .dwattr $C$DW$156, DW_AT_name("HIBBOOTMODE")
    2175                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2176                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2177                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2178                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   42

    2179              $C$DW$157       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2181                      .dwattr $C$DW$157, DW_AT_name("IORESTOREADDR")
    2182                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2183                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2184                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2186              $C$DW$158       .dwtag  DW_TAG_member
    2187                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2188                      .dwattr $C$DW$158, DW_AT_name("PIEVERRADDR")
    2189                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2190                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2191                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2193              $C$DW$159       .dwtag  DW_TAG_member
    2194                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2195                      .dwattr $C$DW$159, DW_AT_name("PCLKCR0")
    2196                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PCLKCR0")
    2197                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2198                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2199                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$160       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2202                      .dwattr $C$DW$160, DW_AT_name("PCLKCR1")
    2203                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PCLKCR1")
    2204                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2205                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2206                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2207              $C$DW$161       .dwtag  DW_TAG_member
    2208                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2209                      .dwattr $C$DW$161, DW_AT_name("PCLKCR2")
    2210                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PCLKCR2")
    2211                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2212                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2214              $C$DW$162       .dwtag  DW_TAG_member
    2215                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2216                      .dwattr $C$DW$162, DW_AT_name("PCLKCR3")
    2217                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PCLKCR3")
    2218                      .dwattr $C$DW$162, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2219                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2220                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2221              $C$DW$163       .dwtag  DW_TAG_member
    2222                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2223                      .dwattr $C$DW$163, DW_AT_name("PCLKCR4")
    2224                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PCLKCR4")
    2225                      .dwattr $C$DW$163, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2226                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2227                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2228              $C$DW$164       .dwtag  DW_TAG_member
    2229                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2230                      .dwattr $C$DW$164, DW_AT_name("PCLKCR5")
    2231                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PCLKCR5")
    2232                      .dwattr $C$DW$164, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2233                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   43

    2234                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2235              $C$DW$165       .dwtag  DW_TAG_member
    2236                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2237                      .dwattr $C$DW$165, DW_AT_name("PCLKCR6")
    2238                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PCLKCR6")
    2239                      .dwattr $C$DW$165, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2240                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2241                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$166       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2244                      .dwattr $C$DW$166, DW_AT_name("PCLKCR7")
    2245                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PCLKCR7")
    2246                      .dwattr $C$DW$166, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2247                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$167       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2251                      .dwattr $C$DW$167, DW_AT_name("PCLKCR8")
    2252                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PCLKCR8")
    2253                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2254                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2256              $C$DW$168       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2258                      .dwattr $C$DW$168, DW_AT_name("PCLKCR9")
    2259                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PCLKCR9")
    2260                      .dwattr $C$DW$168, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2261                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$169       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2265                      .dwattr $C$DW$169, DW_AT_name("PCLKCR10")
    2266                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCLKCR10")
    2267                      .dwattr $C$DW$169, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2268                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2269                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2270              $C$DW$170       .dwtag  DW_TAG_member
    2271                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2272                      .dwattr $C$DW$170, DW_AT_name("PCLKCR11")
    2273                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCLKCR11")
    2274                      .dwattr $C$DW$170, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2275                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2277              $C$DW$171       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$171, DW_AT_name("PCLKCR12")
    2280                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PCLKCR12")
    2281                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2282                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2283                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2284              $C$DW$172       .dwtag  DW_TAG_member
    2285                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2286                      .dwattr $C$DW$172, DW_AT_name("PCLKCR13")
    2287                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCLKCR13")
    2288                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   44

    2289                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2290                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2291              $C$DW$173       .dwtag  DW_TAG_member
    2292                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2293                      .dwattr $C$DW$173, DW_AT_name("PCLKCR14")
    2294                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PCLKCR14")
    2295                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2296                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2297                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2298              $C$DW$174       .dwtag  DW_TAG_member
    2299                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2300                      .dwattr $C$DW$174, DW_AT_name("PCLKCR15")
    2301                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PCLKCR15")
    2302                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2303                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2304                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2305              $C$DW$175       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2307                      .dwattr $C$DW$175, DW_AT_name("PCLKCR16")
    2308                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PCLKCR16")
    2309                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2310                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2311                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2312              $C$DW$176       .dwtag  DW_TAG_member
    2313                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2314                      .dwattr $C$DW$176, DW_AT_name("SECMSEL")
    2315                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SECMSEL")
    2316                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2317                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2318                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2319              $C$DW$177       .dwtag  DW_TAG_member
    2320                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2321                      .dwattr $C$DW$177, DW_AT_name("LPMCR")
    2322                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_LPMCR")
    2323                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2324                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2325                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2326              $C$DW$178       .dwtag  DW_TAG_member
    2327                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2328                      .dwattr $C$DW$178, DW_AT_name("GPIOLPMSEL0")
    2329                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2330                      .dwattr $C$DW$178, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2331                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2332                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2333              $C$DW$179       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$179, DW_AT_name("GPIOLPMSEL1")
    2336                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2337                      .dwattr $C$DW$179, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2338                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2339                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$180       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$180, DW_AT_name("rsvd1")
    2343                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   45

    2344                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2345                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2346                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2347                      .dwendtag $C$DW$T$40
    2348              
    2349              
    2350              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2351                      .dwattr $C$DW$T$41, DW_AT_name("CPUSYSLOCK1_REG")
    2352                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2353              $C$DW$181       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    2355                      .dwattr $C$DW$181, DW_AT_name("all")
    2356                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_all")
    2357                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2358                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2359              $C$DW$182       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    2361                      .dwattr $C$DW$182, DW_AT_name("bit")
    2362                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_bit")
    2363                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2365                      .dwendtag $C$DW$T$41
    2366              
    2367              
    2368              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2369                      .dwattr $C$DW$T$44, DW_AT_name("CPU_SYS_REGS")
    2370                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x82)
    2371              $C$DW$183       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$41)
    2373                      .dwattr $C$DW$183, DW_AT_name("CPUSYSLOCK1")
    2374                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    2375                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2376                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2377              $C$DW$184       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$38)
    2379                      .dwattr $C$DW$184, DW_AT_name("rsvd1")
    2380                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd1")
    2381                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2382                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2383              $C$DW$185       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
    2385                      .dwattr $C$DW$185, DW_AT_name("HIBBOOTMODE")
    2386                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2387                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2388                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2389              $C$DW$186       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$96)
    2391                      .dwattr $C$DW$186, DW_AT_name("IORESTOREADDR")
    2392                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2393                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2394                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2395              $C$DW$187       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$142)
    2397                      .dwattr $C$DW$187, DW_AT_name("PIEVERRADDR")
    2398                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PIEVERRADDR")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   46

    2399                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2400                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2401              $C$DW$188       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$42)
    2403                      .dwattr $C$DW$188, DW_AT_name("rsvd2")
    2404                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd2")
    2405                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2406                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2407              $C$DW$189       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$108)
    2409                      .dwattr $C$DW$189, DW_AT_name("PCLKCR0")
    2410                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCLKCR0")
    2411                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2412                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2413              $C$DW$190       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$122)
    2415                      .dwattr $C$DW$190, DW_AT_name("PCLKCR1")
    2416                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PCLKCR1")
    2417                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2418                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2419              $C$DW$191       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$124)
    2421                      .dwattr $C$DW$191, DW_AT_name("PCLKCR2")
    2422                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PCLKCR2")
    2423                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2424                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2425              $C$DW$192       .dwtag  DW_TAG_member
    2426                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$126)
    2427                      .dwattr $C$DW$192, DW_AT_name("PCLKCR3")
    2428                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PCLKCR3")
    2429                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2430                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2431              $C$DW$193       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$128)
    2433                      .dwattr $C$DW$193, DW_AT_name("PCLKCR4")
    2434                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PCLKCR4")
    2435                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2436                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2437              $C$DW$194       .dwtag  DW_TAG_member
    2438                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$37)
    2439                      .dwattr $C$DW$194, DW_AT_name("rsvd3")
    2440                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd3")
    2441                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2442                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2443              $C$DW$195       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$130)
    2445                      .dwattr $C$DW$195, DW_AT_name("PCLKCR6")
    2446                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_PCLKCR6")
    2447                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2448                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2449              $C$DW$196       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$132)
    2451                      .dwattr $C$DW$196, DW_AT_name("PCLKCR7")
    2452                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PCLKCR7")
    2453                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   47

    2454                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2455              $C$DW$197       .dwtag  DW_TAG_member
    2456                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$134)
    2457                      .dwattr $C$DW$197, DW_AT_name("PCLKCR8")
    2458                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PCLKCR8")
    2459                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2460                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2461              $C$DW$198       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$136)
    2463                      .dwattr $C$DW$198, DW_AT_name("PCLKCR9")
    2464                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PCLKCR9")
    2465                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2466                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2467              $C$DW$199       .dwtag  DW_TAG_member
    2468                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$110)
    2469                      .dwattr $C$DW$199, DW_AT_name("PCLKCR10")
    2470                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PCLKCR10")
    2471                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2472                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2473              $C$DW$200       .dwtag  DW_TAG_member
    2474                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$112)
    2475                      .dwattr $C$DW$200, DW_AT_name("PCLKCR11")
    2476                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PCLKCR11")
    2477                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2478                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2479              $C$DW$201       .dwtag  DW_TAG_member
    2480                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$114)
    2481                      .dwattr $C$DW$201, DW_AT_name("PCLKCR12")
    2482                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PCLKCR12")
    2483                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2484                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2485              $C$DW$202       .dwtag  DW_TAG_member
    2486                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$116)
    2487                      .dwattr $C$DW$202, DW_AT_name("PCLKCR13")
    2488                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCLKCR13")
    2489                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2490                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2491              $C$DW$203       .dwtag  DW_TAG_member
    2492                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$118)
    2493                      .dwattr $C$DW$203, DW_AT_name("PCLKCR14")
    2494                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCLKCR14")
    2495                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2496                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2497              $C$DW$204       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$37)
    2499                      .dwattr $C$DW$204, DW_AT_name("rsvd4")
    2500                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd4")
    2501                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2502                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2503              $C$DW$205       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$120)
    2505                      .dwattr $C$DW$205, DW_AT_name("PCLKCR16")
    2506                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PCLKCR16")
    2507                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2508                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   48

    2509              $C$DW$206       .dwtag  DW_TAG_member
    2510                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$43)
    2511                      .dwattr $C$DW$206, DW_AT_name("rsvd5")
    2512                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd5")
    2513                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2514                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2515              $C$DW$207       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$148)
    2517                      .dwattr $C$DW$207, DW_AT_name("SECMSEL")
    2518                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SECMSEL")
    2519                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2520                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2521              $C$DW$208       .dwtag  DW_TAG_member
    2522                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$100)
    2523                      .dwattr $C$DW$208, DW_AT_name("LPMCR")
    2524                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_LPMCR")
    2525                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2526                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2527              $C$DW$209       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$92)
    2529                      .dwattr $C$DW$209, DW_AT_name("GPIOLPMSEL0")
    2530                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2531                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2532                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2533              $C$DW$210       .dwtag  DW_TAG_member
    2534                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$94)
    2535                      .dwattr $C$DW$210, DW_AT_name("GPIOLPMSEL1")
    2536                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2537                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2538                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2539              $C$DW$211       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$184)
    2541                      .dwattr $C$DW$211, DW_AT_name("TMR2CLKCTL")
    2542                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    2543                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2544                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2545              $C$DW$212       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$37)
    2547                      .dwattr $C$DW$212, DW_AT_name("rsvd6")
    2548                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd6")
    2549                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2550                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2551              $C$DW$213       .dwtag  DW_TAG_member
    2552                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$144)
    2553                      .dwattr $C$DW$213, DW_AT_name("RESC")
    2554                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_RESC")
    2555                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2556                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2557                      .dwendtag $C$DW$T$44
    2558              
    2559              $C$DW$214       .dwtag  DW_TAG_TI_far_type
    2560                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$44)
    2561              $C$DW$T$212     .dwtag  DW_TAG_volatile_type
    2562                      .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$214)
    2563              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   49

    2564              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2565                      .dwattr $C$DW$T$45, DW_AT_name("DC0_BITS")
    2566                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2567              $C$DW$215       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2569                      .dwattr $C$DW$215, DW_AT_name("SINGLE_CORE")
    2570                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_SINGLE_CORE")
    2571                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2572                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2574              $C$DW$216       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2576                      .dwattr $C$DW$216, DW_AT_name("rsvd1")
    2577                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd1")
    2578                      .dwattr $C$DW$216, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    2579                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2581              $C$DW$217       .dwtag  DW_TAG_member
    2582                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2583                      .dwattr $C$DW$217, DW_AT_name("rsvd2")
    2584                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd2")
    2585                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2586                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2587                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2588                      .dwendtag $C$DW$T$45
    2589              
    2590              
    2591              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2592                      .dwattr $C$DW$T$46, DW_AT_name("DC0_REG")
    2593                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2594              $C$DW$218       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$21)
    2596                      .dwattr $C$DW$218, DW_AT_name("all")
    2597                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_all")
    2598                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2599                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2600              $C$DW$219       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$45)
    2602                      .dwattr $C$DW$219, DW_AT_name("bit")
    2603                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_bit")
    2604                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2606                      .dwendtag $C$DW$T$46
    2607              
    2608              
    2609              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2610                      .dwattr $C$DW$T$47, DW_AT_name("DC10_BITS")
    2611                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2612              $C$DW$220       .dwtag  DW_TAG_member
    2613                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2614                      .dwattr $C$DW$220, DW_AT_name("I2C_A")
    2615                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_I2C_A")
    2616                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2617                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2618                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 13:37:42 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
sysctl.asm                                                           PAGE   50

    2619              $C$DW$221       .dwtag  DW_TAG_member
    2620                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2621                      .dwattr $C$DW$221, DW_AT_name("I2C_B")
    2622                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_I2C_B")
    2623                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2624                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2626              $C$DW$222       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$222, DW_AT_name("rsvd1")
    2629                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd1")
    2630                      .dwattr $C$DW$222, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2631                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2632                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2633              $C$DW$223       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2635                      .dwattr $C$DW$223, DW_AT_name("rsvd2")
    2636                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd2")
    2637                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2638                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2639                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$224       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2642                      .dwattr $C$DW$224, DW_AT_name("rsvd3")
    2643                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd3")
    2644                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2645                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
