TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.4.2 *
       3              ;* Date/Time created: Thu Dec 14 15:26:55 2017                 *
       4              ;***************************************************************
       5                      .compiler_opts --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_m
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../Source/App/WiFly_Commands.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 C/C++ Codegen PC v6.4.2 Copyright (c) 1996-2015 Texa
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("U:\02_MSE\MT\07_Software\CCS_workspace\DiffDrive_v0.93\F2837x_FLASH
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *
      15              ;**************************************************************

    3338              ;* TYPE INFORMATION                                            *
    3339              ;***************************************************************
    3340              
    3341              $C$DW$T$281     .dwtag  DW_TAG_enumeration_type
    3342                      .dwattr $C$DW$T$281, DW_AT_byte_size(0x01)
    3343              $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("NO_CMD"), DW_AT_const_value(0x00)
    3344              $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("STATE_CHANGE_CMD"), DW_AT_const_value(0x01)
    3345              $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("CONFIG_MODE_CMD"), DW_AT_const_value(0x02)
    3346              $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("DRIVE_CMD"), DW_AT_const_value(0x03)
    3347                      .dwendtag $C$DW$T$281
    3348              
    3349              $C$DW$T$282     .dwtag  DW_TAG_typedef, DW_AT_name("wyflyCommands_t")
    3350                      .dwattr $C$DW$T$282, DW_AT_type(*$C$DW$T$281)
    3351                      .dwattr $C$DW$T$282, DW_AT_language(DW_LANG_C)
    3352              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   67

    3353              $C$DW$T$288     .dwtag  DW_TAG_enumeration_type
    3354                      .dwattr $C$DW$T$288, DW_AT_byte_size(0x01)
    3355              $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_STOP"), DW_AT_const_value(0x00)
    3356              $C$DW$262       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_CONFIG"), DW_AT_const_value(0x01)
    3357              $C$DW$263       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_RUN"), DW_AT_const_value(0x02)
    3358              $C$DW$264       .dwtag  DW_TAG_enumerator, DW_AT_name("FSM_ERROR"), DW_AT_const_value(0x03)
    3359                      .dwendtag $C$DW$T$288
    3360              
    3361              $C$DW$T$289     .dwtag  DW_TAG_typedef, DW_AT_name("fsm_main_state_t")
    3362                      .dwattr $C$DW$T$289, DW_AT_type(*$C$DW$T$288)
    3363                      .dwattr $C$DW$T$289, DW_AT_language(DW_LANG_C)
    3364              $C$DW$T$290     .dwtag  DW_TAG_pointer_type
    3365                      .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$289)
    3366                      .dwattr $C$DW$T$290, DW_AT_address_class(0x20)
    3367              
    3368              $C$DW$T$291     .dwtag  DW_TAG_enumeration_type
    3369                      .dwattr $C$DW$T$291, DW_AT_byte_size(0x01)
    3370              $C$DW$265       .dwtag  DW_TAG_enumerator, DW_AT_name("COMBINED"), DW_AT_const_value(0x00)
    3371              $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("ARTICULATED_STEERING"), DW_AT_const_value(0x01)
    3372              $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("TURNTABLE_STEERING"), DW_AT_const_value(0x02)
    3373              $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_LEFT"), DW_AT_const_value(0x03)
    3374              $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_POTENTIOMETER_RIGHT"), DW_AT_const_value(0x04)
    3375              $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_LEFT"), DW_AT_const_value(0x05)
    3376              $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_SERVO_MIDDLE"), DW_AT_const_value(0x06)
    3377              $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("INCREMENT_SERVO"), DW_AT_const_value(0x07)
    3378              $C$DW$273       .dwtag  DW_TAG_enumerator, DW_AT_name("DECREMENT_SERVO"), DW_AT_const_value(0x08)
    3379              $C$DW$274       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_0"), DW_AT_const_value(0x09)
    3380              $C$DW$275       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_1"), DW_AT_const_value(0x0a)
    3381              $C$DW$276       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_2"), DW_AT_const_value(0x0b)
    3382              $C$DW$277       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_3"), DW_AT_const_value(0x0c)
    3383              $C$DW$278       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_4"), DW_AT_const_value(0x0d)
    3384              $C$DW$279       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_5"), DW_AT_const_value(0x0e)
    3385              $C$DW$280       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_STEERING_POINT_6"), DW_AT_const_value(0x0f)
    3386              $C$DW$281       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_0"), DW_AT_const_value(0x10)
    3387              $C$DW$282       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_1"), DW_AT_const_value(0x11)
    3388              $C$DW$283       .dwtag  DW_TAG_enumerator, DW_AT_name("SET_AXIS_POINT_2"), DW_AT_const_value(0x12)
    3389                      .dwendtag $C$DW$T$291
    3390              
    3391              $C$DW$T$292     .dwtag  DW_TAG_typedef, DW_AT_name("config_mode_cmd_t")
    3392                      .dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$291)
    3393                      .dwattr $C$DW$T$292, DW_AT_language(DW_LANG_C)
    3394              $C$DW$T$293     .dwtag  DW_TAG_pointer_type
    3395                      .dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$292)
    3396                      .dwattr $C$DW$T$293, DW_AT_address_class(0x20)
    3397              
    3398              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3399                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    3400              $C$DW$284       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    3402                      .dwattr $C$DW$284, DW_AT_name("As")
    3403                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_As")
    3404                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3405                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3406              $C$DW$285       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   68

    3408                      .dwattr $C$DW$285, DW_AT_name("Bs")
    3409                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_Bs")
    3410                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3411                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$286       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3414                      .dwattr $C$DW$286, DW_AT_name("Cs")
    3415                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_Cs")
    3416                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3417                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3418              $C$DW$287       .dwtag  DW_TAG_member
    3419                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3420                      .dwattr $C$DW$287, DW_AT_name("Alpha")
    3421                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_Alpha")
    3422                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3423                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3424              $C$DW$288       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3426                      .dwattr $C$DW$288, DW_AT_name("Beta")
    3427                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_Beta")
    3428                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3429                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3430                      .dwendtag $C$DW$T$20
    3431              
    3432              $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("CLARKE")
    3433                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$20)
    3434                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3435              
    3436              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3437                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x0e)
    3438              $C$DW$289       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    3440                      .dwattr $C$DW$289, DW_AT_name("Alpha")
    3441                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_Alpha")
    3442                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3443                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3444              $C$DW$290       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    3446                      .dwattr $C$DW$290, DW_AT_name("Beta")
    3447                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_Beta")
    3448                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3449                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$291       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    3452                      .dwattr $C$DW$291, DW_AT_name("Angle")
    3453                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_Angle")
    3454                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3455                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3456              $C$DW$292       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    3458                      .dwattr $C$DW$292, DW_AT_name("Ds")
    3459                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_Ds")
    3460                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3461                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3462              $C$DW$293       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   69

    3463                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    3464                      .dwattr $C$DW$293, DW_AT_name("Qs")
    3465                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_Qs")
    3466                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3467                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$294       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    3470                      .dwattr $C$DW$294, DW_AT_name("Sine")
    3471                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_Sine")
    3472                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3473                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3474              $C$DW$295       .dwtag  DW_TAG_member
    3475                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    3476                      .dwattr $C$DW$295, DW_AT_name("Cosine")
    3477                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_Cosine")
    3478                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3479                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3480                      .dwendtag $C$DW$T$21
    3481              
    3482              $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("PARK")
    3483                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$21)
    3484                      .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3485              
    3486              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3487                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0e)
    3488              $C$DW$296       .dwtag  DW_TAG_member
    3489                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    3490                      .dwattr $C$DW$296, DW_AT_name("Alpha")
    3491                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_Alpha")
    3492                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3493                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3494              $C$DW$297       .dwtag  DW_TAG_member
    3495                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    3496                      .dwattr $C$DW$297, DW_AT_name("Beta")
    3497                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_Beta")
    3498                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3499                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3500              $C$DW$298       .dwtag  DW_TAG_member
    3501                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    3502                      .dwattr $C$DW$298, DW_AT_name("Angle")
    3503                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_Angle")
    3504                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3505                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3506              $C$DW$299       .dwtag  DW_TAG_member
    3507                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    3508                      .dwattr $C$DW$299, DW_AT_name("Ds")
    3509                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_Ds")
    3510                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3511                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3512              $C$DW$300       .dwtag  DW_TAG_member
    3513                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    3514                      .dwattr $C$DW$300, DW_AT_name("Qs")
    3515                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_Qs")
    3516                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3517                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   70

    3518              $C$DW$301       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    3520                      .dwattr $C$DW$301, DW_AT_name("Sine")
    3521                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_Sine")
    3522                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3523                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3524              $C$DW$302       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    3526                      .dwattr $C$DW$302, DW_AT_name("Cosine")
    3527                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_Cosine")
    3528                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3529                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3530                      .dwendtag $C$DW$T$22
    3531              
    3532              $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("IPARK")
    3533                      .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    3534                      .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3535              
    3536              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3537                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x18)
    3538              $C$DW$303       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    3540                      .dwattr $C$DW$303, DW_AT_name("Ref")
    3541                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_Ref")
    3542                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3543                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3544              $C$DW$304       .dwtag  DW_TAG_member
    3545                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    3546                      .dwattr $C$DW$304, DW_AT_name("Fbk")
    3547                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_Fbk")
    3548                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3549                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3550              $C$DW$305       .dwtag  DW_TAG_member
    3551                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    3552                      .dwattr $C$DW$305, DW_AT_name("Out")
    3553                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_Out")
    3554                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3555                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3556              $C$DW$306       .dwtag  DW_TAG_member
    3557                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    3558                      .dwattr $C$DW$306, DW_AT_name("Kp")
    3559                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_Kp")
    3560                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3561                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3562              $C$DW$307       .dwtag  DW_TAG_member
    3563                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    3564                      .dwattr $C$DW$307, DW_AT_name("Ki")
    3565                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_Ki")
    3566                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3567                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3568              $C$DW$308       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    3570                      .dwattr $C$DW$308, DW_AT_name("Umax")
    3571                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_Umax")
    3572                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   71

    3573                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3574              $C$DW$309       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    3576                      .dwattr $C$DW$309, DW_AT_name("Umin")
    3577                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_Umin")
    3578                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3579                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3580              $C$DW$310       .dwtag  DW_TAG_member
    3581                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    3582                      .dwattr $C$DW$310, DW_AT_name("up")
    3583                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_up")
    3584                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3585                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3586              $C$DW$311       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    3588                      .dwattr $C$DW$311, DW_AT_name("ui")
    3589                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_ui")
    3590                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3591                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3592              $C$DW$312       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    3594                      .dwattr $C$DW$312, DW_AT_name("v1")
    3595                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_v1")
    3596                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3597                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3598              $C$DW$313       .dwtag  DW_TAG_member
    3599                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    3600                      .dwattr $C$DW$313, DW_AT_name("i1")
    3601                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_i1")
    3602                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3603                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3604              $C$DW$314       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    3606                      .dwattr $C$DW$314, DW_AT_name("w1")
    3607                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_w1")
    3608                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3609                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3610                      .dwendtag $C$DW$T$23
    3611              
    3612              $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("PI_CONTROLLER")
    3613                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$23)
    3614                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3615              
    3616              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3617                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0a)
    3618              $C$DW$315       .dwtag  DW_TAG_member
    3619                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    3620                      .dwattr $C$DW$315, DW_AT_name("Ref")
    3621                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_Ref")
    3622                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3623                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3624              $C$DW$316       .dwtag  DW_TAG_member
    3625                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    3626                      .dwattr $C$DW$316, DW_AT_name("Fbk")
    3627                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_Fbk")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   72

    3628                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3629                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3630              $C$DW$317       .dwtag  DW_TAG_member
    3631                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    3632                      .dwattr $C$DW$317, DW_AT_name("Out")
    3633                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_Out")
    3634                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3635                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$318       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    3638                      .dwattr $C$DW$318, DW_AT_name("c1")
    3639                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_c1")
    3640                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3641                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3642              $C$DW$319       .dwtag  DW_TAG_member
    3643                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    3644                      .dwattr $C$DW$319, DW_AT_name("c2")
    3645                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_c2")
    3646                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3647                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3648                      .dwendtag $C$DW$T$24
    3649              
    3650              $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("PID_TERMINALS")
    3651                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    3652                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3653              
    3654              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3655                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
    3656              $C$DW$320       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    3658                      .dwattr $C$DW$320, DW_AT_name("Kr")
    3659                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_Kr")
    3660                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3661                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3662              $C$DW$321       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    3664                      .dwattr $C$DW$321, DW_AT_name("Kp")
    3665                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_Kp")
    3666                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3667                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3668              $C$DW$322       .dwtag  DW_TAG_member
    3669                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    3670                      .dwattr $C$DW$322, DW_AT_name("Ki")
    3671                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_Ki")
    3672                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3673                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3674              $C$DW$323       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    3676                      .dwattr $C$DW$323, DW_AT_name("Kd")
    3677                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_Kd")
    3678                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3679                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3680              $C$DW$324       .dwtag  DW_TAG_member
    3681                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    3682                      .dwattr $C$DW$324, DW_AT_name("Km")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   73

    3683                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_Km")
    3684                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3685                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$325       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    3688                      .dwattr $C$DW$325, DW_AT_name("Umax")
    3689                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_Umax")
    3690                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3691                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3692              $C$DW$326       .dwtag  DW_TAG_member
    3693                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    3694                      .dwattr $C$DW$326, DW_AT_name("Umin")
    3695                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_Umin")
    3696                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3697                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3698                      .dwendtag $C$DW$T$25
    3699              
    3700              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("PID_PARAMETERS")
    3701                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$25)
    3702                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3703              
    3704              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3705                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    3706              $C$DW$327       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    3708                      .dwattr $C$DW$327, DW_AT_name("up")
    3709                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_up")
    3710                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3711                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$328       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    3714                      .dwattr $C$DW$328, DW_AT_name("ui")
    3715                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_ui")
    3716                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3717                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$329       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    3720                      .dwattr $C$DW$329, DW_AT_name("ud")
    3721                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_ud")
    3722                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3723                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$330       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    3726                      .dwattr $C$DW$330, DW_AT_name("v1")
    3727                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_v1")
    3728                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3729                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$331       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    3732                      .dwattr $C$DW$331, DW_AT_name("i1")
    3733                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_i1")
    3734                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3735                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$332       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   74

    3738                      .dwattr $C$DW$332, DW_AT_name("d1")
    3739                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_d1")
    3740                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3741                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$333       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    3744                      .dwattr $C$DW$333, DW_AT_name("d2")
    3745                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_d2")
    3746                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3747                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$334       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    3750                      .dwattr $C$DW$334, DW_AT_name("w1")
    3751                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_w1")
    3752                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3753                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3754                      .dwendtag $C$DW$T$26
    3755              
    3756              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("PID_DATA")
    3757                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$26)
    3758                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3759              
    3760              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3761                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x28)
    3762              $C$DW$335       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$27)
    3764                      .dwattr $C$DW$335, DW_AT_name("term")
    3765                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_term")
    3766                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3767                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3768              $C$DW$336       .dwtag  DW_TAG_member
    3769                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$28)
    3770                      .dwattr $C$DW$336, DW_AT_name("param")
    3771                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_param")
    3772                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3773                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3774              $C$DW$337       .dwtag  DW_TAG_member
    3775                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$29)
    3776                      .dwattr $C$DW$337, DW_AT_name("data")
    3777                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_data")
    3778                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3779                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3780                      .dwendtag $C$DW$T$30
    3781              
    3782              $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("PID_CONTROLLER")
    3783                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$30)
    3784                      .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3785              
    3786              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3787                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x12)
    3788              $C$DW$338       .dwtag  DW_TAG_member
    3789                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    3790                      .dwattr $C$DW$338, DW_AT_name("Ualpha")
    3791                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_Ualpha")
    3792                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   75

    3793                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3794              $C$DW$339       .dwtag  DW_TAG_member
    3795                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    3796                      .dwattr $C$DW$339, DW_AT_name("Ubeta")
    3797                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_Ubeta")
    3798                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3799                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3800              $C$DW$340       .dwtag  DW_TAG_member
    3801                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    3802                      .dwattr $C$DW$340, DW_AT_name("Ta")
    3803                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_Ta")
    3804                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3805                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3806              $C$DW$341       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    3808                      .dwattr $C$DW$341, DW_AT_name("Tb")
    3809                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_Tb")
    3810                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3811                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3812              $C$DW$342       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    3814                      .dwattr $C$DW$342, DW_AT_name("Tc")
    3815                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_Tc")
    3816                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3817                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3818              $C$DW$343       .dwtag  DW_TAG_member
    3819                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    3820                      .dwattr $C$DW$343, DW_AT_name("tmp1")
    3821                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_tmp1")
    3822                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3823                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$344       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    3826                      .dwattr $C$DW$344, DW_AT_name("tmp2")
    3827                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_tmp2")
    3828                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3829                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3830              $C$DW$345       .dwtag  DW_TAG_member
    3831                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    3832                      .dwattr $C$DW$345, DW_AT_name("tmp3")
    3833                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_tmp3")
    3834                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3835                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3836              $C$DW$346       .dwtag  DW_TAG_member
    3837                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$31)
    3838                      .dwattr $C$DW$346, DW_AT_name("VecSector")
    3839                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_VecSector")
    3840                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3841                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3842                      .dwendtag $C$DW$T$32
    3843              
    3844              $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("SVGEN")
    3845                      .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$32)
    3846                      .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3847              
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   76

    3848              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3849                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    3850              $C$DW$347       .dwtag  DW_TAG_member
    3851                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    3852                      .dwattr $C$DW$347, DW_AT_name("TargetValue")
    3853                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_TargetValue")
    3854                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3855                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3856              $C$DW$348       .dwtag  DW_TAG_member
    3857                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$33)
    3858                      .dwattr $C$DW$348, DW_AT_name("RampDelayMax")
    3859                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_RampDelayMax")
    3860                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3861                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$349       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    3864                      .dwattr $C$DW$349, DW_AT_name("RampLowLimit")
    3865                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_RampLowLimit")
    3866                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3867                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3868              $C$DW$350       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    3870                      .dwattr $C$DW$350, DW_AT_name("RampHighLimit")
    3871                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_RampHighLimit")
    3872                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3873                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3874              $C$DW$351       .dwtag  DW_TAG_member
    3875                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$33)
    3876                      .dwattr $C$DW$351, DW_AT_name("RampDelayCount")
    3877                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_RampDelayCount")
    3878                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3879                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3880              $C$DW$352       .dwtag  DW_TAG_member
    3881                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    3882                      .dwattr $C$DW$352, DW_AT_name("SetpointValue")
    3883                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_SetpointValue")
    3884                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3885                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3886              $C$DW$353       .dwtag  DW_TAG_member
    3887                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$33)
    3888                      .dwattr $C$DW$353, DW_AT_name("EqualFlag")
    3889                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_EqualFlag")
    3890                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3891                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3892              $C$DW$354       .dwtag  DW_TAG_member
    3893                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    3894                      .dwattr $C$DW$354, DW_AT_name("Tmp")
    3895                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_Tmp")
    3896                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3897                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3898                      .dwendtag $C$DW$T$34
    3899              
    3900              $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("RMPCNTL")
    3901                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$34)
    3902                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   77

    3903              
    3904              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3905                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    3906              $C$DW$355       .dwtag  DW_TAG_member
    3907                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    3908                      .dwattr $C$DW$355, DW_AT_name("Freq")
    3909                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_Freq")
    3910                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3911                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3912              $C$DW$356       .dwtag  DW_TAG_member
    3913                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    3914                      .dwattr $C$DW$356, DW_AT_name("StepAngleMax")
    3915                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_StepAngleMax")
    3916                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3917                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$357       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
    3920                      .dwattr $C$DW$357, DW_AT_name("Angle")
    3921                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_Angle")
    3922                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3923                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3924              $C$DW$358       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    3926                      .dwattr $C$DW$358, DW_AT_name("Gain")
    3927                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_Gain")
    3928                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3929                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3930              $C$DW$359       .dwtag  DW_TAG_member
    3931                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    3932                      .dwattr $C$DW$359, DW_AT_name("Out")
    3933                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_Out")
    3934                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3935                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3936              $C$DW$360       .dwtag  DW_TAG_member
    3937                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    3938                      .dwattr $C$DW$360, DW_AT_name("Offset")
    3939                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_Offset")
    3940                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3941                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3942                      .dwendtag $C$DW$T$35
    3943              
    3944              $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("RAMPGEN")
    3945                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$35)
    3946                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3947              
    3948              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3949                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x16)
    3950              $C$DW$361       .dwtag  DW_TAG_member
    3951                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    3952                      .dwattr $C$DW$361, DW_AT_name("DcBusVolt")
    3953                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_DcBusVolt")
    3954                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3955                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$362       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   78

    3958                      .dwattr $C$DW$362, DW_AT_name("MfuncV1")
    3959                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_MfuncV1")
    3960                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3961                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3962              $C$DW$363       .dwtag  DW_TAG_member
    3963                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    3964                      .dwattr $C$DW$363, DW_AT_name("MfuncV2")
    3965                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_MfuncV2")
    3966                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3967                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3968              $C$DW$364       .dwtag  DW_TAG_member
    3969                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    3970                      .dwattr $C$DW$364, DW_AT_name("MfuncV3")
    3971                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_MfuncV3")
    3972                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3973                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$365       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$31)
    3976                      .dwattr $C$DW$365, DW_AT_name("OutOfPhase")
    3977                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_OutOfPhase")
    3978                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3979                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3980              $C$DW$366       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    3982                      .dwattr $C$DW$366, DW_AT_name("VphaseA")
    3983                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_VphaseA")
    3984                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3985                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3986              $C$DW$367       .dwtag  DW_TAG_member
    3987                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    3988                      .dwattr $C$DW$367, DW_AT_name("VphaseB")
    3989                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_VphaseB")
    3990                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3991                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3992              $C$DW$368       .dwtag  DW_TAG_member
    3993                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    3994                      .dwattr $C$DW$368, DW_AT_name("VphaseC")
    3995                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_VphaseC")
    3996                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3997                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3998              $C$DW$369       .dwtag  DW_TAG_member
    3999                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    4000                      .dwattr $C$DW$369, DW_AT_name("Valpha")
    4001                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Valpha")
    4002                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4003                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4004              $C$DW$370       .dwtag  DW_TAG_member
    4005                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    4006                      .dwattr $C$DW$370, DW_AT_name("Vbeta")
    4007                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Vbeta")
    4008                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4009                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4010              $C$DW$371       .dwtag  DW_TAG_member
    4011                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    4012                      .dwattr $C$DW$371, DW_AT_name("temp")
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   79

    4013                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_temp")
    4014                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4015                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4016                      .dwendtag $C$DW$T$36
    4017              
    4018              $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("PHASEVOLTAGE")
    4019                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$36)
    4020                      .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4021              
    4022              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4023                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    4024              $C$DW$372       .dwtag  DW_TAG_member
    4025                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    4026                      .dwattr $C$DW$372, DW_AT_name("ElecTheta")
    4027                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_ElecTheta")
    4028                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4029                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4030              $C$DW$373       .dwtag  DW_TAG_member
    4031                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$33)
    4032                      .dwattr $C$DW$373, DW_AT_name("DirectionQep")
    4033                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_DirectionQep")
    4034                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4035                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4036              $C$DW$374       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    4038                      .dwattr $C$DW$374, DW_AT_name("OldElecTheta")
    4039                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_OldElecTheta")
    4040                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4041                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$375       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    4044                      .dwattr $C$DW$375, DW_AT_name("Speed")
    4045                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Speed")
    4046                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4047                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4048              $C$DW$376       .dwtag  DW_TAG_member
    4049                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$33)
    4050                      .dwattr $C$DW$376, DW_AT_name("BaseRpm")
    4051                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_BaseRpm")
    4052                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4053                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4054              $C$DW$377       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$37)
    4056                      .dwattr $C$DW$377, DW_AT_name("K1")
    4057                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_K1")
    4058                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4059                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4060              $C$DW$378       .dwtag  DW_TAG_member
    4061                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    4062                      .dwattr $C$DW$378, DW_AT_name("K2")
    4063                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_K2")
    4064                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4065                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4066              $C$DW$379       .dwtag  DW_TAG_member
    4067                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   80

    4068                      .dwattr $C$DW$379, DW_AT_name("K3")
    4069                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_K3")
    4070                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4071                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4072              $C$DW$380       .dwtag  DW_TAG_member
    4073                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$38)
    4074                      .dwattr $C$DW$380, DW_AT_name("SpeedRpm")
    4075                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_SpeedRpm")
    4076                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4077                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4078              $C$DW$381       .dwtag  DW_TAG_member
    4079                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
    4080                      .dwattr $C$DW$381, DW_AT_name("Tmp")
    4081                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_Tmp")
    4082                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4083                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4084                      .dwendtag $C$DW$T$39
    4085              
    4086              $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("SPEED_MEAS_QEP")
    4087                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$39)
    4088                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4089              
    4090              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4091                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x12)
    4092              $C$DW$382       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$40)
    4094                      .dwattr $C$DW$382, DW_AT_name("ElecTheta")
    4095                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_ElecTheta")
    4096                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4097                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$383       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$40)
    4100                      .dwattr $C$DW$383, DW_AT_name("MechTheta")
    4101                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_MechTheta")
    4102                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4103                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$384       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$31)
    4106                      .dwattr $C$DW$384, DW_AT_name("DirectionQep")
    4107                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_DirectionQep")
    4108                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4109                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$385       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$31)
    4112                      .dwattr $C$DW$385, DW_AT_name("QepPeriod")
    4113                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_QepPeriod")
    4114                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4115                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$386       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$33)
    4118                      .dwattr $C$DW$386, DW_AT_name("QepCountIndex")
    4119                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_QepCountIndex")
    4120                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4121                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$387       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   81

    4123                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$38)
    4124                      .dwattr $C$DW$387, DW_AT_name("RawTheta")
    4125                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_RawTheta")
    4126                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4127                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4128              $C$DW$388       .dwtag  DW_TAG_member
    4129                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$40)
    4130                      .dwattr $C$DW$388, DW_AT_name("MechScaler")
    4131                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_MechScaler")
    4132                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4133                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4134              $C$DW$389       .dwtag  DW_TAG_member
    4135                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$31)
    4136                      .dwattr $C$DW$389, DW_AT_name("LineEncoder")
    4137                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_LineEncoder")
    4138                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4139                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4140              $C$DW$390       .dwtag  DW_TAG_member
    4141                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$31)
    4142                      .dwattr $C$DW$390, DW_AT_name("PolePairs")
    4143                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_PolePairs")
    4144                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4145                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4146              $C$DW$391       .dwtag  DW_TAG_member
    4147                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$38)
    4148                      .dwattr $C$DW$391, DW_AT_name("CalibratedAngle")
    4149                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_CalibratedAngle")
    4150                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4151                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$392       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$31)
    4154                      .dwattr $C$DW$392, DW_AT_name("IndexSyncFlag")
    4155                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_IndexSyncFlag")
    4156                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4157                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4158                      .dwendtag $C$DW$T$41
    4159              
    4160              $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("QEP")
    4161                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$41)
    4162                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4163              
    4164              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4165                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x07)
    4166              $C$DW$393       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$42)
    4168                      .dwattr $C$DW$393, DW_AT_name("stat_reg1")
    4169                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_stat_reg1")
    4170                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4171                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4172              $C$DW$394       .dwtag  DW_TAG_member
    4173                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$43)
    4174                      .dwattr $C$DW$394, DW_AT_name("stat_reg2")
    4175                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_stat_reg2")
    4176                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4177                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   82

    4178              $C$DW$395       .dwtag  DW_TAG_member
    4179                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$44)
    4180                      .dwattr $C$DW$395, DW_AT_name("cntrl_reg1")
    4181                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_cntrl_reg1")
    4182                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4183                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4184              $C$DW$396       .dwtag  DW_TAG_member
    4185                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$45)
    4186                      .dwattr $C$DW$396, DW_AT_name("cntrl_reg2")
    4187                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_cntrl_reg2")
    4188                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4189                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4190              $C$DW$397       .dwtag  DW_TAG_member
    4191                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$31)
    4192                      .dwattr $C$DW$397, DW_AT_name("readCntrl1")
    4193                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_readCntrl1")
    4194                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4195                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4196              $C$DW$398       .dwtag  DW_TAG_member
    4197                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$31)
    4198                      .dwattr $C$DW$398, DW_AT_name("readCntrl2")
    4199                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_readCntrl2")
    4200                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4201                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4202              $C$DW$399       .dwtag  DW_TAG_member
    4203                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$31)
    4204                      .dwattr $C$DW$399, DW_AT_name("DRV_fault")
    4205                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_DRV_fault")
    4206                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4207                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4208                      .dwendtag $C$DW$T$46
    4209              
    4210              $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8301_Vars")
    4211                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$46)
    4212                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    4213              
    4214              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4215                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x15)
    4216              $C$DW$400       .dwtag  DW_TAG_member
    4217                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$31)
    4218                      .dwattr $C$DW$400, DW_AT_name("Rsvd0")
    4219                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Rsvd0")
    4220                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4221                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4222              $C$DW$401       .dwtag  DW_TAG_member
    4223                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$47)
    4224                      .dwattr $C$DW$401, DW_AT_name("status1_wwd")
    4225                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_status1_wwd")
    4226                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4227                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4228              $C$DW$402       .dwtag  DW_TAG_member
    4229                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$48)
    4230                      .dwattr $C$DW$402, DW_AT_name("status2_ov_vds")
    4231                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_status2_ov_vds")
    4232                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   83

    4233                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4234              $C$DW$403       .dwtag  DW_TAG_member
    4235                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$49)
    4236                      .dwattr $C$DW$403, DW_AT_name("status3_IC")
    4237                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_status3_IC")
    4238                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4239                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4240              $C$DW$404       .dwtag  DW_TAG_member
    4241                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$50)
    4242                      .dwattr $C$DW$404, DW_AT_name("status4_gd_Vgs")
    4243                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_status4_gd_Vgs")
    4244                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4245                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4246              $C$DW$405       .dwtag  DW_TAG_member
    4247                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$51)
    4248                      .dwattr $C$DW$405, DW_AT_name("cntrl5_hs_gd")
    4249                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_cntrl5_hs_gd")
    4250                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4251                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4252              $C$DW$406       .dwtag  DW_TAG_member
    4253                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$52)
    4254                      .dwattr $C$DW$406, DW_AT_name("cntrl6_ls_gd")
    4255                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_cntrl6_ls_gd")
    4256                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4257                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4258              $C$DW$407       .dwtag  DW_TAG_member
    4259                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$53)
    4260                      .dwattr $C$DW$407, DW_AT_name("cntrl7_gd")
    4261                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_cntrl7_gd")
    4262                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4263                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4264              $C$DW$408       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$31)
    4266                      .dwattr $C$DW$408, DW_AT_name("Rsvd8")
    4267                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_Rsvd8")
    4268                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4269                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4270              $C$DW$409       .dwtag  DW_TAG_member
    4271                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$54)
    4272                      .dwattr $C$DW$409, DW_AT_name("cntrl9_IC_ops")
    4273                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_cntrl9_IC_ops")
    4274                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4275                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4276              $C$DW$410       .dwtag  DW_TAG_member
    4277                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$55)
    4278                      .dwattr $C$DW$410, DW_AT_name("cntrlA_shunt_amp")
    4279                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_cntrlA_shunt_amp")
    4280                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4281                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4282              $C$DW$411       .dwtag  DW_TAG_member
    4283                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$56)
    4284                      .dwattr $C$DW$411, DW_AT_name("cntrlB_Vreg")
    4285                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_cntrlB_Vreg")
    4286                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4287                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   84

    4288              $C$DW$412       .dwtag  DW_TAG_member
    4289                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$57)
    4290                      .dwattr $C$DW$412, DW_AT_name("cntrlC_Vds_SNS")
    4291                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_cntrlC_Vds_SNS")
    4292                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4293                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4294              $C$DW$413       .dwtag  DW_TAG_member
    4295                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$31)
    4296                      .dwattr $C$DW$413, DW_AT_name("readCntrl5")
    4297                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_readCntrl5")
    4298                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    4299                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4300              $C$DW$414       .dwtag  DW_TAG_member
    4301                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$31)
    4302                      .dwattr $C$DW$414, DW_AT_name("readCntrl6")
    4303                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_readCntrl6")
    4304                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4305                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4306              $C$DW$415       .dwtag  DW_TAG_member
    4307                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$31)
    4308                      .dwattr $C$DW$415, DW_AT_name("readCntrl7")
    4309                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_readCntrl7")
    4310                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    4311                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4312              $C$DW$416       .dwtag  DW_TAG_member
    4313                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$31)
    4314                      .dwattr $C$DW$416, DW_AT_name("readCntrl9")
    4315                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_readCntrl9")
    4316                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4317                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4318              $C$DW$417       .dwtag  DW_TAG_member
    4319                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$31)
    4320                      .dwattr $C$DW$417, DW_AT_name("readCntrlA")
    4321                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_readCntrlA")
    4322                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4323                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4324              $C$DW$418       .dwtag  DW_TAG_member
    4325                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$31)
    4326                      .dwattr $C$DW$418, DW_AT_name("readCntrlB")
    4327                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_readCntrlB")
    4328                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4329                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4330              $C$DW$419       .dwtag  DW_TAG_member
    4331                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$31)
    4332                      .dwattr $C$DW$419, DW_AT_name("readCntrlC")
    4333                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_readCntrlC")
    4334                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    4335                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4336              $C$DW$420       .dwtag  DW_TAG_member
    4337                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$31)
    4338                      .dwattr $C$DW$420, DW_AT_name("DRV_fault")
    4339                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_DRV_fault")
    4340                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4341                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4342                      .dwendtag $C$DW$T$58
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   85

    4343              
    4344              $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("DRV8305_Vars")
    4345                      .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$58)
    4346                      .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    4347              
    4348              $C$DW$T$78      .dwtag  DW_TAG_structure_type
    4349                      .dwattr $C$DW$T$78, DW_AT_byte_size(0x14c)
    4350              $C$DW$421       .dwtag  DW_TAG_member
    4351                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$60)
    4352                      .dwattr $C$DW$421, DW_AT_name("PwmARegs")
    4353                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_PwmARegs")
    4354                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4355                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4356              $C$DW$422       .dwtag  DW_TAG_member
    4357                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$60)
    4358                      .dwattr $C$DW$422, DW_AT_name("PwmBRegs")
    4359                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_PwmBRegs")
    4360                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4361                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4362              $C$DW$423       .dwtag  DW_TAG_member
    4363                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$60)
    4364                      .dwattr $C$DW$423, DW_AT_name("PwmCRegs")
    4365                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_PwmCRegs")
    4366                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4367                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$424       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$62)
    4370                      .dwattr $C$DW$424, DW_AT_name("QepRegs")
    4371                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_QepRegs")
    4372                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4373                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    4374              $C$DW$425       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$64)
    4376                      .dwattr $C$DW$425, DW_AT_name("SpiRegs")
    4377                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_SpiRegs")
    4378                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4379                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    4380              $C$DW$426       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$31)
    4382                      .dwattr $C$DW$426, DW_AT_name("drvScsPin")
    4383                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_drvScsPin")
    4384                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4385                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    4386              $C$DW$427       .dwtag  DW_TAG_member
    4387                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
    4388                      .dwattr $C$DW$427, DW_AT_name("offset_shntA")
    4389                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_offset_shntA")
    4390                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4391                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$428       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
    4394                      .dwattr $C$DW$428, DW_AT_name("offset_shntB")
    4395                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_offset_shntB")
    4396                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4397                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   86

    4398              $C$DW$429       .dwtag  DW_TAG_member
    4399                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
    4400                      .dwattr $C$DW$429, DW_AT_name("offset_shntC")
    4401                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_offset_shntC")
    4402                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4403                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    4404              $C$DW$430       .dwtag  DW_TAG_member
    4405                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
    4406                      .dwattr $C$DW$430, DW_AT_name("VdTesting")
    4407                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_VdTesting")
    4408                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4409                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$431       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
    4412                      .dwattr $C$DW$431, DW_AT_name("VqTesting")
    4413                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_VqTesting")
    4414                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4415                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    4416              $C$DW$432       .dwtag  DW_TAG_member
    4417                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
    4418                      .dwattr $C$DW$432, DW_AT_name("IdRef")
    4419                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_IdRef")
    4420                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4421                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    4422              $C$DW$433       .dwtag  DW_TAG_member
    4423                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
    4424                      .dwattr $C$DW$433, DW_AT_name("IqRef")
    4425                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_IqRef")
    4426                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4427                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    4428              $C$DW$434       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
    4430                      .dwattr $C$DW$434, DW_AT_name("SpeedRef")
    4431                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_SpeedRef")
    4432                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4433                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    4434              $C$DW$435       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
    4436                      .dwattr $C$DW$435, DW_AT_name("ElecTheta")
    4437                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_ElecTheta")
    4438                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4439                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    4440              $C$DW$436       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$19)
    4442                      .dwattr $C$DW$436, DW_AT_name("MechTheta")
    4443                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_MechTheta")
    4444                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4445                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$437       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$40)
    4448                      .dwattr $C$DW$437, DW_AT_name("currentAs")
    4449                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_currentAs")
    4450                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4451                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$438       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   87

    4453                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$40)
    4454                      .dwattr $C$DW$438, DW_AT_name("currentBs")
    4455                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_currentBs")
    4456                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4457                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4458              $C$DW$439       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$40)
    4460                      .dwattr $C$DW$439, DW_AT_name("currentCs")
    4461                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_currentCs")
    4462                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4463                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$440       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$38)
    4466                      .dwattr $C$DW$440, DW_AT_name("alignCntr")
    4467                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_alignCntr")
    4468                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4469                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4470              $C$DW$441       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$38)
    4472                      .dwattr $C$DW$441, DW_AT_name("alignCnt")
    4473                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_alignCnt")
    4474                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4475                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4476              $C$DW$442       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$31)
    4478                      .dwattr $C$DW$442, DW_AT_name("lsw")
    4479                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_lsw")
    4480                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4481                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4482              $C$DW$443       .dwtag  DW_TAG_member
    4483                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$31)
    4484                      .dwattr $C$DW$443, DW_AT_name("TripFlagDMC")
    4485                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_TripFlagDMC")
    4486                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    4487                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4488              $C$DW$444       .dwtag  DW_TAG_member
    4489                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$31)
    4490                      .dwattr $C$DW$444, DW_AT_name("clearTripFlagDMC")
    4491                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_clearTripFlagDMC")
    4492                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4493                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4494              $C$DW$445       .dwtag  DW_TAG_member
    4495                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$31)
    4496                      .dwattr $C$DW$445, DW_AT_name("RunMotor")
    4497                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_RunMotor")
    4498                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
    4499                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4500              $C$DW$446       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$31)
    4502                      .dwattr $C$DW$446, DW_AT_name("SpeedLoopPrescaler")
    4503                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_SpeedLoopPrescaler")
    4504                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4505                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4506              $C$DW$447       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.4.2 Thu Dec 14 15:26:56 2017

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
WiFly_Commands.asm                                                   PAGE   88

    4508                      .dwattr $C$DW$447, DW_AT_name("SpeedLoopCount")
    4509                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_SpeedLoopCount")
    4510                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x2f]
    4511                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4512              $C$DW$448       .dwtag  DW_TAG_member
    4513                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$31)
    4514                      .dwattr $C$DW$448, DW_AT_name("PosSenseReverse")
    4515                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_PosSenseReverse")
    4516                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4517                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4518              $C$DW$449       .dwtag  DW_TAG_member
    4519                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
    4520                      .dwattr $C$DW$449, DW_AT_name("newCmdDRV")
    4521                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_newCmdDRV")
    4522                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    4523                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$450       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$40)
    4526                      .dwattr $C$DW$450, DW_AT_name("T")
    4527                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_T")
    4528                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4529                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4530              $C$DW$451       .dwtag  DW_TAG_member
    4531                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$65)
    4532                      .dwattr $C$DW$451, DW_AT_name("clarke")
    4533                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_clarke")
    4534                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4535                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4536              $C$DW$452       .dwtag  DW_TAG_member
    4537                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$66)
    4538                      .dwattr $C$DW$452, DW_AT_name("park")
    4539                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_park")
    4540                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    4541                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$453       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$67)
    4544                      .dwattr $C$DW$453, DW_AT_name("ipark")
    4545                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_ipark")
    4546                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    4547                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4548              $C$DW$454       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$68)
    4550                      .dwattr $C$DW$454, DW_AT_name("pi_pos")
    4551                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_pi_pos")
    4552                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    4553                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4554              $C$DW$455       .dwtag  DW_TAG_member
    4555                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$69)
    4556                      .dwattr $C$DW$455, DW_AT_name("pid_spd")
    4557                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_pid_spd")
